/*!
 * Distpicker v1.0.2
 * https://github.com/tshi0912/city-picker
 *
 * Copyright (c) 2014-2016 Tao Shi
 * Released under the MIT license
 *
 * Date: 2016-02-29T12:11:36.473Z
 */

(function (factory) {
	if (typeof define === 'function' && define.amd) {
		// AMD. Register as anonymous module.
		define('ChineseDistricts', [], factory);
	} else {
		// Browser globals.
		factory();
	}
})(function () {

	var ChineseDistricts = {
		1 : {
			110000 : '北京市',
			120000 : '天津市',
			130000 : '河北省',
			140000 : '山西省',
			150000 : '内蒙古自治区',
			210000 : '辽宁省',
			220000 : '吉林省',
			230000 : '黑龙江省',
			310000 : '上海市',
			320000 : '江苏省',
			330000 : '浙江省',
			340000 : '安徽省',
			350000 : '福建省',
			360000 : '江西省',
			370000 : '山东省',
			410000 : '河南省',
			420000 : '湖北省',
			430000 : '湖南省',
			440000 : '广东省',
			450000 : '广西壮族自治区',
			460000 : '海南省',
			500000 : '重庆市',
			510000 : '四川省',
			520000 : '贵州省',
			530000 : '云南省',
			540000 : '西藏自治区',
			610000 : '陕西省',
			620000 : '甘肃省',
			630000 : '青海省',
			640000 : '宁夏回族自治区',
			650000 : '新疆维吾尔自治区',
			710000 : '台湾',
			810000 : '香港',
			820000 : '澳门'
		},
		86 : {
			'A-G' : [{
					code : '340000',
					address : '安徽省'
				}, {
					code : '110000',
					address : '北京市'
				}, {
					code : '500000',
					address : '重庆市'
				}, {
					code : '350000',
					address : '福建省'
				}, {
					code : '620000',
					address : '甘肃省'
				}, {
					code : '440000',
					address : '广东省'
				}, {
					code : '450000',
					address : '广西壮族自治区'
				}, {
					code : '520000',
					address : '贵州省'
				}, {
					code : '820000',
					address : '澳门'
				}
			],
			'H-K' : [{
					code : '460000',
					address : '海南省'
				}, {
					code : '130000',
					address : '河北省'
				}, {
					code : '230000',
					address : '黑龙江省'
				}, {
					code : '410000',
					address : '河南省'
				}, {
					code : '420000',
					address : '湖北省'
				}, {
					code : '430000',
					address : '湖南省'
				}, {
					code : '320000',
					address : '江苏省'
				}, {
					code : '360000',
					address : '江西省'
				}, {
					code : '220000',
					address : '吉林省'
				}
			],
			'L-S' : [{
					code : '210000',
					address : '辽宁省'
				}, {
					code : '150000',
					address : '内蒙古自治区'
				}, {
					code : '640000',
					address : '宁夏回族自治区'
				}, {
					code : '630000',
					address : '青海省'
				}, {
					code : '370000',
					address : '山东省'
				}, {
					code : '310000',
					address : '上海市'
				}, {
					code : '140000',
					address : '山西省'
				}, {
					code : '610000',
					address : '陕西省'
				}, {
					code : '510000',
					address : '四川省'
				}
			],
			'T-Z' : [{
					code : '120000',
					address : '天津市'
				}, {
					code : '650000',
					address : '新疆维吾尔自治区'
				}, {
					code : '540000',
					address : '西藏自治区'
				}, {
					code : '530000',
					address : '云南省'
				}, {
					code : '330000',
					address : '浙江省'
				}, {
					code : '810000',
					address : '香港'
				}, {
					code : '710000',
					address : '台湾'
				}
			]
		},
		110000 : {
			110100 : '北京市',
		},
		110100 : {
			110101 : {
				name : "东城区",
				zipcode : "100011"
			},
			110102 : {
				name : "西城区",
				zipcode : "100032"
			},
			110105 : {
				name : "朝阳区",
				zipcode : "100020"
			},
			110106 : {
				name : "丰台区",
				zipcode : "100071"
			},
			110107 : {
				name : "石景山区",
				zipcode : "100043"
			},
			110108 : {
				name : "海淀区",
				zipcode : "100089"
			},
			110109 : {
				name : "门头沟区",
				zipcode : "102300"
			},
			110111 : {
				name : "房山区",
				zipcode : "102488"
			},
			110112 : {
				name : "通州区",
				zipcode : "101100"
			},
			110113 : {
				name : "顺义区",
				zipcode : "101300"
			},
			110114 : {
				name : "昌平区",
				zipcode : "102200"
			},
			110115 : {
				name : "大兴区",
				zipcode : "102600"
			},
			110116 : {
				name : "怀柔区",
				zipcode : "101400"
			},
			110117 : {
				name : "平谷区",
				zipcode : "101200"
			},
			110228 : {
				name : "密云县",
				zipcode : "101500"
			},
			110229 : {
				name : "延庆县",
				zipcode : "102100"
			}
		},
		120000 : {
			120100 : '天津市'
		},
		120100 : {
			120101 : {
				name : "和平区",
				zipcode : "300041"
			},
			120102 : {
				name : "河东区",
				zipcode : "300171"
			},
			120103 : {
				name : "河西区",
				zipcode : "300202"
			},
			120104 : {
				name : "南开区",
				zipcode : "300100"
			},
			120105 : {
				name : "河北区",
				zipcode : "300143"
			},
			120106 : {
				name : "红桥区",
				zipcode : "300131"
			},
			120110 : {
				name : "东丽区",
				zipcode : "300300"
			},
			120111 : {
				name : "西青区",
				zipcode : "300380"
			},
			120112 : {
				name : "津南区",
				zipcode : "300350"
			},
			120113 : {
				name : "北辰区",
				zipcode : "300400"
			},
			120114 : {
				name : "武清区",
				zipcode : "301700"
			},
			120115 : {
				name : "宝坻区",
				zipcode : "301800"
			},
			120116 : {
				name : "滨海新区",
				zipcode : "300457"
			},
			120221 : {
				name : "宁河县",
				zipcode : "301500"
			},
			120223 : {
				name : "静海县",
				zipcode : "301600"
			},
			120225 : {
				name : "蓟县",
				zipcode : "301900"
			}
		},
		130000 : {
			130100 : '石家庄市',
			130200 : '唐山市',
			130300 : '秦皇岛市',
			130400 : '邯郸市',
			130500 : '邢台市',
			130600 : '保定市',
			130700 : '张家口市',
			130800 : '承德市',
			130900 : '沧州市',
			131000 : '廊坊市',
			131100 : '衡水市'
		},
		130100 : {
			130102 : {
				name : "长安区",
				zipcode : "050011"
			},
			130104 : {
				name : "桥西区",
				zipcode : "050051"
			},
			130105 : {
				name : "新华区",
				zipcode : "050051"
			},
			130107 : {
				name : "井陉矿区",
				zipcode : "050100"
			},
			130108 : {
				name : "裕华区",
				zipcode : "050081"
			},
			130109 : {
				name : "藁城区",
				zipcode : "050300"
			},
			130110 : {
				name : "鹿泉区",
				zipcode : "050300"
			},
			130111 : {
				name : "栾城区",
				zipcode : "050300"
			},
			130121 : {
				name : "井陉县",
				zipcode : "050300"
			},
			130123 : {
				name : "正定县",
				zipcode : "050800"
			},
			130125 : {
				name : "行唐县",
				zipcode : "050600"
			},
			130126 : {
				name : "灵寿县",
				zipcode : "050500"
			},
			130127 : {
				name : "高邑县",
				zipcode : "051330"
			},
			130128 : {
				name : "深泽县",
				zipcode : "052560"
			},
			130129 : {
				name : "赞皇县",
				zipcode : "051230"
			},
			130130 : {
				name : "无极县",
				zipcode : "052400"
			},
			130131 : {
				name : "平山县",
				zipcode : "050400"
			},
			130132 : {
				name : "元氏县",
				zipcode : "051130"
			},
			130133 : {
				name : "赵县",
				zipcode : "051530"
			},
			130181 : {
				name : "辛集市",
				zipcode : "052300"
			},
			130183 : {
				name : "晋州市",
				zipcode : "052200"
			},
			130184 : {
				name : "新乐市",
				zipcode : "050700"
			}
		},
		130200 : {
			130202 : {
				name : "路南区",
				zipcode : "063017"
			},
			130203 : {
				name : "路北区",
				zipcode : "063015"
			},
			130204 : {
				name : "古冶区",
				zipcode : "063104"
			},
			130205 : {
				name : "开平区",
				zipcode : "063021"
			},
			130207 : {
				name : "丰南区",
				zipcode : "063300"
			},
			130208 : {
				name : "丰润区",
				zipcode : "064000"
			},
			130209 : '曹妃甸区',
			130223 : {
				name : "滦县",
				zipcode : "063700"
			},
			130224 : {
				name : "滦南县",
				zipcode : "063500"
			},
			130225 : {
				name : "乐亭县",
				zipcode : "063600"
			},
			130227 : {
				name : "迁西县",
				zipcode : "064300"
			},
			130229 : {
				name : "玉田县",
				zipcode : "064100"
			},
			130281 : {
				name : "遵化市",
				zipcode : "064200"
			},
			130283 : {
				name : "迁安市",
				zipcode : "064400"
			}
		},
		130300 : {
			130302 : {
				name : "海港区",
				zipcode : "066000"
			},
			130303 : {
				name : "山海关区",
				zipcode : "066200"
			},
			130304 : {
				name : "北戴河区",
				zipcode : "066100"
			},
			130321 : {
				name : "青龙满族自治县",
				zipcode : "066500"
			},
			130322 : {
				name : "昌黎县",
				zipcode : "066600"
			},
			130323 : {
				name : "抚宁县",
				zipcode : "066300"
			},
			130324 : {
				name : "卢龙县",
				zipcode : "066400"
			}
		},
		130400 : {
			130402 : {
				name : "邯山区",
				zipcode : "056001"
			},
			130403 : {
				name : "丛台区",
				zipcode : "056004"
			},
			130404 : {
				name : "复兴区",
				zipcode : "056003"
			},
			130406 : {
				name : "峰峰矿区",
				zipcode : "056200"
			},
			130421 : {
				name : "邯郸县",
				zipcode : "056100"
			},
			130423 : {
				name : "临漳县",
				zipcode : "056600"
			},
			130424 : {
				name : "成安县",
				zipcode : "056700"
			},
			130425 : {
				name : "大名县",
				zipcode : "056900"
			},
			130426 : {
				name : "涉县",
				zipcode : "056400"
			},
			130427 : {
				name : "磁县",
				zipcode : "056500"
			},
			130428 : {
				name : "肥乡县",
				zipcode : "057550"
			},
			130429 : {
				name : "永年县",
				zipcode : "057150"
			},
			130430 : {
				name : "邱县",
				zipcode : "057450"
			},
			130431 : {
				name : "鸡泽县",
				zipcode : "057350"
			},
			130432 : {
				name : "广平县",
				zipcode : "057650"
			},
			130433 : {
				name : "馆陶县",
				zipcode : "057750"
			},
			130434 : {
				name : "魏县",
				zipcode : "056800"
			},
			130435 : {
				name : "曲周县",
				zipcode : "057250"
			},
			130481 : {
				name : "武安市",
				zipcode : "056300"
			}
		},
		130500 : {
			130502 : {
				name : "桥东区",
				zipcode : "050011"
			},
			130503 : {
				name : "桥西区",
				zipcode : "054000"
			},
			130521 : {
				name : "邢台县",
				zipcode : "054001"
			},
			130522 : {
				name : "临城县",
				zipcode : "054300"
			},
			130523 : {
				name : "内丘县",
				zipcode : "054200"
			},
			130524 : {
				name : "柏乡县",
				zipcode : "055450"
			},
			130525 : {
				name : "隆尧县",
				zipcode : "055350"
			},
			130526 : {
				name : "任县",
				zipcode : "055150"
			},
			130527 : {
				name : "南和县",
				zipcode : "054400"
			},
			130528 : {
				name : "宁晋县",
				zipcode : "055550"
			},
			130529 : {
				name : "巨鹿县",
				zipcode : "055250"
			},
			130530 : {
				name : "新河县",
				zipcode : "051730"
			},
			130531 : {
				name : "广宗县",
				zipcode : "054600"
			},
			130532 : {
				name : "平乡县",
				zipcode : "054500"
			},
			130533 : {
				name : "威县",
				zipcode : "054700"
			},
			130534 : {
				name : "清河县",
				zipcode : "054800"
			},
			130535 : {
				name : "临西县",
				zipcode : "054900"
			},
			130581 : {
				name : "南宫市",
				zipcode : "055750"
			},
			130582 : {
				name : "沙河市",
				zipcode : "054100"
			}
		},
		130600 : {
			130602 : {
				name : "竞秀区",
				zipcode : "000000"
			},
			130603 : {
				name : "莲池区",
				zipcode : "000000"
			},
			130621 : {
				name : "满城区",
				zipcode : "000000"
			},
			130622 : {
				name : "清苑区",
				zipcode : "000000"
			},
			130623 : {
				name : "涞水县",
				zipcode : "074100"
			},
			130624 : {
				name : "阜平县",
				zipcode : "073200"
			},
			130625 : '徐水区',
			130626 : {
				name : "定兴县",
				zipcode : "072650"
			},
			130627 : {
				name : "唐县",
				zipcode : "072350"
			},
			130628 : {
				name : "高阳县",
				zipcode : "071500"
			},
			130629 : {
				name : "容城县",
				zipcode : "071700"
			},
			130630 : {
				name : "涞源县",
				zipcode : "074300"
			},
			130631 : {
				name : "望都县",
				zipcode : "072450"
			},
			130632 : {
				name : "安新县",
				zipcode : "071600"
			},
			130633 : {
				name : "易县",
				zipcode : "074200"
			},
			130634 : {
				name : "曲阳县",
				zipcode : "073100"
			},
			130635 : {
				name : "蠡县",
				zipcode : "071400"
			},
			130636 : {
				name : "顺平县",
				zipcode : "072250"
			},
			130637 : {
				name : "博野县",
				zipcode : "071300"
			},
			130638 : {
				name : "雄县",
				zipcode : "071800"
			},
			130681 : {
				name : "涿州市",
				zipcode : "072750"
			},
			130682 : {
				name : "定州市",
				zipcode : "073000"
			},
			130683 : {
				name : "安国市",
				zipcode : "071200"
			},
			130684 : {
				name : "高碑店市",
				zipcode : "074000"
			}
		},
		130700 : {
			130702 : {
				name : "桥东区",
				zipcode : "054001"
			},
			130703 : {
				name : "桥西区",
				zipcode : "075061"
			},
			130705 : {
				name : "宣化区",
				zipcode : "075100"
			},
			130706 : {
				name : "下花园区",
				zipcode : "075300"
			},
			130721 : {
				name : "宣化县",
				zipcode : "075100"
			},
			130722 : {
				name : "张北县",
				zipcode : "076450"
			},
			130723 : {
				name : "康保县",
				zipcode : "076650"
			},
			130724 : {
				name : "沽源县",
				zipcode : "076550"
			},
			130725 : {
				name : "尚义县",
				zipcode : "076750"
			},
			130726 : {
				name : "蔚县",
				zipcode : "075700"
			},
			130727 : {
				name : "阳原县",
				zipcode : "075800"
			},
			130728 : {
				name : "怀安县",
				zipcode : "076150"
			},
			130729 : {
				name : "万全县",
				zipcode : "076250"
			},
			130730 : {
				name : "怀来县",
				zipcode : "075400"
			},
			130731 : {
				name : "涿鹿县",
				zipcode : "075600"
			},
			130732 : {
				name : "赤城县",
				zipcode : "075500"
			},
			130733 : {
				name : "崇礼县",
				zipcode : "076350"
			}
		},
		130800 : {
			130802 : {
				name : "双桥区",
				zipcode : "067000"
			},
			130803 : {
				name : "双滦区",
				zipcode : "067000"
			},
			130804 : {
				name : "鹰手营子矿区",
				zipcode : "067200"
			},
			130821 : {
				name : "承德县",
				zipcode : "067400"
			},
			130822 : {
				name : "兴隆县",
				zipcode : "067300"
			},
			130823 : {
				name : "平泉县",
				zipcode : "067500"
			},
			130824 : {
				name : "滦平县",
				zipcode : "068250"
			},
			130825 : {
				name : "隆化县",
				zipcode : "068150"
			},
			130826 : {
				name : "丰宁满族自治县",
				zipcode : "068350"
			},
			130827 : {
				name : "宽城满族自治县",
				zipcode : "067600"
			},
			130828 : {
				name : "围场满族蒙古族自治县",
				zipcode : "068450"
			}
		},
		130900 : {
			130902 : {
				name : "新华区",
				zipcode : "061000"
			},
			130903 : {
				name : "运河区",
				zipcode : "061000"
			},
			130921 : {
				name : "沧县",
				zipcode : "061000"
			},
			130922 : {
				name : "青县",
				zipcode : "062650"
			},
			130923 : {
				name : "东光县",
				zipcode : "061600"
			},
			130924 : {
				name : "海兴县",
				zipcode : "061200"
			},
			130925 : {
				name : "盐山县",
				zipcode : "061300"
			},
			130926 : {
				name : "肃宁县",
				zipcode : "062350"
			},
			130927 : {
				name : "南皮县",
				zipcode : "061500"
			},
			130928 : {
				name : "吴桥县",
				zipcode : "061800"
			},
			130929 : {
				name : "献县",
				zipcode : "062250"
			},
			130930 : {
				name : "孟村回族自治县",
				zipcode : "061400"
			},
			130981 : {
				name : "泊头市",
				zipcode : "062150"
			},
			130982 : {
				name : "任丘市",
				zipcode : "062550"
			},
			130983 : {
				name : "黄骅市",
				zipcode : "061100"
			},
			130984 : {
				name : "河间市",
				zipcode : "062450"
			}
		},
		131000 : {
			131002 : {
				name : "安次区",
				zipcode : "065000"
			},
			131003 : {
				name : "广阳区",
				zipcode : "065000"
			},
			131022 : {
				name : "固安县",
				zipcode : "065500"
			},
			131023 : {
				name : "永清县",
				zipcode : "065600"
			},
			131024 : {
				name : "香河县",
				zipcode : "065400"
			},
			131025 : {
				name : "大城县",
				zipcode : "065900"
			},
			131026 : {
				name : "文安县",
				zipcode : "065800"
			},
			131028 : {
				name : "大厂回族自治县",
				zipcode : "065300"
			},
			131081 : {
				name : "霸州市",
				zipcode : "065700"
			},
			131082 : {
				name : "三河市",
				zipcode : "065200"
			}
		},
		131100 : {
			131102 : {
				name : "桃城区",
				zipcode : "053000"
			},
			131121 : {
				name : "枣强县",
				zipcode : "053100"
			},
			131122 : {
				name : "武邑县",
				zipcode : "053400"
			},
			131123 : {
				name : "武强县",
				zipcode : "053300"
			},
			131124 : {
				name : "饶阳县",
				zipcode : "053900"
			},
			131125 : {
				name : "安平县",
				zipcode : "053600"
			},
			131126 : {
				name : "故城县",
				zipcode : "253800"
			},
			131127 : {
				name : "景县",
				zipcode : "053500"
			},
			131128 : {
				name : "阜城县",
				zipcode : "053700"
			},
			131181 : {
				name : "冀州市",
				zipcode : "053200"
			},
			131182 : {
				name : "深州市",
				zipcode : "053800"
			}
		},
		140000 : {
			140100 : '太原市',
			140200 : '大同市',
			140300 : '阳泉市',
			140400 : '长治市',
			140500 : '晋城市',
			140600 : '朔州市',
			140700 : '晋中市',
			140800 : '运城市',
			140900 : '忻州市',
			141000 : '临汾市',
			141100 : '吕梁市'
		},
		140100 : {
			140105 : {
				name : "小店区",
				zipcode : "030032"
			},
			140106 : {
				name : "迎泽区",
				zipcode : "030024"
			},
			140107 : {
				name : "杏花岭区",
				zipcode : "030001"
			},
			140108 : {
				name : "尖草坪区",
				zipcode : "030003"
			},
			140109 : {
				name : "万柏林区",
				zipcode : "030027"
			},
			140110 : {
				name : "晋源区",
				zipcode : "030025"
			},
			140121 : {
				name : "清徐县",
				zipcode : "030400"
			},
			140122 : {
				name : "阳曲县",
				zipcode : "030100"
			},
			140123 : {
				name : "娄烦县",
				zipcode : "030300"
			},
			140181 : {
				name : "古交市",
				zipcode : "030200"
			}
		},
		140200 : {
			140202 : {
				name : "城区",
				zipcode : "037008"
			},
			140203 : {
				name : "矿区",
				zipcode : "037001"
			},
			140211 : {
				name : "南郊区",
				zipcode : "037001"
			},
			140212 : {
				name : "新荣区",
				zipcode : "037002"
			},
			140221 : {
				name : "阳高县",
				zipcode : "038100"
			},
			140222 : {
				name : "天镇县",
				zipcode : "038200"
			},
			140223 : {
				name : "广灵县",
				zipcode : "037500"
			},
			140224 : {
				name : "灵丘县",
				zipcode : "034400"
			},
			140225 : {
				name : "浑源县",
				zipcode : "037400"
			},
			140226 : {
				name : "左云县",
				zipcode : "037100"
			},
			140227 : {
				name : "大同县",
				zipcode : "037300"
			}
		},
		140300 : {
			140302 : {
				name : "城区",
				zipcode : "045000"
			},
			140303 : {
				name : "矿区",
				zipcode : "045000"
			},
			140311 : {
				name : "郊区",
				zipcode : "045011"
			},
			140321 : {
				name : "平定县",
				zipcode : "045200"
			},
			140322 : {
				name : "盂县",
				zipcode : "045100"
			}
		},
		140400 : {
			140402 : {
				name : "城区",
				zipcode : "046011"
			},
			140411 : {
				name : "郊区",
				zipcode : "046011"
			},
			140421 : {
				name : "长治县",
				zipcode : "047100"
			},
			140423 : {
				name : "襄垣县",
				zipcode : "046200"
			},
			140424 : {
				name : "屯留县",
				zipcode : "046100"
			},
			140425 : {
				name : "平顺县",
				zipcode : "047400"
			},
			140426 : {
				name : "黎城县",
				zipcode : "047600"
			},
			140427 : {
				name : "壶关县",
				zipcode : "047300"
			},
			140428 : {
				name : "长子县",
				zipcode : "046600"
			},
			140429 : {
				name : "武乡县",
				zipcode : "046300"
			},
			140430 : {
				name : "沁县",
				zipcode : "046400"
			},
			140431 : {
				name : "沁源县",
				zipcode : "046500"
			},
			140481 : {
				name : "潞城市",
				zipcode : "047500"
			}
		},
		140500 : {
			140502 : {
				name : "城区",
				zipcode : "048000"
			},
			140521 : {
				name : "沁水县",
				zipcode : "048200"
			},
			140522 : {
				name : "阳城县",
				zipcode : "048100"
			},
			140524 : {
				name : "陵川县",
				zipcode : "048300"
			},
			140525 : {
				name : "泽州县",
				zipcode : "048012"
			},
			140581 : {
				name : "高平市",
				zipcode : "048400"
			}
		},
		140600 : {
			140602 : {
				name : "朔城区",
				zipcode : "038500"
			},
			140603 : {
				name : "平鲁区",
				zipcode : "038600"
			},
			140621 : {
				name : "山阴县",
				zipcode : "036900"
			},
			140622 : {
				name : "应县",
				zipcode : "037600"
			},
			140623 : {
				name : "右玉县",
				zipcode : "037200"
			},
			140624 : {
				name : "怀仁县",
				zipcode : "038300"
			}
		},
		140700 : {
			140702 : {
				name : "榆次区",
				zipcode : "030600"
			},
			140721 : {
				name : "榆社县",
				zipcode : "031800"
			},
			140722 : {
				name : "左权县",
				zipcode : "032600"
			},
			140723 : {
				name : "和顺县",
				zipcode : "032700"
			},
			140724 : {
				name : "昔阳县",
				zipcode : "045300"
			},
			140725 : {
				name : "寿阳县",
				zipcode : "045400"
			},
			140726 : {
				name : "太谷县",
				zipcode : "030800"
			},
			140727 : {
				name : "祁县",
				zipcode : "030900"
			},
			140728 : {
				name : "平遥县",
				zipcode : "031100"
			},
			140729 : {
				name : "灵石县",
				zipcode : "031300"
			},
			140781 : {
				name : "介休市",
				zipcode : "031200"
			}
		},
		140800 : {
			140802 : {
				name : "盐湖区",
				zipcode : "044000"
			},
			140821 : {
				name : "临猗县",
				zipcode : "044100"
			},
			140822 : {
				name : "万荣县",
				zipcode : "044200"
			},
			140823 : {
				name : "闻喜县",
				zipcode : "043800"
			},
			140824 : {
				name : "稷山县",
				zipcode : "043200"
			},
			140825 : {
				name : "新绛县",
				zipcode : "043100"
			},
			140826 : {
				name : "绛县",
				zipcode : "043600"
			},
			140827 : {
				name : "垣曲县",
				zipcode : "043700"
			},
			140828 : {
				name : "夏县",
				zipcode : "044400"
			},
			140829 : {
				name : "平陆县",
				zipcode : "044300"
			},
			140830 : {
				name : "芮城县",
				zipcode : "044600"
			},
			140881 : {
				name : "永济市",
				zipcode : "044500"
			},
			140882 : {
				name : "河津市",
				zipcode : "043300"
			}
		},
		140900 : {
			140902 : {
				name : "忻府区",
				zipcode : "034000"
			},
			140921 : {
				name : "定襄县",
				zipcode : "035400"
			},
			140922 : {
				name : "五台县",
				zipcode : "035500"
			},
			140923 : {
				name : "代县",
				zipcode : "034200"
			},
			140924 : {
				name : "繁峙县",
				zipcode : "034300"
			},
			140925 : {
				name : "宁武县",
				zipcode : "036700"
			},
			140926 : {
				name : "静乐县",
				zipcode : "035100"
			},
			140927 : {
				name : "神池县",
				zipcode : "036100"
			},
			140928 : {
				name : "五寨县",
				zipcode : "036200"
			},
			140929 : {
				name : "岢岚县",
				zipcode : "036300"
			},
			140930 : {
				name : "河曲县",
				zipcode : "036500"
			},
			140931 : {
				name : "保德县",
				zipcode : "036600"
			},
			140932 : {
				name : "偏关县",
				zipcode : "036400"
			},
			140981 : {
				name : "原平市",
				zipcode : "034100"
			}
		},
		141000 : {
			141002 : {
				name : "尧都区",
				zipcode : "041000"
			},
			141021 : {
				name : "曲沃县",
				zipcode : "043400"
			},
			141022 : {
				name : "翼城县",
				zipcode : "043500"
			},
			141023 : {
				name : "襄汾县",
				zipcode : "041500"
			},
			141024 : {
				name : "洪洞县",
				zipcode : "031600"
			},
			141025 : {
				name : "古县",
				zipcode : "042400"
			},
			141026 : {
				name : "安泽县",
				zipcode : "042500"
			},
			141027 : {
				name : "浮山县",
				zipcode : "042600"
			},
			141028 : {
				name : "吉县",
				zipcode : "042200"
			},
			141029 : {
				name : "乡宁县",
				zipcode : "042100"
			},
			141030 : {
				name : "大宁县",
				zipcode : "042300"
			},
			141031 : {
				name : "隰县",
				zipcode : "041300"
			},
			141032 : {
				name : "永和县",
				zipcode : "041400"
			},
			141033 : {
				name : "蒲县",
				zipcode : "041200"
			},
			141034 : {
				name : "汾西县",
				zipcode : "031500"
			},
			141081 : {
				name : "侯马市",
				zipcode : "043007"
			},
			141082 : {
				name : "霍州市",
				zipcode : "031400"
			}
		},
		141100 : {
			141102 : {
				name : "离石区",
				zipcode : "033000"
			},
			141121 : {
				name : "文水县",
				zipcode : "032100"
			},
			141122 : {
				name : "交城县",
				zipcode : "030500"
			},
			141123 : {
				name : "兴县",
				zipcode : "033600"
			},
			141124 : {
				name : "临县",
				zipcode : "033200"
			},
			141125 : {
				name : "柳林县",
				zipcode : "033300"
			},
			141126 : {
				name : "石楼县",
				zipcode : "032500"
			},
			141127 : {
				name : "岚县",
				zipcode : "033500"
			},
			141128 : {
				name : "方山县",
				zipcode : "033100"
			},
			141129 : {
				name : "中阳县",
				zipcode : "033400"
			},
			141130 : {
				name : "交口县",
				zipcode : "032400"
			},
			141181 : {
				name : "孝义市",
				zipcode : "032300"
			},
			141182 : {
				name : "汾阳市",
				zipcode : "032200"
			}
		},
		150000 : {
			150100 : '呼和浩特市',
			150200 : '包头市',
			150300 : '乌海市',
			150400 : '赤峰市',
			150500 : '通辽市',
			150600 : '鄂尔多斯市',
			150700 : '呼伦贝尔市',
			150800 : '巴彦淖尔市',
			150900 : '乌兰察布市',
			152200 : '兴安盟',
			152500 : '锡林郭勒盟',
			152900 : '阿拉善盟'
		},
		150100 : {
			150102 : {
				name : "新城区",
				zipcode : "010030"
			},
			150103 : {
				name : "回民区",
				zipcode : "010030"
			},
			150104 : {
				name : "玉泉区",
				zipcode : "010020"
			},
			150105 : {
				name : "赛罕区",
				zipcode : "010020"
			},
			150121 : {
				name : "土默特左旗",
				zipcode : "010100"
			},
			150122 : {
				name : "托克托县",
				zipcode : "010200"
			},
			150123 : {
				name : "和林格尔县",
				zipcode : "011500"
			},
			150124 : {
				name : "清水河县",
				zipcode : "011600"
			},
			150125 : {
				name : "武川县",
				zipcode : "011700"
			}
		},
		150200 : {
			150202 : {
				name : "东河区",
				zipcode : "014040"
			},
			150203 : {
				name : "昆都仑区",
				zipcode : "014010"
			},
			150204 : {
				name : "青山区",
				zipcode : "014030"
			},
			150205 : {
				name : "石拐区",
				zipcode : "014070"
			},
			150206 : '白云鄂博矿区',
			150207 : {
				name : "九原区",
				zipcode : "014060"
			},
			150221 : {
				name : "土默特右旗",
				zipcode : "014100"
			},
			150222 : {
				name : "固阳县",
				zipcode : "014200"
			},
			150223 : {
				name : "达尔罕茂明安联合旗",
				zipcode : "014500"
			}
		},
		150300 : {
			150302 : {
				name : "海勃湾区",
				zipcode : "016000"
			},
			150303 : {
				name : "海南区",
				zipcode : "016030"
			},
			150304 : {
				name : "乌达区",
				zipcode : "016040"
			}
		},
		150400 : {
			150402 : {
				name : "红山区",
				zipcode : "024020"
			},
			150403 : {
				name : "元宝山区",
				zipcode : "024076"
			},
			150404 : {
				name : "松山区",
				zipcode : "024005"
			},
			150421 : {
				name : "阿鲁科尔沁旗",
				zipcode : "025550"
			},
			150422 : {
				name : "巴林左旗",
				zipcode : "025450"
			},
			150423 : {
				name : "巴林右旗",
				zipcode : "025150"
			},
			150424 : {
				name : "林西县",
				zipcode : "025250"
			},
			150425 : {
				name : "克什克腾旗",
				zipcode : "025350"
			},
			150426 : {
				name : "翁牛特旗",
				zipcode : "024500"
			},
			150428 : {
				name : "喀喇沁旗",
				zipcode : "024400"
			},
			150429 : {
				name : "宁城县",
				zipcode : "024200"
			},
			150430 : {
				name : "敖汉旗",
				zipcode : "024300"
			}
		},
		150500 : {
			150502 : {
				name : "科尔沁区",
				zipcode : "028000"
			},
			150521 : {
				name : "科尔沁左翼中旗",
				zipcode : "029300"
			},
			150522 : {
				name : "科尔沁左翼后旗",
				zipcode : "028100"
			},
			150523 : {
				name : "开鲁县",
				zipcode : "028400"
			},
			150524 : {
				name : "库伦旗",
				zipcode : "028200"
			},
			150525 : {
				name : "奈曼旗",
				zipcode : "028300"
			},
			150526 : {
				name : "扎鲁特旗",
				zipcode : "029100"
			},
			150581 : {
				name : "霍林郭勒市",
				zipcode : "029200"
			}
		},
		150600 : {
			150602 : {
				name : "东胜区",
				zipcode : "017000"
			},
			150621 : {
				name : "达拉特旗",
				zipcode : "014300"
			},
			150622 : {
				name : "准格尔旗",
				zipcode : "017100"
			},
			150623 : {
				name : "鄂托克前旗",
				zipcode : "016200"
			},
			150624 : {
				name : "鄂托克旗",
				zipcode : "016100"
			},
			150625 : {
				name : "杭锦旗",
				zipcode : "017400"
			},
			150626 : {
				name : "乌审旗",
				zipcode : "017300"
			},
			150627 : {
				name : "伊金霍洛旗",
				zipcode : "017200"
			}
		},
		150700 : {
			150702 : {
				name : "海拉尔区",
				zipcode : "021000"
			},
			150703 : '扎赉诺尔区',
			150721 : {
				name : "阿荣旗",
				zipcode : "162750"
			},
			150722 : {
				name : "莫力达瓦达斡尔族自治旗",
				zipcode : "162850"
			},
			150723 : {
				name : "鄂伦春自治旗",
				zipcode : "165450"
			},
			150724 : {
				name : "鄂温克族自治旗",
				zipcode : "021100"
			},
			150725 : {
				name : "陈巴尔虎旗",
				zipcode : "021500"
			},
			150726 : {
				name : "新巴尔虎左旗",
				zipcode : "021200"
			},
			150727 : {
				name : "新巴尔虎右旗",
				zipcode : "021300"
			},
			150781 : {
				name : "满洲里市",
				zipcode : "021400"
			},
			150782 : {
				name : "牙克石市",
				zipcode : "022150"
			},
			150783 : {
				name : "扎兰屯市",
				zipcode : "162650"
			},
			150784 : {
				name : "额尔古纳市",
				zipcode : "022250"
			},
			150785 : {
				name : "根河市",
				zipcode : "022350"
			}
		},
		150800 : {
			150802 : {
				name : "临河区",
				zipcode : "015001"
			},
			150821 : {
				name : "五原县",
				zipcode : "015100"
			},
			150822 : {
				name : "磴口县",
				zipcode : "015200"
			},
			150823 : {
				name : "乌拉特前旗",
				zipcode : "014400"
			},
			150824 : {
				name : "乌拉特中旗",
				zipcode : "015300"
			},
			150825 : {
				name : "乌拉特后旗",
				zipcode : "015500"
			},
			150826 : {
				name : "杭锦后旗",
				zipcode : "015400"
			}
		},
		150900 : {
			150902 : {
				name : "集宁区",
				zipcode : "012000"
			},
			150921 : {
				name : "卓资县",
				zipcode : "012300"
			},
			150922 : {
				name : "化德县",
				zipcode : "013350"
			},
			150923 : {
				name : "商都县",
				zipcode : "013450"
			},
			150924 : {
				name : "兴和县",
				zipcode : "013650"
			},
			150925 : {
				name : "凉城县",
				zipcode : "013750"
			},
			150926 : {
				name : "察哈尔右翼前旗",
				zipcode : "012200"
			},
			150927 : {
				name : "察哈尔右翼中旗",
				zipcode : "013550"
			},
			150928 : {
				name : "察哈尔右翼后旗",
				zipcode : "012400"
			},
			150929 : {
				name : "四子王旗",
				zipcode : "011800"
			},
			150981 : {
				name : "丰镇市",
				zipcode : "012100"
			}
		},
		152200 : {
			152201 : {
				name : "乌兰浩特市",
				zipcode : "137401"
			},
			152202 : {
				name : "阿尔山市",
				zipcode : "137800"
			},
			152221 : {
				name : "科尔沁右翼前旗",
				zipcode : "137423"
			},
			152222 : {
				name : "科尔沁右翼中旗",
				zipcode : "029400"
			},
			152223 : {
				name : "扎赉特旗",
				zipcode : "137600"
			},
			152224 : {
				name : "突泉县",
				zipcode : "137500"
			}
		},
		152500 : {
			152501 : {
				name : "二连浩特市",
				zipcode : "011100"
			},
			152502 : {
				name : "锡林浩特市",
				zipcode : "026000"
			},
			152522 : {
				name : "阿巴嘎旗",
				zipcode : "011400"
			},
			152523 : {
				name : "苏尼特左旗",
				zipcode : "011300"
			},
			152524 : {
				name : "苏尼特右旗",
				zipcode : "011200"
			},
			152525 : {
				name : "东乌珠穆沁旗",
				zipcode : "026300"
			},
			152526 : {
				name : "西乌珠穆沁旗",
				zipcode : "026200"
			},
			152527 : {
				name : "太仆寺旗",
				zipcode : "027000"
			},
			152528 : {
				name : "镶黄旗",
				zipcode : "013250"
			},
			152529 : {
				name : "正镶白旗",
				zipcode : "013800"
			},
			152530 : {
				name : "正蓝旗",
				zipcode : "027200"
			},
			152531 : {
				name : "多伦县",
				zipcode : "027300"
			}
		},
		152900 : {
			152921 : {
				name : "阿拉善左旗",
				zipcode : "750306"
			},
			152922 : {
				name : "阿拉善右旗",
				zipcode : "737300"
			},
			152923 : {
				name : "额济纳旗",
				zipcode : "735400"
			}
		},
		210000 : {
			210100 : '沈阳市',
			210200 : '大连市',
			210300 : '鞍山市',
			210400 : '抚顺市',
			210500 : '本溪市',
			210600 : '丹东市',
			210700 : '锦州市',
			210800 : '营口市',
			210900 : '阜新市',
			211000 : '辽阳市',
			211100 : '盘锦市',
			211200 : '铁岭市',
			211300 : '朝阳市',
			211400 : '葫芦岛市'
		},
		210100 : {
			210102 : {
				name : "和平区",
				zipcode : "110001"
			},
			210103 : {
				name : "沈河区",
				zipcode : "110013"
			},
			210104 : {
				name : "大东区",
				zipcode : "110041"
			},
			210105 : {
				name : "皇姑区",
				zipcode : "110031"
			},
			210106 : {
				name : "铁西区",
				zipcode : "110021"
			},
			210111 : {
				name : "苏家屯区",
				zipcode : "110101"
			},
			210112 :{
				name : "浑南区",
				zipcode : "110000"
			},
			210113 : {
				name : "沈北新区",
				zipcode : "110121"
			},
			210114 : {
				name : "于洪区",
				zipcode : "110141"
			},
			210122 : {
				name : "辽中县",
				zipcode : "110200"
			},
			210123 : {
				name : "康平县",
				zipcode : "110500"
			},
			210124 : {
				name : "法库县",
				zipcode : "110400"
			},
			210181 : {
				name : "新民市",
				zipcode : "110300"
			}
		},
		210200 : {
			210202 : {
				name : "中山区",
				zipcode : "116001"
			},
			210203 : {
				name : "西岗区",
				zipcode : "116011"
			},
			210204 : {
				name : "沙河口区",
				zipcode : "116021"
			},
			210211 : {
				name : "甘井子区",
				zipcode : "116033"
			},
			210212 : {
				name : "旅顺口区",
				zipcode : "116041"
			},
			210213 : {
				name : "金州区",
				zipcode : "116100"
			},
			210224 : {
				name : "长海县",
				zipcode : "116500"
			},
			210281 : {
				name : "瓦房店市",
				zipcode : "116300"
			},
			210282 : {
				name : "普兰店市",
				zipcode : "116200"
			},
			210283 : {
				name : "庄河市",
				zipcode : "116400"
			}
		},
		210300 : {
			210302 : {
				name : "铁东区",
				zipcode : "114001"
			},
			210303 : {
				name : "铁西区",
				zipcode : "114013"
			},
			210304 : {
				name : "立山区",
				zipcode : "114031"
			},
			210311 : {
				name : "千山区",
				zipcode : "114041"
			},
			210321 : {
				name : "台安县",
				zipcode : "114100"
			},
			210323 : {
				name : "岫岩满族自治县",
				zipcode : "114300"
			},
			210381 : {
				name : "海城市",
				zipcode : "114200"
			}
		},
		210400 : {
			210402 : {
				name : "新抚区",
				zipcode : "113008"
			},
			210403 : {
				name : "东洲区",
				zipcode : "113003"
			},
			210404 : {
				name : "望花区",
				zipcode : "113001"
			},
			210411 : {
				name : "顺城区",
				zipcode : "113006"
			},
			210421 : {
				name : "抚顺县",
				zipcode : "113006"
			},
			210422 : {
				name : "新宾满族自治县",
				zipcode : "113200"
			},
			210423 : {
				name : "清原满族自治县",
				zipcode : "113300"
			}
		},
		210500 : {
			210502 : {
				name : "平山区",
				zipcode : "117000"
			},
			210503 : {
				name : "溪湖区",
				zipcode : "117002"
			},
			210504 : {
				name : "明山区",
				zipcode : "117021"
			},
			210505 : {
				name : "南芬区",
				zipcode : "117014"
			},
			210521 : {
				name : "本溪满族自治县",
				zipcode : "117100"
			},
			210522 : {
				name : "桓仁满族自治县",
				zipcode : "117200"
			}
		},
		210600 : {
			210602 : {
				name : "元宝区",
				zipcode : "118000"
			},
			210603 : {
				name : "振兴区",
				zipcode : "118002"
			},
			210604 : {
				name : "振安区",
				zipcode : "118001"
			},
			210624 : {
				name : "宽甸满族自治县",
				zipcode : "118200"
			},
			210681 : {
				name : "东港市",
				zipcode : "118300"
			},
			210682 : {
				name : "凤城市",
				zipcode : "118100"
			}
		},
		210700 : {
			210702 : {
				name : "古塔区",
				zipcode : "121001"
			},
			210703 : {
				name : "凌河区",
				zipcode : "121000"
			},
			210711 : {
				name : "太和区",
				zipcode : "121011"
			},
			210726 : {
				name : "黑山县",
				zipcode : "121400"
			},
			210727 : {
				name : "义县",
				zipcode : "121100"
			},
			210781 : {
				name : "凌海市",
				zipcode : "121200"
			},
			210782 : '北镇市'
		},
		210800 : {
			210802 : {
				name : "站前区",
				zipcode : "115002"
			},
			210803 : {
				name : "西市区",
				zipcode : "115004"
			},
			210804 : {
				name : "鲅鱼圈区",
				zipcode : "115007"
			},
			210811 : {
				name : "老边区",
				zipcode : "115005"
			},
			210881 : {
				name : "盖州市",
				zipcode : "115200"
			},
			210882 : {
				name : "大石桥市",
				zipcode : "115100"
			}
		},
		210900 : {
			210902 : {
				name : "海州区",
				zipcode : "123000"
			},
			210903 : {
				name : "新邱区",
				zipcode : "123005"
			},
			210904 : {
				name : "太平区",
				zipcode : "123003"
			},
			210905 : {
				name : "清河门区",
				zipcode : "123006"
			},
			210911 : {
				name : "细河区",
				zipcode : "123000"
			},
			210921 : {
				name : "阜新蒙古族自治县",
				zipcode : "123100"
			},
			210922 : {
				name : "彰武县",
				zipcode : "123200"
			}
		},
		211000 : {
			211002 : {
				name : "白塔区",
				zipcode : "111000"
			},
			211003 : {
				name : "文圣区",
				zipcode : "111000"
			},
			211004 : {
				name : "宏伟区",
				zipcode : "111003"
			},
			211005 : {
				name : "弓长岭区",
				zipcode : "111008"
			},
			211011 : {
				name : "太子河区",
				zipcode : "111000"
			},
			211021 : {
				name : "辽阳县",
				zipcode : "111200"
			},
			211081 : {
				name : "灯塔市",
				zipcode : "111300"
			}
		},
		211100 : {
			211102 : {
				name : "双台子区",
				zipcode : "124000"
			},
			211103 : {
				name : "兴隆台区",
				zipcode : "124010"
			},
			211121 : {
				name : "大洼县",
				zipcode : "124200"
			},
			211122 : {
				name : "盘山县",
				zipcode : "124000"
			}
		},
		211200 : {
			211202 : {
				name : "银州区",
				zipcode : "112000"
			},
			211204 : {
				name : "清河区",
				zipcode : "112003"
			},
			211221 : {
				name : "铁岭县",
				zipcode : "112000"
			},
			211223 : {
				name : "西丰县",
				zipcode : "112400"
			},
			211224 : {
				name : "昌图县",
				zipcode : "112500"
			},
			211281 : {
				name : "调兵山市",
				zipcode : "112700"
			},
			211282 : {
				name : "开原市",
				zipcode : "112300"
			}
		},
		211300 : {
			211302 : {
				name : "双塔区",
				zipcode : "122000"
			},
			211303 : {
				name : "龙城区",
				zipcode : "122000"
			},
			211321 : {
				name : "朝阳县",
				zipcode : "122000"
			},
			211322 : {
				name : "建平县",
				zipcode : "122400"
			},
			211324 : {
				name : "喀喇沁左翼蒙古族自治县",
				zipcode : "122300"
			},
			211381 : {
				name : "北票市",
				zipcode : "122100"
			},
			211382 : {
				name : "凌源市",
				zipcode : "122500"
			}
		},
		211400 : {
			211402 : {
				name : "连山区",
				zipcode : "125001"
			},
			211403 : {
				name : "龙港区",
				zipcode : "125003"
			},
			211404 : {
				name : "南票区",
				zipcode : "125027"
			},
			211421 : {
				name : "绥中县",
				zipcode : "125200"
			},
			211422 : {
				name : "建昌县",
				zipcode : "125300"
			},
			211481 : {
				name : "兴城市",
				zipcode : "125100"
			}
		},
		220000 : {
			220100 : '长春市',
			220200 : '吉林市',
			220300 : '四平市',
			220400 : '辽源市',
			220500 : '通化市',
			220600 : '白山市',
			220700 : '松原市',
			220800 : '白城市',
			222400 : '延边朝鲜族自治州'
		},
		220100 : {
			220102 : {
				name : "南关区",
				zipcode : "130022"
			},
			220103 : {
				name : "宽城区",
				zipcode : "130051"
			},
			220104 : {
				name : "朝阳区",
				zipcode : "130012"
			},
			220105 : {
				name : "二道区",
				zipcode : "130031"
			},
			220106 : {
				name : "绿园区",
				zipcode : "130062"
			},
			220112 : {
				name : "双阳区",
				zipcode : "130600"
			},
			220113 : '九台区',
			220122 : {
				name : "农安县",
				zipcode : "130200"
			},
			220182 : {
				name : "榆树市",
				zipcode : "130400"
			},
			220183 : {
				name : "德惠市",
				zipcode : "130300"
			}
		},
		220200 : {
			220202 : {
				name : "昌邑区",
				zipcode : "132002"
			},
			220203 : {
				name : "龙潭区",
				zipcode : "132021"
			},
			220204 : {
				name : "船营区",
				zipcode : "132011"
			},
			220211 : {
				name : "丰满区",
				zipcode : "132013"
			},
			220221 : {
				name : "永吉县",
				zipcode : "132200"
			},
			220281 : {
				name : "蛟河市",
				zipcode : "132500"
			},
			220282 : {
				name : "桦甸市",
				zipcode : "132400"
			},
			220283 : {
				name : "舒兰市",
				zipcode : "132600"
			},
			220284 : {
				name : "磐石市",
				zipcode : "132300"
			}
		},
		220300 : {
			220302 : {
				name : "铁西区",
				zipcode : "136000"
			},
			220303 : {
				name : "铁东区",
				zipcode : "136001"
			},
			220322 : {
				name : "梨树县",
				zipcode : "136500"
			},
			220323 : {
				name : "伊通满族自治县",
				zipcode : "130700"
			},
			220381 : {
				name : "公主岭市",
				zipcode : "136100"
			},
			220382 : {
				name : "双辽市",
				zipcode : "136400"
			}
		},
		220400 : {
			220402 : {
				name : "龙山区",
				zipcode : "136200"
			},
			220403 : {
				name : "西安区",
				zipcode : "136201"
			},
			220421 : {
				name : "东丰县",
				zipcode : "136300"
			},
			220422 : {
				name : "东辽县",
				zipcode : "136600"
			}
		},
		220500 : {
			220502 : {
				name : "东昌区",
				zipcode : "134001"
			},
			220503 : {
				name : "二道江区",
				zipcode : "134003"
			},
			220521 : {
				name : "通化县",
				zipcode : "134100"
			},
			220523 : {
				name : "辉南县",
				zipcode : "135100"
			},
			220524 : {
				name : "柳河县",
				zipcode : "135300"
			},
			220581 : {
				name : "梅河口市",
				zipcode : "135000"
			},
			220582 : {
				name : "集安市",
				zipcode : "134200"
			}
		},
		220600 : {
			220602 : '浑江区',
			220605 : '江源区',
			220621 : {
				name : "抚松县",
				zipcode : "134500"
			},
			220622 : {
				name : "靖宇县",
				zipcode : "135200"
			},
			220623 : {
				name : "长白朝鲜族自治县",
				zipcode : "134400"
			},
			220681 : {
				name : "临江市",
				zipcode : "134600"
			}
		},
		220700 : {
			220702 : {
				name : "宁江区",
				zipcode : "138000"
			},
			220721 : {
				name : "前郭尔罗斯蒙古族自治县",
				zipcode : "138000"
			},
			220722 : {
				name : "长岭县",
				zipcode : "131500"
			},
			220723 : {
				name : "乾安县",
				zipcode : "131400"
			},
			220781 : '扶余市'
		},
		220800 : {
			220802 : {
				name : "洮北区",
				zipcode : "137000"
			},
			220821 : {
				name : "镇赉县",
				zipcode : "137300"
			},
			220822 : {
				name : "通榆县",
				zipcode : "137200"
			},
			220881 : {
				name : "洮南市",
				zipcode : "137100"
			},
			220882 : {
				name : "大安市",
				zipcode : "131300"
			}
		},
		222400 : {
			222401 : {
				name : "延吉市",
				zipcode : "133000"
			},
			222402 : {
				name : "图们市",
				zipcode : "133100"
			},
			222403 : {
				name : "敦化市",
				zipcode : "133700"
			},
			222404 : {
				name : "珲春市",
				zipcode : "133300"
			},
			222405 : {
				name : "龙井市",
				zipcode : "133400"
			},
			222406 : {
				name : "和龙市",
				zipcode : "133500"
			},
			222424 : {
				name : "汪清县",
				zipcode : "133200"
			},
			222426 : {
				name : "安图县",
				zipcode : "133600"
			}
		},
		230000 : {
			230100 : '哈尔滨市',
			230200 : '齐齐哈尔市',
			230300 : '鸡西市',
			230400 : '鹤岗市',
			230500 : '双鸭山市',
			230600 : '大庆市',
			230700 : '伊春市',
			230800 : '佳木斯市',
			230900 : '七台河市',
			231000 : '牡丹江市',
			231100 : '黑河市',
			231200 : '绥化市',
			232700 : '大兴安岭地区'
		},
		230100 : {
			230102 : {
				name : "道里区",
				zipcode : "150010"
			},
			230103 : {
				name : "南岗区",
				zipcode : "150006"
			},
			230104 : {
				name : "道外区",
				zipcode : "150020"
			},
			230108 : {
				name : "平房区",
				zipcode : "150060"
			},
			230109 : {
				name : "松北区",
				zipcode : "150028"
			},
			230110 : {
				name : "香坊区",
				zipcode : "150036"
			},
			230111 : {
				name : "呼兰区",
				zipcode : "150500"
			},
			230112 : {
				name : "阿城区",
				zipcode : "150300"
			},
			230113 : '双城区',
			230123 : {
				name : "依兰县",
				zipcode : "154800"
			},
			230124 : {
				name : "方正县",
				zipcode : "150800"
			},
			230125 : {
				name : "宾县",
				zipcode : "150400"
			},
			230126 : {
				name : "巴彦县",
				zipcode : "151800"
			},
			230127 : {
				name : "木兰县",
				zipcode : "151900"
			},
			230128 : {
				name : "通河县",
				zipcode : "150900"
			},
			230129 : {
				name : "延寿县",
				zipcode : "150700"
			},
			230183 : {
				name : "尚志市",
				zipcode : "150600"
			},
			230184 : {
				name : "五常市",
				zipcode : "150200"
			}
		},
		230200 : {
			230202 : {
				name : "龙沙区",
				zipcode : "161000"
			},
			230203 : {
				name : "建华区",
				zipcode : "161006"
			},
			230204 : {
				name : "铁锋区",
				zipcode : "161000"
			},
			230205 : {
				name : "昂昂溪区",
				zipcode : "161031"
			},
			230206 : {
				name : "富拉尔基区",
				zipcode : "161041"
			},
			230207 : {
				name : "碾子山区",
				zipcode : "161046"
			},
			230208 : {
				name : "梅里斯达斡尔族区",
				zipcode : "161021"
			},
			230221 : {
				name : "龙江县",
				zipcode : "161100"
			},
			230223 : {
				name : "依安县",
				zipcode : "161500"
			},
			230224 : {
				name : "泰来县",
				zipcode : "162400"
			},
			230225 : {
				name : "甘南县",
				zipcode : "162100"
			},
			230227 : {
				name : "富裕县",
				zipcode : "161200"
			},
			230229 : {
				name : "克山县",
				zipcode : "161600"
			},
			230230 : {
				name : "克东县",
				zipcode : "164800"
			},
			230231 : {
				name : "拜泉县",
				zipcode : "164700"
			},
			230281 : {
				name : "讷河市",
				zipcode : "161300"
			}
		},
		230300 : {
			230302 : {
				name : "鸡冠区",
				zipcode : "158100"
			},
			230303 : {
				name : "恒山区",
				zipcode : "158130"
			},
			230304 : {
				name : "滴道区",
				zipcode : "158150"
			},
			230305 : {
				name : "梨树区",
				zipcode : "158160"
			},
			230306 : {
				name : "城子河区",
				zipcode : "158170"
			},
			230307 : {
				name : "麻山区",
				zipcode : "158180"
			},
			230321 : {
				name : "鸡东县",
				zipcode : "158200"
			},
			230381 : {
				name : "虎林市",
				zipcode : "158400"
			},
			230382 : {
				name : "密山市",
				zipcode : "158300"
			}
		},
		230400 : {
			230402 : {
				name : "向阳区",
				zipcode : "154100"
			},
			230403 : {
				name : "工农区",
				zipcode : "154101"
			},
			230404 : {
				name : "南山区",
				zipcode : "154104"
			},
			230405 : {
				name : "兴安区",
				zipcode : "154102"
			},
			230406 : {
				name : "东山区",
				zipcode : "154106"
			},
			230407 : {
				name : "兴山区",
				zipcode : "154105"
			},
			230421 : {
				name : "萝北县",
				zipcode : "154200"
			},
			230422 : {
				name : "绥滨县",
				zipcode : "156200"
			}
		},
		230500 : {
			230502 : {
				name : "尖山区",
				zipcode : "155100"
			},
			230503 : {
				name : "岭东区",
				zipcode : "155120"
			},
			230505 : {
				name : "四方台区",
				zipcode : "155130"
			},
			230506 : {
				name : "宝山区",
				zipcode : "155131"
			},
			230521 : {
				name : "集贤县",
				zipcode : "155900"
			},
			230522 : {
				name : "友谊县",
				zipcode : "155800"
			},
			230523 : {
				name : "宝清县",
				zipcode : "155600"
			},
			230524 : {
				name : "饶河县",
				zipcode : "155700"
			}
		},
		230600 : {
			230602 : {
				name : "萨尔图区",
				zipcode : "163001"
			},
			230603 : {
				name : "龙凤区",
				zipcode : "163711"
			},
			230604 : {
				name : "让胡路区",
				zipcode : "163712"
			},
			230605 : {
				name : "红岗区",
				zipcode : "163511"
			},
			230606 : {
				name : "大同区",
				zipcode : "163515"
			},
			230621 : {
				name : "肇州县",
				zipcode : "166400"
			},
			230622 : {
				name : "肇源县",
				zipcode : "166500"
			},
			230623 : {
				name : "林甸县",
				zipcode : "166300"
			},
			230624 : {
				name : "杜尔伯特蒙古族自治县",
				zipcode : "166200"
			}
		},
		230700 : {
			230702 : {
				name : "伊春区",
				zipcode : "153000"
			},
			230703 : {
				name : "南岔区",
				zipcode : "153100"
			},
			230704 : {
				name : "友好区",
				zipcode : "153031"
			},
			230705 : {
				name : "西林区",
				zipcode : "153025"
			},
			230706 : {
				name : "翠峦区",
				zipcode : "153013"
			},
			230707 : {
				name : "新青区",
				zipcode : "153036"
			},
			230708 : {
				name : "美溪区",
				zipcode : "153021"
			},
			230709 : {
				name : "金山屯区",
				zipcode : "153026"
			},
			230710 : {
				name : "五营区",
				zipcode : "153033"
			},
			230711 : {
				name : "乌马河区",
				zipcode : "153011"
			},
			230712 : {
				name : "汤旺河区",
				zipcode : "153037"
			},
			230713 : {
				name : "带岭区",
				zipcode : "153106"
			},
			230714 : {
				name : "乌伊岭区",
				zipcode : "153038"
			},
			230715 : {
				name : "红星区",
				zipcode : "153035"
			},
			230716 : {
				name : "上甘岭区",
				zipcode : "153032"
			},
			230722 : {
				name : "嘉荫县",
				zipcode : "153200"
			},
			230781 : {
				name : "铁力市",
				zipcode : "152500"
			}
		},
		230800 : {
			230803 : {
				name : "向阳区",
				zipcode : "154002"
			},
			230804 : {
				name : "前进区",
				zipcode : "154002"
			},
			230805 : {
				name : "东风区",
				zipcode : "154005"
			},
			230811 : {
				name : "郊区",
				zipcode : "154004"
			},
			230822 : {
				name : "桦南县",
				zipcode : "154400"
			},
			230826 : {
				name : "桦川县",
				zipcode : "154300"
			},
			230828 : {
				name : "汤原县",
				zipcode : "154700"
			},
			230833 : {
				name : "抚远县",
				zipcode : "156500"
			},
			230881 : {
				name : "同江市",
				zipcode : "156400"
			},
			230882 : {
				name : "富锦市",
				zipcode : "156100"
			}
		},
		230900 : {
			230902 : {
				name : "新兴区",
				zipcode : "154604"
			},
			230903 : {
				name : "桃山区",
				zipcode : "154600"
			},
			230904 : {
				name : "茄子河区",
				zipcode : "154622"
			},
			230921 : {
				name : "勃利县",
				zipcode : "154500"
			}
		},
		231000 : {
			231002 : {
				name : "东安区",
				zipcode : "157000"
			},
			231003 : {
				name : "阳明区",
				zipcode : "157013"
			},
			231004 : {
				name : "爱民区",
				zipcode : "157009"
			},
			231005 : {
				name : "西安区",
				zipcode : "157000"
			},
			231024 : {
				name : "东宁县",
				zipcode : "157200"
			},
			231025 : {
				name : "林口县",
				zipcode : "157600"
			},
			231081 : {
				name : "绥芬河市",
				zipcode : "157300"
			},
			231083 : {
				name : "海林市",
				zipcode : "157100"
			},
			231084 : {
				name : "宁安市",
				zipcode : "157400"
			},
			231085 : {
				name : "穆棱市",
				zipcode : "157500"
			}
		},
		231100 : {
			231102 : {
				name : "爱辉区",
				zipcode : "164300"
			},
			231121 : {
				name : "嫩江县",
				zipcode : "161400"
			},
			231123 : {
				name : "逊克县",
				zipcode : "164400"
			},
			231124 : {
				name : "孙吴县",
				zipcode : "164200"
			},
			231181 : {
				name : "北安市",
				zipcode : "164000"
			},
			231182 : {
				name : "五大连池市",
				zipcode : "164100"
			}
		},
		231200 : {
			231202 : {
				name : "北林区",
				zipcode : "152000"
			},
			231221 : {
				name : "望奎县",
				zipcode : "152100"
			},
			231222 : {
				name : "兰西县",
				zipcode : "151500"
			},
			231223 : {
				name : "青冈县",
				zipcode : "151600"
			},
			231224 : {
				name : "庆安县",
				zipcode : "152400"
			},
			231225 : {
				name : "明水县",
				zipcode : "151700"
			},
			231226 : {
				name : "绥棱县",
				zipcode : "152200"
			},
			231281 : {
				name : "安达市",
				zipcode : "151400"
			},
			231282 : {
				name : "肇东市",
				zipcode : "151100"
			},
			231283 : {
				name : "海伦市",
				zipcode : "152300"
			}
		},
		232700 : {
			232701 : {
				name : "加格达奇区",
				zipcode : "165000"
			},
			232721 : {
				name : "呼玛县",
				zipcode : "165100"
			},
			232722 : {
				name : "塔河县",
				zipcode : "165200"
			},
			232723 : {
				name : "漠河县",
				zipcode : "165300"
			}
		},
		310000 : {
			310100 : '上海市',
		},
		310100 : {
			310101 : {
				name : "黄浦区",
				zipcode : "200001"
			},
			310104 : {
				name : "徐汇区",
				zipcode : "200030"
			},
			310105 : {
				name : "长宁区",
				zipcode : "200050"
			},
			310106 : {
				name : "静安区",
				zipcode : "200040"
			},
			310107 : {
				name : "普陀区",
				zipcode : "200333"
			},
			310108 : {
				name : "闸北区",
				zipcode : "200070"
			},
			310109 : {
				name : "虹口区",
				zipcode : "200080"
			},
			310110 : {
				name : "杨浦区",
				zipcode : "200082"
			},
			310112 : {
				name : "闵行区",
				zipcode : "201100"
			},
			310113 : {
				name : "宝山区",
				zipcode : "201900"
			},
			310114 : {
				name : "嘉定区",
				zipcode : "201800"
			},
			310115 : {
				name : "浦东新区",
				zipcode : "200135"
			},
			310116 : {
				name : "金山区",
				zipcode : "200540"
			},
			310117 : {
				name : "松江区",
				zipcode : "201600"
			},
			310118 : {
				name : "青浦区",
				zipcode : "201700"
			},
			310120 : {
				name : "奉贤区",
				zipcode : "201400"
			},
			310230 : {
				name : "崇明县",
				zipcode : "202150"
			}
		},
		320000 : {
			320100 : '南京市',
			320200 : '无锡市',
			320300 : '徐州市',
			320400 : '常州市',
			320500 : '苏州市',
			320600 : '南通市',
			320700 : '连云港市',
			320800 : '淮安市',
			320900 : '盐城市',
			321000 : '扬州市',
			321100 : '镇江市',
			321200 : '泰州市',
			321300 : '宿迁市'
		},
		320100 : {
			320102 : {
				name : "玄武区",
				zipcode : "210018"
			},
			320104 : {
				name : "秦淮区",
				zipcode : "210001"
			},
			320105 : {
				name : "建邺区",
				zipcode : "210004"
			},
			320106 : {
				name : "鼓楼区",
				zipcode : "210009"
			},
			320111 : {
				name : "浦口区",
				zipcode : "211800"
			},
			320113 : {
				name : "栖霞区",
				zipcode : "210046"
			},
			320114 : {
				name : "雨花台区",
				zipcode : "210012"
			},
			320115 : {
				name : "江宁区",
				zipcode : "211100"
			},
			320116 : {
				name : "六合区",
				zipcode : "211500"
			},
			320117 : {
				name : "溧水区",
				zipcode : "000000"
			},
			320118 : {
				name : "高淳区",
				zipcode : "000000"
			},
		},
		320200 : {
			320202 : {
				name : "崇安区",
				zipcode : "214002"
			},
			320203 : {
				name : "南长区",
				zipcode : "214021"
			},
			320204 : {
				name : "北塘区",
				zipcode : "214044"
			},
			320205 : {
				name : "锡山区",
				zipcode : "214101"
			},
			320206 : {
				name : "惠山区",
				zipcode : "214174"
			},
			320211 : {
				name : "滨湖区",
				zipcode : "214062"
			},
			320281 : {
				name : "江阴市",
				zipcode : "214400"
			},
			320282 : {
				name : "宜兴市",
				zipcode : "214200"
			}
		},
		320300 : {
			320302 : {
				name : "鼓楼区",
				zipcode : "221005"
			},
			320303 : {
				name : "云龙区",
				zipcode : "221009"
			},
			320305 : {
				name : "贾汪区",
				zipcode : "221011"
			},
			320311 : {
				name : "泉山区",
				zipcode : "221006"
			},
			320312 : '铜山区',
			320321 : {
				name : "丰县",
				zipcode : "221700"
			},
			320322 : {
				name : "沛县",
				zipcode : "221600"
			},
			320324 : {
				name : "睢宁县",
				zipcode : "221200"
			},
			320381 : {
				name : "新沂市",
				zipcode : "221400"
			},
			320382 : {
				name : "邳州市",
				zipcode : "221300"
			}
		},
		320400 : {
			320402 : {
				name : "天宁区",
				zipcode : "213003"
			},
			320404 : {
				name : "钟楼区",
				zipcode : "213002"
			},
			320411 : {
				name : "新北区",
				zipcode : "213001"
			},
			320412 : {
				name : "武进区",
				zipcode : "213161"
			},
			320481 : {
				name : "溧阳市",
				zipcode : "213300"
			},
			320482 : {
				name : "金坛区",
				zipcode : "000000"
			},
		},
		320500 : {
			320505 : {
				name : "虎丘区",
				zipcode : "215004"
			},
			320506 : {
				name : "吴中区",
				zipcode : "215128"
			},
			320507 : {
				name : "相城区",
				zipcode : "215131"
			},
			320508 : {
				name : "姑苏区",
				zipcode : "215008"
			},
			320509 : '吴江区',
			320581 : {
				name : "常熟市",
				zipcode : "215500"
			},
			320582 : {
				name : "张家港市",
				zipcode : "215600"
			},
			320583 : {
				name : "昆山市",
				zipcode : "215300"
			},
			320585 : {
				name : "太仓市",
				zipcode : "215400"
			}
		},
		320600 : {
			320602 : {
				name : "崇川区",
				zipcode : "226001"
			},
			320611 : {
				name : "港闸区",
				zipcode : "226001"
			},
			320612 : '通州区',
			320621 : {
				name : "海安县",
				zipcode : "226600"
			},
			320623 : {
				name : "如东县",
				zipcode : "226400"
			},
			320681 : {
				name : "启东市",
				zipcode : "226200"
			},
			320682 : {
				name : "如皋市",
				zipcode : "226500"
			},
			320684 : {
				name : "海门市",
				zipcode : "226100"
			}
		},
		320700 : {
			320703 : {
				name : "连云区",
				zipcode : "222042"
			},
			320706 : {
				name : "海州区",
				zipcode : "222023"
			},
			320707 : '赣榆区',
			320722 : {
				name : "东海县",
				zipcode : "222300"
			},
			320723 : {
				name : "灌云县",
				zipcode : "222200"
			},
			320724 : {
				name : "灌南县",
				zipcode : "223500"
			}
		},
		320800 : {
			320802 : {
				name : "清河区",
				zipcode : "223001"
			},
			320803 : '淮安区',
			320804 : {
				name : "淮阴区",
				zipcode : "223300"
			},
			320811 : {
				name : "清浦区",
				zipcode : "223002"
			},
			320826 : {
				name : "涟水县",
				zipcode : "223400"
			},
			320829 : {
				name : "洪泽县",
				zipcode : "223100"
			},
			320830 : {
				name : "盱眙县",
				zipcode : "211700"
			},
			320831 : {
				name : "金湖县",
				zipcode : "211600"
			}
		},
		320900 : {
			320902 : {
				name : "亭湖区",
				zipcode : "224005"
			},
			320903 : {
				name : "盐都区",
				zipcode : "224055"
			},
			320921 : {
				name : "响水县",
				zipcode : "224600"
			},
			320922 : {
				name : "滨海县",
				zipcode : "224500"
			},
			320923 : {
				name : "阜宁县",
				zipcode : "224400"
			},
			320924 : {
				name : "射阳县",
				zipcode : "224300"
			},
			320925 : {
				name : "建湖县",
				zipcode : "224700"
			},
			320981 : {
				name : "东台市",
				zipcode : "224200"
			},
			320982 : {
				name : "大丰市",
				zipcode : "224100"
			}
		},
		321000 : {
			321002 : {
				name : "广陵区",
				zipcode : "225002"
			},
			321003 : {
				name : "邗江区",
				zipcode : "225002"
			},
			321012 : '江都区',
			321023 : {
				name : "宝应县",
				zipcode : "225800"
			},
			321081 : {
				name : "仪征市",
				zipcode : "211400"
			},
			321084 : {
				name : "高邮市",
				zipcode : "225600"
			}
		},
		321100 : {
			321102 : {
				name : "京口区",
				zipcode : "212001"
			},
			321111 : {
				name : "润州区",
				zipcode : "212004"
			},
			321112 : {
				name : "丹徒区",
				zipcode : "212001"
			},
			321181 : {
				name : "丹阳市",
				zipcode : "212300"
			},
			321182 : {
				name : "扬中市",
				zipcode : "212200"
			},
			321183 : {
				name : "句容市",
				zipcode : "212400"
			}
		},
		321200 : {
			321202 : {
				name : "海陵区",
				zipcode : "225300"
			},
			321203 : {
				name : "高港区",
				zipcode : "225321"
			},
			321204 : '姜堰区',
			321281 : {
				name : "兴化市",
				zipcode : "225700"
			},
			321282 : {
				name : "靖江市",
				zipcode : "214500"
			},
			321283 : {
				name : "泰兴市",
				zipcode : "225400"
			}
		},
		321300 : {
			321302 : {
				name : "宿城区",
				zipcode : "223800"
			},
			321311 : {
				name : "宿豫区",
				zipcode : "223800"
			},
			321322 : {
				name : "沭阳县",
				zipcode : "223600"
			},
			321323 : {
				name : "泗阳县",
				zipcode : "223700"
			},
			321324 : {
				name : "泗洪县",
				zipcode : "223900"
			}
		},
		330000 : {
			330100 : '杭州市',
			330200 : '宁波市',
			330300 : '温州市',
			330400 : '嘉兴市',
			330500 : '湖州市',
			330600 : '绍兴市',
			330700 : '金华市',
			330800 : '衢州市',
			330900 : '舟山市',
			331000 : '台州市',
			331100 : '丽水市'
		},
		330100 : {
			330102 : {
				name : "上城区",
				zipcode : "310002"
			},
			330103 : {
				name : "下城区",
				zipcode : "310006"
			},
			330104 : {
				name : "江干区",
				zipcode : "310016"
			},
			330105 : {
				name : "拱墅区",
				zipcode : "310011"
			},
			330106 : {
				name : "西湖区",
				zipcode : "310013"
			},
			330108 : {
				name : "滨江区",
				zipcode : "310051"
			},
			330109 : {
				name : "萧山区",
				zipcode : "311200"
			},
			330110 : {
				name : "余杭区",
				zipcode : "311100"
			},
			330111 : '富阳区',
			330122 : {
				name : "桐庐县",
				zipcode : "311500"
			},
			330127 : {
				name : "淳安县",
				zipcode : "311700"
			},
			330182 : {
				name : "建德市",
				zipcode : "311600"
			},
			330185 : {
				name : "临安市",
				zipcode : "311300"
			}
		},
		330200 : {
			330203 : {
				name : "海曙区",
				zipcode : "315000"
			},
			330204 : {
				name : "江东区",
				zipcode : "315040"
			},
			330205 : {
				name : "江北区",
				zipcode : "315040"
			},
			330206 : {
				name : "北仑区",
				zipcode : "315800"
			},
			330211 : {
				name : "镇海区",
				zipcode : "315200"
			},
			330212 : {
				name : "鄞州区",
				zipcode : "315100"
			},
			330225 : {
				name : "象山县",
				zipcode : "315700"
			},
			330226 : {
				name : "宁海县",
				zipcode : "315600"
			},
			330281 : {
				name : "余姚市",
				zipcode : "315400"
			},
			330282 : {
				name : "慈溪市",
				zipcode : "315300"
			},
			330283 : {
				name : "奉化市",
				zipcode : "315500"
			}
		},
		330300 : {
			330302 : {
				name : "鹿城区",
				zipcode : "325000"
			},
			330303 : {
				name : "龙湾区",
				zipcode : "325013"
			},
			330304 : {
				name : "瓯海区",
				zipcode : "325005"
			},
			330322 : {
				name : "洞头县",
				zipcode : "325700"
			},
			330324 : {
				name : "永嘉县",
				zipcode : "315100"
			},
			330326 : {
				name : "平阳县",
				zipcode : "325400"
			},
			330327 : {
				name : "苍南县",
				zipcode : "325800"
			},
			330328 : {
				name : "文成县",
				zipcode : "325300"
			},
			330329 : {
				name : "泰顺县",
				zipcode : "325500"
			},
			330381 : {
				name : "瑞安市",
				zipcode : "325200"
			},
			330382 : {
				name : "乐清市",
				zipcode : "325600"
			}
		},
		330400 : {
			330402 : {
				name : "南湖区",
				zipcode : "314001"
			},
			330411 : {
				name : "秀洲区",
				zipcode : "314001"
			},
			330421 : {
				name : "嘉善县",
				zipcode : "314100"
			},
			330424 : {
				name : "海盐县",
				zipcode : "314300"
			},
			330481 : {
				name : "海宁市",
				zipcode : "314400"
			},
			330482 : {
				name : "平湖市",
				zipcode : "314200"
			},
			330483 : {
				name : "桐乡市",
				zipcode : "314500"
			}
		},
		330500 : {
			330502 : {
				name : "吴兴区",
				zipcode : "313000"
			},
			330503 : {
				name : "南浔区",
				zipcode : "313009"
			},
			330521 : {
				name : "德清县",
				zipcode : "313200"
			},
			330522 : {
				name : "长兴县",
				zipcode : "313100"
			},
			330523 : {
				name : "安吉县",
				zipcode : "313300"
			}
		},
		330600 : {
			330602 : {
				name : "越城区",
				zipcode : "312000"
			},
			330603 : '柯桥区',
			330604 : '上虞区',
			330624 : {
				name : "新昌县",
				zipcode : "312500"
			},
			330681 : {
				name : "诸暨市",
				zipcode : "311800"
			},
			330683 : {
				name : "嵊州市",
				zipcode : "312400"
			}
		},
		330700 : {
			330702 : {
				name : "婺城区",
				zipcode : "321000"
			},
			330703 : {
				name : "金东区",
				zipcode : "321000"
			},
			330723 : {
				name : "武义县",
				zipcode : "321200"
			},
			330726 : {
				name : "浦江县",
				zipcode : "322200"
			},
			330727 : {
				name : "磐安县",
				zipcode : "322300"
			},
			330781 : {
				name : "兰溪市",
				zipcode : "321100"
			},
			330782 : {
				name : "义乌市",
				zipcode : "322000"
			},
			330783 : {
				name : "东阳市",
				zipcode : "322100"
			},
			330784 : {
				name : "永康市",
				zipcode : "321300"
			}
		},
		330800 : {
			330802 : {
				name : "柯城区",
				zipcode : "324100"
			},
			330803 : {
				name : "衢江区",
				zipcode : "324022"
			},
			330822 : {
				name : "常山县",
				zipcode : "324200"
			},
			330824 : {
				name : "开化县",
				zipcode : "324300"
			},
			330825 : {
				name : "龙游县",
				zipcode : "324400"
			},
			330881 : {
				name : "江山市",
				zipcode : "324100"
			}
		},
		330900 : {
			330902 : {
				name : "定海区",
				zipcode : "316000"
			},
			330903 : {
				name : "普陀区",
				zipcode : "316100"
			},
			330921 : {
				name : "岱山县",
				zipcode : "316200"
			},
			330922 : {
				name : "嵊泗县",
				zipcode : "202450"
			}
		},
		331000 : {
			331002 : {
				name : "椒江区",
				zipcode : "318000"
			},
			331003 : {
				name : "黄岩区",
				zipcode : "318020"
			},
			331004 : {
				name : "路桥区",
				zipcode : "318050"
			},
			331021 : {
				name : "玉环县",
				zipcode : "317600"
			},
			331022 : {
				name : "三门县",
				zipcode : "317100"
			},
			331023 : {
				name : "天台县",
				zipcode : "317200"
			},
			331024 : {
				name : "仙居县",
				zipcode : "317300"
			},
			331081 : {
				name : "温岭市",
				zipcode : "317500"
			},
			331082 : {
				name : "临海市",
				zipcode : "317000"
			}
		},
		331100 : {
			331102 : {
				name : "莲都区",
				zipcode : "323000"
			},
			331121 : {
				name : "青田县",
				zipcode : "323900"
			},
			331122 : {
				name : "缙云县",
				zipcode : "321400"
			},
			331123 : {
				name : "遂昌县",
				zipcode : "323300"
			},
			331124 : {
				name : "松阳县",
				zipcode : "323400"
			},
			331125 : {
				name : "云和县",
				zipcode : "323600"
			},
			331126 : {
				name : "庆元县",
				zipcode : "323800"
			},
			331127 : {
				name : "景宁畲族自治县",
				zipcode : "323500"
			},
			331181 : {
				name : "龙泉市",
				zipcode : "323700"
			}
		},
		340000 : {
			340100 : '合肥市',
			340200 : '芜湖市',
			340300 : '蚌埠市',
			340400 : '淮南市',
			340500 : '马鞍山市',
			340600 : '淮北市',
			340700 : '铜陵市',
			340800 : '安庆市',
			341000 : '黄山市',
			341100 : '滁州市',
			341200 : '阜阳市',
			341300 : '宿州市',
			341500 : '六安市',
			341600 : '亳州市',
			341700 : '池州市',
			341800 : '宣城市'
		},
		340100 : {
			340102 : {
				name : "瑶海区",
				zipcode : "230011"
			},
			340103 : {
				name : "庐阳区",
				zipcode : "230001"
			},
			340104 : {
				name : "蜀山区",
				zipcode : "230031"
			},
			340111 : {
				name : "包河区",
				zipcode : "230041"
			},
			340121 : {
				name : "长丰县",
				zipcode : "231100"
			},
			340122 : {
				name : "肥东县",
				zipcode : "231600"
			},
			340123 : {
				name : "肥西县",
				zipcode : "231200"
			},
			340124 : {
				name : "庐江县",
				zipcode : "231500"
			},
			340181 : {
				name : "巢湖市",
				zipcode : "000000"
			},
		},
		340200 : {
			340202 : {
				name : "镜湖区",
				zipcode : "241000"
			},
			340203 : {
				name : "弋江区",
				zipcode : "241000"
			},
			340207 : {
				name : "鸠江区",
				zipcode : "241000"
			},
			340208 : {
				name : "三山区",
				zipcode : "241000"
			},
			340221 : {
				name : "芜湖县",
				zipcode : "241100"
			},
			340222 : {
				name : "繁昌县",
				zipcode : "241200"
			},
			340223 : {
				name : "南陵县",
				zipcode : "242400"
			},
			340225 : {
				name : "无为县",
				zipcode : "238300"
			}
		},
		340300 : {
			340302 : {
				name : "龙子湖区",
				zipcode : "233000"
			},
			340303 : {
				name : "蚌山区",
				zipcode : "233000"
			},
			340304 : {
				name : "禹会区",
				zipcode : "233000"
			},
			340311 : {
				name : "淮上区",
				zipcode : "233000"
			},
			340321 : {
				name : "怀远县",
				zipcode : "233400"
			},
			340322 : {
				name : "五河县",
				zipcode : "233300"
			},
			340323 : {
				name : "固镇县",
				zipcode : "233700"
			}
		},
		340400 : {
			340402 : {
				name : "大通区",
				zipcode : "232033"
			},
			340403 : {
				name : "田家庵区",
				zipcode : "232000"
			},
			340404 : {
				name : "谢家集区",
				zipcode : "232052"
			},
			340405 : {
				name : "八公山区",
				zipcode : "232072"
			},
			340406 : {
				name : "潘集区",
				zipcode : "232082"
			},
			340421 : {
				name : "凤台县",
				zipcode : "232100"
			}
		},
		340500 : {
			340503 : {
				name : "花山区",
				zipcode : "243000"
			},
			340504 : {
				name : "雨山区",
				zipcode : "243071"
			},
			340506 : '博望区',
			340521 : {
				name : "当涂县",
				zipcode : "243100"
			},
			340522 : {
				name : "含山县",
				zipcode : "238100"
			},
			340523 : {
				name : "和县",
				zipcode : "238200"
			}
		},
		340600 : {
			340602 : {
				name : "杜集区",
				zipcode : "235000"
			},
			340603 : {
				name : "相山区",
				zipcode : "235000"
			},
			340604 : {
				name : "烈山区",
				zipcode : "235000"
			},
			340621 : {
				name : "濉溪县",
				zipcode : "235100"
			}
		},
		340700 : {
			340702 : {
				name : "铜官山区",
				zipcode : "244000"
			},
			340703 : {
				name : "狮子山区",
				zipcode : "244000"
			},
			340711 : {
				name : "郊区",
				zipcode : "244000"
			},
			340721 : {
				name : "铜陵县",
				zipcode : "244100"
			}
		},
		340800 : {
			340802 : {
				name : "迎江区",
				zipcode : "246001"
			},
			340803 : {
				name : "大观区",
				zipcode : "246002"
			},
			340811 : {
				name : "宜秀区",
				zipcode : "246003"
			},
			340822 : {
				name : "怀宁县",
				zipcode : "246100"
			},
			340823 : {
				name : "枞阳县",
				zipcode : "246700"
			},
			340824 : {
				name : "潜山县",
				zipcode : "246300"
			},
			340825 : {
				name : "太湖县",
				zipcode : "246400"
			},
			340826 : {
				name : "宿松县",
				zipcode : "246500"
			},
			340827 : {
				name : "望江县",
				zipcode : "246200"
			},
			340828 : {
				name : "岳西县",
				zipcode : "246600"
			},
			340881 : {
				name : "桐城市",
				zipcode : "231400"
			}
		},
		341000 : {
			341002 : {
				name : "屯溪区",
				zipcode : "245000"
			},
			341003 : {
				name : "黄山区",
				zipcode : "242700"
			},
			341004 : {
				name : "徽州区",
				zipcode : "245061"
			},
			341021 : {
				name : "歙县",
				zipcode : "245200"
			},
			341022 : {
				name : "休宁县",
				zipcode : "245400"
			},
			341023 : {
				name : "黟县",
				zipcode : "245500"
			},
			341024 : {
				name : "祁门县",
				zipcode : "245600"
			}
		},
		341100 : {
			341102 : {
				name : "琅琊区",
				zipcode : "239000"
			},
			341103 : {
				name : "南谯区",
				zipcode : "239000"
			},
			341122 : {
				name : "来安县",
				zipcode : "239200"
			},
			341124 : {
				name : "全椒县",
				zipcode : "239500"
			},
			341125 : {
				name : "定远县",
				zipcode : "233200"
			},
			341126 : {
				name : "凤阳县",
				zipcode : "233100"
			},
			341181 : {
				name : "天长市",
				zipcode : "239300"
			},
			341182 : {
				name : "明光市",
				zipcode : "239400"
			}
		},
		341200 : {
			341202 : {
				name : "颍州区",
				zipcode : "236001"
			},
			341203 : {
				name : "颍东区",
				zipcode : "236058"
			},
			341204 : {
				name : "颍泉区",
				zipcode : "236045"
			},
			341221 : {
				name : "临泉县",
				zipcode : "236400"
			},
			341222 : {
				name : "太和县",
				zipcode : "236600"
			},
			341225 : {
				name : "阜南县",
				zipcode : "236300"
			},
			341226 : {
				name : "颍上县",
				zipcode : "236200"
			},
			341282 : {
				name : "界首市",
				zipcode : "236500"
			}
		},
		341300 : {
			341302 : {
				name : "埇桥区",
				zipcode : "234000"
			},
			341321 : {
				name : "砀山县",
				zipcode : "235300"
			},
			341322 : {
				name : "萧县",
				zipcode : "235200"
			},
			341323 : {
				name : "灵璧县",
				zipcode : "234200"
			},
			341324 : {
				name : "泗县",
				zipcode : "234300"
			}
		},
		341500 : {
			341502 : {
				name : "金安区",
				zipcode : "237000"
			},
			341503 : {
				name : "裕安区",
				zipcode : "237010"
			},
			341521 : {
				name : "寿县",
				zipcode : "232200"
			},
			341522 : {
				name : "霍邱县",
				zipcode : "237400"
			},
			341523 : {
				name : "舒城县",
				zipcode : "231300"
			},
			341524 : {
				name : "金寨县",
				zipcode : "237300"
			},
			341525 : {
				name : "霍山县",
				zipcode : "237200"
			}
		},
		341600 : {
			341602 : {
				name : "谯城区",
				zipcode : "236800"
			},
			341621 : {
				name : "涡阳县",
				zipcode : "233600"
			},
			341622 : {
				name : "蒙城县",
				zipcode : "233500"
			},
			341623 : {
				name : "利辛县",
				zipcode : "236700"
			}
		},
		341700 : {
			341702 : {
				name : "贵池区",
				zipcode : "247100"
			},
			341721 : {
				name : "东至县",
				zipcode : "247200"
			},
			341722 : {
				name : "石台县",
				zipcode : "245100"
			},
			341723 : {
				name : "青阳县",
				zipcode : "242800"
			}
		},
		341800 : {
			341802 : {
				name : "宣州区",
				zipcode : "242000"
			},
			341821 : {
				name : "郎溪县",
				zipcode : "242100"
			},
			341822 : {
				name : "广德县",
				zipcode : "242200"
			},
			341823 : {
				name : "泾县",
				zipcode : "242500"
			},
			341824 : {
				name : "绩溪县",
				zipcode : "245300"
			},
			341825 : {
				name : "旌德县",
				zipcode : "242600"
			},
			341881 : {
				name : "宁国市",
				zipcode : "242300"
			}
		},
		350000 : {
			350100 : '福州市',
			350200 : '厦门市',
			350300 : '莆田市',
			350400 : '三明市',
			350500 : '泉州市',
			350600 : '漳州市',
			350700 : '南平市',
			350800 : '龙岩市',
			350900 : '宁德市'
		},
		350100 : {
			350102 : {
				name : "鼓楼区",
				zipcode : "350001"
			},
			350103 : {
				name : "台江区",
				zipcode : "350004"
			},
			350104 : {
				name : "仓山区",
				zipcode : "350007"
			},
			350105 : {
				name : "马尾区",
				zipcode : "350015"
			},
			350111 : {
				name : "晋安区",
				zipcode : "350011"
			},
			350121 : {
				name : "闽侯县",
				zipcode : "350100"
			},
			350122 : {
				name : "连江县",
				zipcode : "350500"
			},
			350123 : {
				name : "罗源县",
				zipcode : "350600"
			},
			350124 : {
				name : "闽清县",
				zipcode : "350800"
			},
			350125 : {
				name : "永泰县",
				zipcode : "350700"
			},
			350128 : {
				name : "平潭县",
				zipcode : "350400"
			},
			350181 : {
				name : "福清市",
				zipcode : "350300"
			},
			350182 : {
				name : "长乐市",
				zipcode : "350200"
			}
		},
		350200 : {
			350203 : {
				name : "思明区",
				zipcode : "361001"
			},
			350205 : {
				name : "海沧区",
				zipcode : "361026"
			},
			350206 : {
				name : "湖里区",
				zipcode : "361006"
			},
			350211 : {
				name : "集美区",
				zipcode : "361021"
			},
			350212 : {
				name : "同安区",
				zipcode : "361100"
			},
			350213 : {
				name : "翔安区",
				zipcode : "361101"
			}
		},
		350300 : {
			350302 : {
				name : "城厢区",
				zipcode : "351100"
			},
			350303 : {
				name : "涵江区",
				zipcode : "351111"
			},
			350304 : {
				name : "荔城区",
				zipcode : "351100"
			},
			350305 : {
				name : "秀屿区",
				zipcode : "351152"
			},
			350322 : {
				name : "仙游县",
				zipcode : "351200"
			}
		},
		350400 : {
			350402 : {
				name : "梅列区",
				zipcode : "365000"
			},
			350403 : {
				name : "三元区",
				zipcode : "365001"
			},
			350421 : {
				name : "明溪县",
				zipcode : "365200"
			},
			350423 : {
				name : "清流县",
				zipcode : "365300"
			},
			350424 : {
				name : "宁化县",
				zipcode : "365400"
			},
			350425 : {
				name : "大田县",
				zipcode : "366100"
			},
			350426 : {
				name : "尤溪县",
				zipcode : "365100"
			},
			350427 : {
				name : "沙县",
				zipcode : "365500"
			},
			350428 : {
				name : "将乐县",
				zipcode : "353300"
			},
			350429 : {
				name : "泰宁县",
				zipcode : "354400"
			},
			350430 : {
				name : "建宁县",
				zipcode : "354500"
			},
			350481 : {
				name : "永安市",
				zipcode : "366000"
			}
		},
		350500 : {
			350502 : {
				name : "鲤城区",
				zipcode : "362000"
			},
			350503 : {
				name : "丰泽区",
				zipcode : "362000"
			},
			350504 : {
				name : "洛江区",
				zipcode : "362011"
			},
			350505 : {
				name : "泉港区",
				zipcode : "362114"
			},
			350521 : {
				name : "惠安县",
				zipcode : "362100"
			},
			350524 : {
				name : "安溪县",
				zipcode : "362400"
			},
			350525 : {
				name : "永春县",
				zipcode : "362600"
			},
			350526 : {
				name : "德化县",
				zipcode : "362500"
			},
			350527 : {
				name : "金门县",
				zipcode : "362000"
			},
			350581 : {
				name : "石狮市",
				zipcode : "362700"
			},
			350582 : {
				name : "晋江市",
				zipcode : "362200"
			},
			350583 : {
				name : "南安市",
				zipcode : "362300"
			}
		},
		350600 : {
			350602 : {
				name : "芗城区",
				zipcode : "363000"
			},
			350603 : {
				name : "龙文区",
				zipcode : "363005"
			},
			350622 : {
				name : "云霄县",
				zipcode : "363300"
			},
			350623 : {
				name : "漳浦县",
				zipcode : "363200"
			},
			350624 : {
				name : "诏安县",
				zipcode : "363500"
			},
			350625 : {
				name : "长泰县",
				zipcode : "363900"
			},
			350626 : {
				name : "东山县",
				zipcode : "363400"
			},
			350627 : {
				name : "南靖县",
				zipcode : "363600"
			},
			350628 : {
				name : "平和县",
				zipcode : "363700"
			},
			350629 : {
				name : "华安县",
				zipcode : "363800"
			},
			350681 : {
				name : "龙海市",
				zipcode : "363100"
			}
		},
		350700 : {
			350702 : {
				name : "延平区",
				zipcode : "353000"
			},
			350703 : '建阳区',
			350721 : {
				name : "顺昌县",
				zipcode : "353200"
			},
			350722 : {
				name : "浦城县",
				zipcode : "353400"
			},
			350723 : {
				name : "光泽县",
				zipcode : "354100"
			},
			350724 : {
				name : "松溪县",
				zipcode : "353500"
			},
			350725 : {
				name : "政和县",
				zipcode : "353600"
			},
			350781 : {
				name : "邵武市",
				zipcode : "354000"
			},
			350782 : {
				name : "武夷山市",
				zipcode : "354300"
			},
			350783 : {
				name : "建瓯市",
				zipcode : "353100"
			}
		},
		350800 : {
			350802 : {
				name : "新罗区",
				zipcode : "364000"
			},
			350803 : {
				name : "永定区",
				zipcode : "427000"
			},
			350821 : {
				name : "长汀县",
				zipcode : "366300"
			},
			350823 : {
				name : "上杭县",
				zipcode : "364200"
			},
			350824 : {
				name : "武平县",
				zipcode : "364300"
			},
			350825 : {
				name : "连城县",
				zipcode : "366200"
			},
			350881 : {
				name : "漳平市",
				zipcode : "364400"
			}
		},
		350900 : {
			350902 : {
				name : "蕉城区",
				zipcode : "352100"
			},
			350921 : {
				name : "霞浦县",
				zipcode : "355100"
			},
			350922 : {
				name : "古田县",
				zipcode : "352200"
			},
			350923 : {
				name : "屏南县",
				zipcode : "352300"
			},
			350924 : {
				name : "寿宁县",
				zipcode : "355500"
			},
			350925 : {
				name : "周宁县",
				zipcode : "355400"
			},
			350926 : {
				name : "柘荣县",
				zipcode : "355300"
			},
			350981 : {
				name : "福安市",
				zipcode : "355000"
			},
			350982 : {
				name : "福鼎市",
				zipcode : "355200"
			}
		},
		360000 : {
			360100 : '南昌市',
			360200 : '景德镇市',
			360300 : '萍乡市',
			360400 : '九江市',
			360500 : '新余市',
			360600 : '鹰潭市',
			360700 : '赣州市',
			360800 : '吉安市',
			360900 : '宜春市',
			361000 : '抚州市',
			361100 : '上饶市'
		},
		360100 : {
			360102 : {
				name : "东湖区",
				zipcode : "330006"
			},
			360103 : {
				name : "西湖区",
				zipcode : "330009"
			},
			360104 : {
				name : "青云谱区",
				zipcode : "330001"
			},
			360105 : {
				name : "湾里区",
				zipcode : "330004"
			},
			360111 : {
				name : "青山湖区",
				zipcode : "330029"
			},
			360121 : {
				name : "南昌县",
				zipcode : "330200"
			},
			360122 : {
				name : "新建县",
				zipcode : "330100"
			},
			360123 : {
				name : "安义县",
				zipcode : "330500"
			},
			360124 : {
				name : "进贤县",
				zipcode : "331700"
			}
		},
		360200 : {
			360202 : {
				name : "昌江区",
				zipcode : "333000"
			},
			360203 : {
				name : "珠山区",
				zipcode : "333000"
			},
			360222 : {
				name : "浮梁县",
				zipcode : "333400"
			},
			360281 : {
				name : "乐平市",
				zipcode : "333300"
			}
		},
		360300 : {
			360302 : {
				name : "安源区",
				zipcode : "337000"
			},
			360313 : {
				name : "湘东区",
				zipcode : "337016"
			},
			360321 : {
				name : "莲花县",
				zipcode : "337100"
			},
			360322 : {
				name : "上栗县",
				zipcode : "337009"
			},
			360323 : {
				name : "芦溪县",
				zipcode : "337053"
			}
		},
		360400 : {
			360402 : {
				name : "庐山区",
				zipcode : "332005"
			},
			360403 : {
				name : "浔阳区",
				zipcode : "332000"
			},
			360421 : {
				name : "九江县",
				zipcode : "332100"
			},
			360423 : {
				name : "武宁县",
				zipcode : "332300"
			},
			360424 : {
				name : "修水县",
				zipcode : "332400"
			},
			360425 : {
				name : "永修县",
				zipcode : "330300"
			},
			360426 : {
				name : "德安县",
				zipcode : "330400"
			},
			360427 : {
				name : "星子县",
				zipcode : "332800"
			},
			360428 : {
				name : "都昌县",
				zipcode : "332600"
			},
			360429 : {
				name : "湖口县",
				zipcode : "332500"
			},
			360430 : {
				name : "彭泽县",
				zipcode : "332700"
			},
			360481 : {
				name : "瑞昌市",
				zipcode : "332200"
			},
			360482 : {
				name : "共青城市",
				zipcode : "332020"
			}
		},
		360500 : {
			360502 : {
				name : "渝水区",
				zipcode : "338025"
			},
			360521 : {
				name : "分宜县",
				zipcode : "336600"
			}
		},
		360600 : {
			360602 : {
				name : "月湖区",
				zipcode : "335000"
			},
			360622 : {
				name : "余江县",
				zipcode : "335200"
			},
			360681 : {
				name : "贵溪市",
				zipcode : "335400"
			}
		},
		360700 : {
			360702 : {
				name : "章贡区",
				zipcode : "341000"
			},
			360703 : '南康区',
			360721 : {
				name : "赣县",
				zipcode : "341100"
			},
			360722 : {
				name : "信丰县",
				zipcode : "341600"
			},
			360723 : {
				name : "大余县",
				zipcode : "341500"
			},
			360724 : {
				name : "上犹县",
				zipcode : "341200"
			},
			360725 : {
				name : "崇义县",
				zipcode : "341300"
			},
			360726 : {
				name : "安远县",
				zipcode : "342100"
			},
			360727 : {
				name : "龙南县",
				zipcode : "341700"
			},
			360728 : {
				name : "定南县",
				zipcode : "341900"
			},
			360729 : {
				name : "全南县",
				zipcode : "341800"
			},
			360730 : {
				name : "宁都县",
				zipcode : "342800"
			},
			360731 : {
				name : "于都县",
				zipcode : "342300"
			},
			360732 : {
				name : "兴国县",
				zipcode : "342400"
			},
			360733 : {
				name : "会昌县",
				zipcode : "342600"
			},
			360734 : {
				name : "寻乌县",
				zipcode : "342200"
			},
			360735 : {
				name : "石城县",
				zipcode : "342700"
			},
			360781 : {
				name : "瑞金市",
				zipcode : "342500"
			}
		},
		360800 : {
			360802 : {
				name : "吉州区",
				zipcode : "343000"
			},
			360803 : {
				name : "青原区",
				zipcode : "343009"
			},
			360821 : {
				name : "吉安县",
				zipcode : "343100"
			},
			360822 : {
				name : "吉水县",
				zipcode : "331600"
			},
			360823 : {
				name : "峡江县",
				zipcode : "331400"
			},
			360824 : {
				name : "新干县",
				zipcode : "331300"
			},
			360825 : {
				name : "永丰县",
				zipcode : "331500"
			},
			360826 : {
				name : "泰和县",
				zipcode : "343700"
			},
			360827 : {
				name : "遂川县",
				zipcode : "343900"
			},
			360828 : {
				name : "万安县",
				zipcode : "343800"
			},
			360829 : {
				name : "安福县",
				zipcode : "343200"
			},
			360830 : {
				name : "永新县",
				zipcode : "343400"
			},
			360881 : {
				name : "井冈山市",
				zipcode : "343600"
			}
		},
		360900 : {
			360902 : {
				name : "袁州区",
				zipcode : "336000"
			},
			360921 : {
				name : "奉新县",
				zipcode : "330700"
			},
			360922 : {
				name : "万载县",
				zipcode : "336100"
			},
			360923 : {
				name : "上高县",
				zipcode : "336400"
			},
			360924 : {
				name : "宜丰县",
				zipcode : "336300"
			},
			360925 : {
				name : "靖安县",
				zipcode : "330600"
			},
			360926 : {
				name : "铜鼓县",
				zipcode : "336200"
			},
			360981 : {
				name : "丰城市",
				zipcode : "331100"
			},
			360982 : {
				name : "樟树市",
				zipcode : "331200"
			},
			360983 : {
				name : "高安市",
				zipcode : "330800"
			}
		},
		361000 : {
			361002 : {
				name : "临川区",
				zipcode : "344100"
			},
			361021 : {
				name : "南城县",
				zipcode : "344700"
			},
			361022 : {
				name : "黎川县",
				zipcode : "344600"
			},
			361023 : {
				name : "南丰县",
				zipcode : "344500"
			},
			361024 : {
				name : "崇仁县",
				zipcode : "344200"
			},
			361025 : {
				name : "乐安县",
				zipcode : "344300"
			},
			361026 : {
				name : "宜黄县",
				zipcode : "344400"
			},
			361027 : {
				name : "金溪县",
				zipcode : "344800"
			},
			361028 : {
				name : "资溪县",
				zipcode : "335300"
			},
			361029 : {
				name : "东乡县",
				zipcode : "331800"
			},
			361030 : {
				name : "广昌县",
				zipcode : "344900"
			}
		},
		361100 : {
			361102 : {
				name : "信州区",
				zipcode : "334000"
			},
			361103 : '广丰区',
			361121 : {
				name : "上饶县",
				zipcode : "334100"
			},
			361123 : {
				name : "玉山县",
				zipcode : "334700"
			},
			361124 : {
				name : "铅山县",
				zipcode : "334500"
			},
			361125 : {
				name : "横峰县",
				zipcode : "334300"
			},
			361126 : {
				name : "弋阳县",
				zipcode : "334400"
			},
			361127 : {
				name : "余干县",
				zipcode : "335100"
			},
			361128 : {
				name : "鄱阳县",
				zipcode : "333100"
			},
			361129 : {
				name : "万年县",
				zipcode : "335500"
			},
			361130 : {
				name : "婺源县",
				zipcode : "333200"
			},
			361181 : {
				name : "德兴市",
				zipcode : "334200"
			}
		},
		370000 : {
			370100 : '济南市',
			370200 : '青岛市',
			370300 : '淄博市',
			370400 : '枣庄市',
			370500 : '东营市',
			370600 : '烟台市',
			370700 : '潍坊市',
			370800 : '济宁市',
			370900 : '泰安市',
			371000 : '威海市',
			371100 : '日照市',
			371200 : '莱芜市',
			371300 : '临沂市',
			371400 : '德州市',
			371500 : '聊城市',
			371600 : '滨州市',
			371700 : '菏泽市'
		},
		370100 : {
			370102 : {
				name : "历下区",
				zipcode : "250014"
			},
			370103 : {
				name : "市中区",
				zipcode : "250001"
			},
			370104 : {
				name : "槐荫区",
				zipcode : "250022"
			},
			370105 : {
				name : "天桥区",
				zipcode : "250031"
			},
			370112 : {
				name : "历城区",
				zipcode : "250100"
			},
			370113 : {
				name : "长清区",
				zipcode : "250300"
			},
			370124 : {
				name : "平阴县",
				zipcode : "250400"
			},
			370125 : {
				name : "济阳县",
				zipcode : "251400"
			},
			370126 : {
				name : "商河县",
				zipcode : "251600"
			},
			370181 : {
				name : "章丘市",
				zipcode : "250200"
			}
		},
		370200 : {
			370202 : {
				name : "市南区",
				zipcode : "266001"
			},
			370203 : {
				name : "市北区",
				zipcode : "266011"
			},
			370211 : {
				name : "黄岛区",
				zipcode : "266500"
			},
			370212 : {
				name : "崂山区",
				zipcode : "266100"
			},
			370213 : {
				name : "李沧区",
				zipcode : "266021"
			},
			370214 : {
				name : "城阳区",
				zipcode : "266041"
			},
			370281 : {
				name : "胶州市",
				zipcode : "266300"
			},
			370282 : {
				name : "即墨市",
				zipcode : "266200"
			},
			370283 : {
				name : "平度市",
				zipcode : "266700"
			},
			370285 : {
				name : "莱西市",
				zipcode : "266600"
			}
		},
		370300 : {
			370302 : {
				name : "淄川区",
				zipcode : "255100"
			},
			370303 : {
				name : "张店区",
				zipcode : "255022"
			},
			370304 : {
				name : "博山区",
				zipcode : "255200"
			},
			370305 : {
				name : "临淄区",
				zipcode : "255400"
			},
			370306 : {
				name : "周村区",
				zipcode : "255300"
			},
			370321 : {
				name : "桓台县",
				zipcode : "256400"
			},
			370322 : {
				name : "高青县",
				zipcode : "256300"
			},
			370323 : {
				name : "沂源县",
				zipcode : "256100"
			}
		},
		370400 : {
			370402 : {
				name : "市中区",
				zipcode : "277101"
			},
			370403 : {
				name : "薛城区",
				zipcode : "277000"
			},
			370404 : {
				name : "峄城区",
				zipcode : "277300"
			},
			370405 : {
				name : "台儿庄区",
				zipcode : "277400"
			},
			370406 : {
				name : "山亭区",
				zipcode : "277200"
			},
			370481 : {
				name : "滕州市",
				zipcode : "277500"
			}
		},
		370500 : {
			370502 : {
				name : "东营区",
				zipcode : "257029"
			},
			370503 : {
				name : "河口区",
				zipcode : "257200"
			},
			370521 : {
				name : "垦利县",
				zipcode : "257500"
			},
			370522 : {
				name : "利津县",
				zipcode : "257400"
			},
			370523 : {
				name : "广饶县",
				zipcode : "257300"
			}
		},
		370600 : {
			370602 : {
				name : "芝罘区",
				zipcode : "264001"
			},
			370611 : {
				name : "福山区",
				zipcode : "265500"
			},
			370612 : {
				name : "牟平区",
				zipcode : "264100"
			},
			370613 : {
				name : "莱山区",
				zipcode : "264600"
			},
			370634 : {
				name : "长岛县",
				zipcode : "265800"
			},
			370681 : {
				name : "龙口市",
				zipcode : "265700"
			},
			370682 : {
				name : "莱阳市",
				zipcode : "265200"
			},
			370683 : {
				name : "莱州市",
				zipcode : "261400"
			},
			370684 : {
				name : "蓬莱市",
				zipcode : "265600"
			},
			370685 : {
				name : "招远市",
				zipcode : "265400"
			},
			370686 : {
				name : "栖霞市",
				zipcode : "265300"
			},
			370687 : {
				name : "海阳市",
				zipcode : "265100"
			}
		},
		370700 : {
			370702 : {
				name : "潍城区",
				zipcode : "261021"
			},
			370703 : {
				name : "寒亭区",
				zipcode : "261100"
			},
			370704 : {
				name : "坊子区",
				zipcode : "261200"
			},
			370705 : {
				name : "奎文区",
				zipcode : "261031"
			},
			370724 : {
				name : "临朐县",
				zipcode : "262600"
			},
			370725 : {
				name : "昌乐县",
				zipcode : "262400"
			},
			370781 : {
				name : "青州市",
				zipcode : "262500"
			},
			370782 : {
				name : "诸城市",
				zipcode : "262200"
			},
			370783 : {
				name : "寿光市",
				zipcode : "262700"
			},
			370784 : {
				name : "安丘市",
				zipcode : "262100"
			},
			370785 : {
				name : "高密市",
				zipcode : "261500"
			},
			370786 : {
				name : "昌邑市",
				zipcode : "261300"
			}
		},
		370800 : {
			370811 : {
				name : "任城区",
				zipcode : "272113"
			},
			370812 : '兖州区',
			370826 : {
				name : "微山县",
				zipcode : "277600"
			},
			370827 : {
				name : "鱼台县",
				zipcode : "272300"
			},
			370828 : {
				name : "金乡县",
				zipcode : "272200"
			},
			370829 : {
				name : "嘉祥县",
				zipcode : "272400"
			},
			370830 : {
				name : "汶上县",
				zipcode : "272501"
			},
			370831 : {
				name : "泗水县",
				zipcode : "273200"
			},
			370832 : {
				name : "梁山县",
				zipcode : "272600"
			},
			370881 : {
				name : "曲阜市",
				zipcode : "273100"
			},
			370883 : {
				name : "邹城市",
				zipcode : "273500"
			}
		},
		370900 : {
			370902 : {
				name : "泰山区",
				zipcode : "271000"
			},
			370911 : {
				name : "岱岳区",
				zipcode : "271000"
			},
			370921 : {
				name : "宁阳县",
				zipcode : "271400"
			},
			370923 : {
				name : "东平县",
				zipcode : "271500"
			},
			370982 : {
				name : "新泰市",
				zipcode : "271200"
			},
			370983 : {
				name : "肥城市",
				zipcode : "271600"
			}
		},
		371000 : {
			371002 : {
				name : "环翠区",
				zipcode : "264200"
			},
			371003 : '文登区',
			371082 : {
				name : "荣成市",
				zipcode : "264300"
			},
			371083 : {
				name : "乳山市",
				zipcode : "264500"
			}
		},
		371100 : {
			371102 : {
				name : "东港区",
				zipcode : "276800"
			},
			371103 : {
				name : "岚山区",
				zipcode : "276808"
			},
			371121 : {
				name : "五莲县",
				zipcode : "272300"
			},
			371122 : {
				name : "莒县",
				zipcode : "266500"
			}
		},
		371200 : {
			371202 : {
				name : "莱城区",
				zipcode : "271100"
			},
			371203 : {
				name : "钢城区",
				zipcode : "271100"
			}
		},
		371300 : {
			371302 : {
				name : "兰山区",
				zipcode : "276002"
			},
			371311 : {
				name : "罗庄区",
				zipcode : "276022"
			},
			371312 : {
				name : "河东区",
				zipcode : "276034"
			},
			371321 : {
				name : "沂南县",
				zipcode : "276300"
			},
			371322 : {
				name : "郯城县",
				zipcode : "276100"
			},
			371323 : {
				name : "沂水县",
				zipcode : "276400"
			},
			371324 : '兰陵县',
			371325 : {
				name : "费县",
				zipcode : "273400"
			},
			371326 : {
				name : "平邑县",
				zipcode : "273300"
			},
			371327 : {
				name : "莒南县",
				zipcode : "276600"
			},
			371328 : {
				name : "蒙阴县",
				zipcode : "276200"
			},
			371329 : {
				name : "临沭县",
				zipcode : "276700"
			}
		},
		371400 : {
			371402 : {
				name : "德城区",
				zipcode : "253011"
			},
			371403 : '陵城区',
			371422 : {
				name : "宁津县",
				zipcode : "253400"
			},
			371423 : {
				name : "庆云县",
				zipcode : "253700"
			},
			371424 : {
				name : "临邑县",
				zipcode : "251500"
			},
			371425 : {
				name : "齐河县",
				zipcode : "251100"
			},
			371426 : {
				name : "平原县",
				zipcode : "253100"
			},
			371427 : {
				name : "夏津县",
				zipcode : "253200"
			},
			371428 : {
				name : "武城县",
				zipcode : "253300"
			},
			371481 : {
				name : "乐陵市",
				zipcode : "253600"
			},
			371482 : {
				name : "禹城市",
				zipcode : "251200"
			}
		},
		371500 : {
			371502 : {
				name : "东昌府区",
				zipcode : "252000"
			},
			371521 : {
				name : "阳谷县",
				zipcode : "252300"
			},
			371522 : {
				name : "莘县",
				zipcode : "252400"
			},
			371523 : {
				name : "茌平县",
				zipcode : "252100"
			},
			371524 : {
				name : "东阿县",
				zipcode : "252200"
			},
			371525 : {
				name : "冠县",
				zipcode : "252500"
			},
			371526 : {
				name : "高唐县",
				zipcode : "252800"
			},
			371581 : {
				name : "临清市",
				zipcode : "252600"
			}
		},
		371600 : {
			371602 : {
				name : "滨城区",
				zipcode : "256613"
			},
			371603 : '沾化区',
			371621 : {
				name : "惠民县",
				zipcode : "251700"
			},
			371622 : {
				name : "阳信县",
				zipcode : "251800"
			},
			371623 : {
				name : "无棣县",
				zipcode : "251900"
			},
			371625 : {
				name : "博兴县",
				zipcode : "256500"
			},
			371626 : {
				name : "邹平县",
				zipcode : "256200"
			}
		},
		371700 : {
			371702 : {
				name : "牡丹区",
				zipcode : "274009"
			},
			371721 : {
				name : "曹县",
				zipcode : "274400"
			},
			371722 : {
				name : "单县",
				zipcode : "274300"
			},
			371723 : {
				name : "成武县",
				zipcode : "274200"
			},
			371724 : {
				name : "巨野县",
				zipcode : "274900"
			},
			371725 : {
				name : "郓城县",
				zipcode : "274700"
			},
			371726 : {
				name : "鄄城县",
				zipcode : "274600"
			},
			371727 : {
				name : "定陶县",
				zipcode : "274100"
			},
			371728 : {
				name : "东明县",
				zipcode : "274500"
			}
		},
		410000 : {
			410100 : '郑州市',
			410200 : '开封市',
			410300 : '洛阳市',
			410400 : '平顶山市',
			410500 : '安阳市',
			410600 : '鹤壁市',
			410700 : '新乡市',
			410800 : '焦作市',
			410900 : '濮阳市',
			411000 : '许昌市',
			411100 : '漯河市',
			411200 : '三门峡市',
			411300 : '南阳市',
			411400 : '商丘市',
			411500 : '信阳市',
			411600 : '周口市',
			411700 : '驻马店市',
			419001 : {
				name : "济源市",
				zipcode : "454650"
			}
		},
		410100 : {
			410102 : {
				name : "中原区",
				zipcode : "450007"
			},
			410103 : {
				name : "二七区",
				zipcode : "450052"
			},
			410104 : {
				name : "管城回族区",
				zipcode : "450000"
			},
			410105 : {
				name : "金水区",
				zipcode : "450003"
			},
			410106 : {
				name : "上街区",
				zipcode : "450041"
			},
			410108 : {
				name : "惠济区",
				zipcode : "450053"
			},
			410122 : {
				name : "中牟县",
				zipcode : "451450"
			},
			410181 : {
				name : "巩义市",
				zipcode : "451200"
			},
			410182 : {
				name : "荥阳市",
				zipcode : "450100"
			},
			410183 : {
				name : "新密市",
				zipcode : "452300"
			},
			410184 : {
				name : "新郑市",
				zipcode : "451100"
			},
			410185 : {
				name : "登封市",
				zipcode : "452470"
			}
		},
		410200 : {
			410202 : {
				name : "龙亭区",
				zipcode : "475100"
			},
			410203 : {
				name : "顺河回族区",
				zipcode : "475000"
			},
			410204 : {
				name : "鼓楼区",
				zipcode : "475000"
			},
			410205 : {
				name : "禹王台区",
				zipcode : "475003"
			},
			410212 : '祥符区',
			410221 : {
				name : "杞县",
				zipcode : "475200"
			},
			410222 : {
				name : "通许县",
				zipcode : "475400"
			},
			410223 : {
				name : "尉氏县",
				zipcode : "475500"
			},
			410225 : {
				name : "兰考县",
				zipcode : "475300"
			}
		},
		410300 : {
			410302 : {
				name : "老城区",
				zipcode : "471002"
			},
			410303 : {
				name : "西工区",
				zipcode : "471000"
			},
			410304 : {
				name : "瀍河回族区",
				zipcode : "471002"
			},
			410305 : {
				name : "涧西区",
				zipcode : "471003"
			},
			410306 : {
				name : "吉利区",
				zipcode : "471012"
			},
			410311 : {
				name : "洛龙区",
				zipcode : "471000"
			},
			410322 : {
				name : "孟津县",
				zipcode : "471100"
			},
			410323 : {
				name : "新安县",
				zipcode : "471800"
			},
			410324 : {
				name : "栾川县",
				zipcode : "471500"
			},
			410325 : {
				name : "嵩县",
				zipcode : "471400"
			},
			410326 : {
				name : "汝阳县",
				zipcode : "471200"
			},
			410327 : {
				name : "宜阳县",
				zipcode : "471600"
			},
			410328 : {
				name : "洛宁县",
				zipcode : "471700"
			},
			410329 : {
				name : "伊川县",
				zipcode : "471300"
			},
			410381 : {
				name : "偃师市",
				zipcode : "471900"
			}
		},
		410400 : {
			410402 : {
				name : "新华区",
				zipcode : "467002"
			},
			410403 : {
				name : "卫东区",
				zipcode : "467021"
			},
			410404 : {
				name : "石龙区",
				zipcode : "467045"
			},
			410411 : {
				name : "湛河区",
				zipcode : "467000"
			},
			410421 : {
				name : "宝丰县",
				zipcode : "467400"
			},
			410422 : {
				name : "叶县",
				zipcode : "467200"
			},
			410423 : {
				name : "鲁山县",
				zipcode : "467300"
			},
			410425 : {
				name : "郏县",
				zipcode : "467100"
			},
			410481 : {
				name : "舞钢市",
				zipcode : "462500"
			},
			410482 : {
				name : "汝州市",
				zipcode : "467500"
			}
		},
		410500 : {
			410502 : {
				name : "文峰区",
				zipcode : "455000"
			},
			410503 : {
				name : "北关区",
				zipcode : "455001"
			},
			410505 : {
				name : "殷都区",
				zipcode : "455004"
			},
			410506 : {
				name : "龙安区",
				zipcode : "455001"
			},
			410522 : {
				name : "安阳县",
				zipcode : "455000"
			},
			410523 : {
				name : "汤阴县",
				zipcode : "456150"
			},
			410526 : {
				name : "滑县",
				zipcode : "456400"
			},
			410527 : {
				name : "内黄县",
				zipcode : "456350"
			},
			410581 : {
				name : "林州市",
				zipcode : "456500"
			}
		},
		410600 : {
			410602 : {
				name : "鹤山区",
				zipcode : "458010"
			},
			410603 : {
				name : "山城区",
				zipcode : "458000"
			},
			410611 : {
				name : "淇滨区",
				zipcode : "458000"
			},
			410621 : {
				name : "浚县",
				zipcode : "456250"
			},
			410622 : {
				name : "淇县",
				zipcode : "456750"
			}
		},
		410700 : {
			410702 : {
				name : "红旗区",
				zipcode : "453000"
			},
			410703 : {
				name : "卫滨区",
				zipcode : "453000"
			},
			410704 : {
				name : "凤泉区",
				zipcode : "453011"
			},
			410711 : {
				name : "牧野区",
				zipcode : "453002"
			},
			410721 : {
				name : "新乡县",
				zipcode : "453700"
			},
			410724 : {
				name : "获嘉县",
				zipcode : "453800"
			},
			410725 : {
				name : "原阳县",
				zipcode : "453500"
			},
			410726 : {
				name : "延津县",
				zipcode : "453200"
			},
			410727 : {
				name : "封丘县",
				zipcode : "453300"
			},
			410728 : {
				name : "长垣县",
				zipcode : "453400"
			},
			410781 : {
				name : "卫辉市",
				zipcode : "453100"
			},
			410782 : {
				name : "辉县市",
				zipcode : "453600"
			}
		},
		410800 : {
			410802 : {
				name : "解放区",
				zipcode : "454000"
			},
			410803 : {
				name : "中站区",
				zipcode : "454191"
			},
			410804 : {
				name : "马村区",
				zipcode : "454171"
			},
			410811 : {
				name : "山阳区",
				zipcode : "454002"
			},
			410821 : {
				name : "修武县",
				zipcode : "454350"
			},
			410822 : {
				name : "博爱县",
				zipcode : "454450"
			},
			410823 : {
				name : "武陟县",
				zipcode : "454950"
			},
			410825 : {
				name : "温县",
				zipcode : "454850"
			},
			410882 : {
				name : "沁阳市",
				zipcode : "454550"
			},
			410883 : {
				name : "孟州市",
				zipcode : "454750"
			}
		},
		410900 : {
			410902 : {
				name : "华龙区",
				zipcode : "457001"
			},
			410922 : {
				name : "清丰县",
				zipcode : "457300"
			},
			410923 : {
				name : "南乐县",
				zipcode : "457400"
			},
			410926 : {
				name : "范县",
				zipcode : "457500"
			},
			410927 : {
				name : "台前县",
				zipcode : "457600"
			},
			410928 : {
				name : "濮阳县",
				zipcode : "457100"
			}
		},
		411000 : {
			411002 : {
				name : "魏都区",
				zipcode : "461000"
			},
			411023 : {
				name : "许昌县",
				zipcode : "461100"
			},
			411024 : {
				name : "鄢陵县",
				zipcode : "461200"
			},
			411025 : {
				name : "襄城县",
				zipcode : "461700"
			},
			411081 : {
				name : "禹州市",
				zipcode : "461670"
			},
			411082 : {
				name : "长葛市",
				zipcode : "461500"
			}
		},
		411100 : {
			411102 : {
				name : "源汇区",
				zipcode : "462000"
			},
			411103 : {
				name : "郾城区",
				zipcode : "462300"
			},
			411104 : {
				name : "召陵区",
				zipcode : "462300"
			},
			411121 : {
				name : "舞阳县",
				zipcode : "462400"
			},
			411122 : {
				name : "临颍县",
				zipcode : "462600"
			}
		},
		411200 : {
			411202 : {
				name : "湖滨区",
				zipcode : "472000"
			},
			411203 : '陕州区',
			411221 : {
				name : "渑池县",
				zipcode : "472400"
			},
			411224 : {
				name : "卢氏县",
				zipcode : "472200"
			},
			411281 : {
				name : "义马市",
				zipcode : "472300"
			},
			411282 : {
				name : "灵宝市",
				zipcode : "472500"
			}
		},
		411300 : {
			411302 : {
				name : "宛城区",
				zipcode : "473001"
			},
			411303 : {
				name : "卧龙区",
				zipcode : "473003"
			},
			411321 : {
				name : "南召县",
				zipcode : "474650"
			},
			411322 : {
				name : "方城县",
				zipcode : "473200"
			},
			411323 : {
				name : "西峡县",
				zipcode : "474550"
			},
			411324 : {
				name : "镇平县",
				zipcode : "474250"
			},
			411325 : {
				name : "内乡县",
				zipcode : "474350"
			},
			411326 : {
				name : "淅川县",
				zipcode : "474450"
			},
			411327 : {
				name : "社旗县",
				zipcode : "473300"
			},
			411328 : {
				name : "唐河县",
				zipcode : "473400"
			},
			411329 : {
				name : "新野县",
				zipcode : "473500"
			},
			411330 : {
				name : "桐柏县",
				zipcode : "474750"
			},
			411381 : {
				name : "邓州市",
				zipcode : "474150"
			}
		},
		411400 : {
			411402 : {
				name : "梁园区",
				zipcode : "476000"
			},
			411403 : {
				name : "睢阳区",
				zipcode : "476100"
			},
			411421 : {
				name : "民权县",
				zipcode : "476800"
			},
			411422 : {
				name : "睢县",
				zipcode : "476900"
			},
			411423 : {
				name : "宁陵县",
				zipcode : "476700"
			},
			411424 : {
				name : "柘城县",
				zipcode : "476200"
			},
			411425 : {
				name : "虞城县",
				zipcode : "476300"
			},
			411426 : {
				name : "夏邑县",
				zipcode : "476400"
			},
			411481 : {
				name : "永城市",
				zipcode : "476600"
			}
		},
		411500 : {
			411502 : {
				name : "浉河区",
				zipcode : "464000"
			},
			411503 : {
				name : "平桥区",
				zipcode : "464100"
			},
			411521 : {
				name : "罗山县",
				zipcode : "464200"
			},
			411522 : {
				name : "光山县",
				zipcode : "465450"
			},
			411523 : {
				name : "新县",
				zipcode : "465550"
			},
			411524 : {
				name : "商城县",
				zipcode : "465350"
			},
			411525 : {
				name : "固始县",
				zipcode : "465250"
			},
			411526 : {
				name : "潢川县",
				zipcode : "465150"
			},
			411527 : {
				name : "淮滨县",
				zipcode : "464400"
			},
			411528 : {
				name : "息县",
				zipcode : "464300"
			}
		},
		411600 : {
			411602 : {
				name : "川汇区",
				zipcode : "466000"
			},
			411621 : {
				name : "扶沟县",
				zipcode : "461300"
			},
			411622 : {
				name : "西华县",
				zipcode : "466600"
			},
			411623 : {
				name : "商水县",
				zipcode : "466100"
			},
			411624 : {
				name : "沈丘县",
				zipcode : "466300"
			},
			411625 : {
				name : "郸城县",
				zipcode : "477150"
			},
			411626 : {
				name : "淮阳县",
				zipcode : "466700"
			},
			411627 : {
				name : "太康县",
				zipcode : "461400"
			},
			411628 : {
				name : "鹿邑县",
				zipcode : "477200"
			},
			411681 : {
				name : "项城市",
				zipcode : "466200"
			}
		},
		411700 : {
			411702 : {
				name : "驿城区",
				zipcode : "463000"
			},
			411721 : {
				name : "西平县",
				zipcode : "463900"
			},
			411722 : {
				name : "上蔡县",
				zipcode : "463800"
			},
			411723 : {
				name : "平舆县",
				zipcode : "463400"
			},
			411724 : {
				name : "正阳县",
				zipcode : "463600"
			},
			411725 : {
				name : "确山县",
				zipcode : "463200"
			},
			411726 : {
				name : "泌阳县",
				zipcode : "463700"
			},
			411727 : {
				name : "汝南县",
				zipcode : "463300"
			},
			411728 : {
				name : "遂平县",
				zipcode : "463100"
			},
			411729 : {
				name : "新蔡县",
				zipcode : "463500"
			}
		},
		420000 : {
			420100 : '武汉市',
			420200 : '黄石市',
			420300 : '十堰市',
			420500 : '宜昌市',
			420600 : '襄阳市',
			420700 : '鄂州市',
			420800 : '荆门市',
			420900 : '孝感市',
			421000 : '荆州市',
			421100 : '黄冈市',
			421200 : '咸宁市',
			421300 : '随州市',
			422800 : '恩施土家族苗族自治州',
			429004 : {
				name : "仙桃市",
				zipcode : "433000"
			},
			429005 : {
				name : "潜江市",
				zipcode : "433100"
			},
			429006 : {
				name : "天门市",
				zipcode : "431700"
			},
			429021 : {
				name : "神农架林区",
				zipcode : "442400"
			}
		},
		420100 : {
			420102 : {
				name : "江岸区",
				zipcode : "430014"
			},
			420103 : {
				name : "江汉区",
				zipcode : "430021"
			},
			420104 : {
				name : "硚口区",
				zipcode : "430033"
			},
			420105 : {
				name : "汉阳区",
				zipcode : "430050"
			},
			420106 : {
				name : "武昌区",
				zipcode : "430061"
			},
			420107 : {
				name : "青山区",
				zipcode : "430080"
			},
			420111 : {
				name : "洪山区",
				zipcode : "430070"
			},
			420112 : {
				name : "东西湖区",
				zipcode : "430040"
			},
			420113 : {
				name : "汉南区",
				zipcode : "430090"
			},
			420114 : {
				name : "蔡甸区",
				zipcode : "430100"
			},
			420115 : {
				name : "江夏区",
				zipcode : "430200"
			},
			420116 : {
				name : "黄陂区",
				zipcode : "432200"
			},
			420117 : {
				name : "新洲区",
				zipcode : "431400"
			}
		},
		420200 : {
			420202 : {
				name : "黄石港区",
				zipcode : "435000"
			},
			420203 : {
				name : "西塞山区",
				zipcode : "435001"
			},
			420204 : {
				name : "下陆区",
				zipcode : "435005"
			},
			420205 : {
				name : "铁山区",
				zipcode : "435006"
			},
			420222 : {
				name : "阳新县",
				zipcode : "435200"
			},
			420281 : {
				name : "大冶市",
				zipcode : "435100"
			}
		},
		420300 : {
			420302 : {
				name : "茅箭区",
				zipcode : "442012"
			},
			420303 : {
				name : "张湾区",
				zipcode : "442001"
			},
			420304 : '郧阳区',
			420322 : {
				name : "郧西县",
				zipcode : "442600"
			},
			420323 : {
				name : "竹山县",
				zipcode : "442200"
			},
			420324 : {
				name : "竹溪县",
				zipcode : "442300"
			},
			420325 : {
				name : "房县",
				zipcode : "442100"
			},
			420381 : {
				name : "丹江口市",
				zipcode : "442700"
			}
		},
		420500 : {
			420502 : {
				name : "西陵区",
				zipcode : "443000"
			},
			420503 : {
				name : "伍家岗区",
				zipcode : "443001"
			},
			420504 : {
				name : "点军区",
				zipcode : "443006"
			},
			420505 : {
				name : "猇亭区",
				zipcode : "443007"
			},
			420506 : {
				name : "夷陵区",
				zipcode : "443100"
			},
			420525 : {
				name : "远安县",
				zipcode : "444200"
			},
			420526 : {
				name : "兴山县",
				zipcode : "443711"
			},
			420527 : {
				name : "秭归县",
				zipcode : "443600"
			},
			420528 : {
				name : "长阳土家族自治县",
				zipcode : "443500"
			},
			420529 : {
				name : "五峰土家族自治县",
				zipcode : "443400"
			},
			420581 : {
				name : "宜都市",
				zipcode : "443300"
			},
			420582 : {
				name : "当阳市",
				zipcode : "444100"
			},
			420583 : {
				name : "枝江市",
				zipcode : "443200"
			}
		},
		420600 : {
			420602 : {
				name : "襄城区",
				zipcode : "441021"
			},
			420606 : {
				name : "樊城区",
				zipcode : "441001"
			},
			420607 : '襄州区',
			420624 : {
				name : "南漳县",
				zipcode : "441500"
			},
			420625 : {
				name : "谷城县",
				zipcode : "441700"
			},
			420626 : {
				name : "保康县",
				zipcode : "441600"
			},
			420682 : {
				name : "老河口市",
				zipcode : "441800"
			},
			420683 : {
				name : "枣阳市",
				zipcode : "441200"
			},
			420684 : {
				name : "宜城市",
				zipcode : "441400"
			}
		},
		420700 : {
			420702 : {
				name : "梁子湖区",
				zipcode : "436064"
			},
			420703 : {
				name : "华容区",
				zipcode : "436030"
			},
			420704 : {
				name : "鄂城区",
				zipcode : "436000"
			}
		},
		420800 : {
			420802 : {
				name : "东宝区",
				zipcode : "448004"
			},
			420804 : {
				name : "掇刀区",
				zipcode : "448124"
			},
			420821 : {
				name : "京山县",
				zipcode : "431800"
			},
			420822 : {
				name : "沙洋县",
				zipcode : "448200"
			},
			420881 : {
				name : "钟祥市",
				zipcode : "431900"
			}
		},
		420900 : {
			420902 : {
				name : "孝南区",
				zipcode : "432100"
			},
			420921 : {
				name : "孝昌县",
				zipcode : "432900"
			},
			420922 : {
				name : "大悟县",
				zipcode : "432800"
			},
			420923 : {
				name : "云梦县",
				zipcode : "432500"
			},
			420981 : {
				name : "应城市",
				zipcode : "432400"
			},
			420982 : {
				name : "安陆市",
				zipcode : "432600"
			},
			420984 : {
				name : "汉川市",
				zipcode : "432300"
			}
		},
		421000 : {
			421002 : {
				name : "沙市区",
				zipcode : "434000"
			},
			421003 : {
				name : "荆州区",
				zipcode : "434020"
			},
			421022 : {
				name : "公安县",
				zipcode : "434300"
			},
			421023 : {
				name : "监利县",
				zipcode : "433300"
			},
			421024 : {
				name : "江陵县",
				zipcode : "434101"
			},
			421081 : {
				name : "石首市",
				zipcode : "434400"
			},
			421083 : {
				name : "洪湖市",
				zipcode : "433200"
			},
			421087 : {
				name : "松滋市",
				zipcode : "434200"
			}
		},
		421100 : {
			421102 : {
				name : "黄州区",
				zipcode : "438000"
			},
			421121 : {
				name : "团风县",
				zipcode : "438000"
			},
			421122 : {
				name : "红安县",
				zipcode : "438401"
			},
			421123 : {
				name : "罗田县",
				zipcode : "438600"
			},
			421124 : {
				name : "英山县",
				zipcode : "438700"
			},
			421125 : {
				name : "浠水县",
				zipcode : "438200"
			},
			421126 : {
				name : "蕲春县",
				zipcode : "435300"
			},
			421127 : {
				name : "黄梅县",
				zipcode : "435500"
			},
			421181 : {
				name : "麻城市",
				zipcode : "438300"
			},
			421182 : {
				name : "武穴市",
				zipcode : "435400"
			}
		},
		421200 : {
			421202 : {
				name : "咸安区",
				zipcode : "437000"
			},
			421221 : {
				name : "嘉鱼县",
				zipcode : "437200"
			},
			421222 : {
				name : "通城县",
				zipcode : "437400"
			},
			421223 : {
				name : "崇阳县",
				zipcode : "437500"
			},
			421224 : {
				name : "通山县",
				zipcode : "437600"
			},
			421281 : {
				name : "赤壁市",
				zipcode : "437300"
			}
		},
		421300 : {
			421303 : {
				name : "曾都区",
				zipcode : "441300"
			},
			421321 : '随县',
			421381 : {
				name : "广水市",
				zipcode : "432700"
			}
		},
		422800 : {
			422801 : {
				name : "恩施市",
				zipcode : "445000"
			},
			422802 : {
				name : "利川市",
				zipcode : "445400"
			},
			422822 : {
				name : "建始县",
				zipcode : "445300"
			},
			422823 : {
				name : "巴东县",
				zipcode : "444300"
			},
			422825 : {
				name : "宣恩县",
				zipcode : "445500"
			},
			422826 : {
				name : "咸丰县",
				zipcode : "445600"
			},
			422827 : {
				name : "来凤县",
				zipcode : "445700"
			},
			422828 : {
				name : "鹤峰县",
				zipcode : "445800"
			}
		},
		430000 : {
			430100 : '长沙市',
			430200 : '株洲市',
			430300 : '湘潭市',
			430400 : '衡阳市',
			430500 : '邵阳市',
			430600 : '岳阳市',
			430700 : '常德市',
			430800 : '张家界市',
			430900 : '益阳市',
			431000 : '郴州市',
			431100 : '永州市',
			431200 : '怀化市',
			431300 : '娄底市',
			433100 : '湘西土家族苗族自治州'
		},
		430100 : {
			430102 : {
				name : "芙蓉区",
				zipcode : "410011"
			},
			430103 : {
				name : "天心区",
				zipcode : "410011"
			},
			430104 : {
				name : "岳麓区",
				zipcode : "410006"
			},
			430105 : {
				name : "开福区",
				zipcode : "410008"
			},
			430111 : {
				name : "雨花区",
				zipcode : "410011"
			},
			430112 : '望城区',
			430121 : {
				name : "长沙县",
				zipcode : "410100"
			},
			430124 : {
				name : "宁乡县",
				zipcode : "410600"
			},
			430181 : {
				name : "浏阳市",
				zipcode : "410300"
			}
		},
		430200 : {
			430202 : {
				name : "荷塘区",
				zipcode : "412000"
			},
			430203 : {
				name : "芦淞区",
				zipcode : "412000"
			},
			430204 : {
				name : "石峰区",
				zipcode : "412005"
			},
			430211 : {
				name : "天元区",
				zipcode : "412007"
			},
			430221 : {
				name : "株洲县",
				zipcode : "412100"
			},
			430223 : {
				name : "攸县",
				zipcode : "412300"
			},
			430224 : {
				name : "茶陵县",
				zipcode : "412400"
			},
			430225 : {
				name : "炎陵县",
				zipcode : "412500"
			},
			430281 : {
				name : "醴陵市",
				zipcode : "412200"
			}
		},
		430300 : {
			430302 : {
				name : "雨湖区",
				zipcode : "411100"
			},
			430304 : {
				name : "岳塘区",
				zipcode : "411101"
			},
			430321 : {
				name : "湘潭县",
				zipcode : "411228"
			},
			430381 : {
				name : "湘乡市",
				zipcode : "411400"
			},
			430382 : {
				name : "韶山市",
				zipcode : "411300"
			}
		},
		430400 : {
			430405 : {
				name : "珠晖区",
				zipcode : "421002"
			},
			430406 : {
				name : "雁峰区",
				zipcode : "421001"
			},
			430407 : {
				name : "石鼓区",
				zipcode : "421001"
			},
			430408 : {
				name : "蒸湘区",
				zipcode : "421001"
			},
			430412 : {
				name : "南岳区",
				zipcode : "421900"
			},
			430421 : {
				name : "衡阳县",
				zipcode : "421200"
			},
			430422 : {
				name : "衡南县",
				zipcode : "421131"
			},
			430423 : {
				name : "衡山县",
				zipcode : "421300"
			},
			430424 : {
				name : "衡东县",
				zipcode : "421400"
			},
			430426 : {
				name : "祁东县",
				zipcode : "421600"
			},
			430481 : {
				name : "耒阳市",
				zipcode : "421800"
			},
			430482 : {
				name : "常宁市",
				zipcode : "421500"
			}
		},
		430500 : {
			430502 : {
				name : "双清区",
				zipcode : "422001"
			},
			430503 : {
				name : "大祥区",
				zipcode : "422000"
			},
			430511 : {
				name : "北塔区",
				zipcode : "422007"
			},
			430521 : {
				name : "邵东县",
				zipcode : "422800"
			},
			430522 : {
				name : "新邵县",
				zipcode : "422900"
			},
			430523 : {
				name : "邵阳县",
				zipcode : "422100"
			},
			430524 : {
				name : "隆回县",
				zipcode : "422200"
			},
			430525 : {
				name : "洞口县",
				zipcode : "422300"
			},
			430527 : {
				name : "绥宁县",
				zipcode : "422600"
			},
			430528 : {
				name : "新宁县",
				zipcode : "422700"
			},
			430529 : {
				name : "城步苗族自治县",
				zipcode : "422500"
			},
			430581 : {
				name : "武冈市",
				zipcode : "422400"
			}
		},
		430600 : {
			430602 : {
				name : "岳阳楼区",
				zipcode : "414000"
			},
			430603 : {
				name : "云溪区",
				zipcode : "414009"
			},
			430611 : {
				name : "君山区",
				zipcode : "414005"
			},
			430621 : {
				name : "岳阳县",
				zipcode : "414100"
			},
			430623 : {
				name : "华容县",
				zipcode : "414200"
			},
			430624 : {
				name : "湘阴县",
				zipcode : "410500"
			},
			430626 : {
				name : "平江县",
				zipcode : "414500"
			},
			430681 : {
				name : "汨罗市",
				zipcode : "414400"
			},
			430682 : {
				name : "临湘市",
				zipcode : "414300"
			}
		},
		430700 : {
			430702 : {
				name : "武陵区",
				zipcode : "415000"
			},
			430703 : {
				name : "鼎城区",
				zipcode : "415101"
			},
			430721 : {
				name : "安乡县",
				zipcode : "415600"
			},
			430722 : {
				name : "汉寿县",
				zipcode : "415900"
			},
			430723 : {
				name : "澧县",
				zipcode : "415500"
			},
			430724 : {
				name : "临澧县",
				zipcode : "415200"
			},
			430725 : {
				name : "桃源县",
				zipcode : "415700"
			},
			430726 : {
				name : "石门县",
				zipcode : "415300"
			},
			430781 : {
				name : "津市市",
				zipcode : "415400"
			}
		},
		430800 : {
			430802 : '永定区',
			430811 : {
				name : "武陵源区",
				zipcode : "427400"
			},
			430821 : {
				name : "慈利县",
				zipcode : "427200"
			},
			430822 : {
				name : "桑植县",
				zipcode : "427100"
			}
		},
		430900 : {
			430902 : {
				name : "资阳区",
				zipcode : "413001"
			},
			430903 : {
				name : "赫山区",
				zipcode : "413002"
			},
			430921 : {
				name : "南县",
				zipcode : "413200"
			},
			430922 : {
				name : "桃江县",
				zipcode : "413400"
			},
			430923 : {
				name : "安化县",
				zipcode : "413500"
			},
			430981 : {
				name : "沅江市",
				zipcode : "413100"
			}
		},
		431000 : {
			431002 : {
				name : "北湖区",
				zipcode : "423000"
			},
			431003 : {
				name : "苏仙区",
				zipcode : "423000"
			},
			431021 : {
				name : "桂阳县",
				zipcode : "424400"
			},
			431022 : {
				name : "宜章县",
				zipcode : "424200"
			},
			431023 : {
				name : "永兴县",
				zipcode : "423300"
			},
			431024 : {
				name : "嘉禾县",
				zipcode : "424500"
			},
			431025 : {
				name : "临武县",
				zipcode : "424300"
			},
			431026 : {
				name : "汝城县",
				zipcode : "424100"
			},
			431027 : {
				name : "桂东县",
				zipcode : "423500"
			},
			431028 : {
				name : "安仁县",
				zipcode : "423600"
			},
			431081 : {
				name : "资兴市",
				zipcode : "423400"
			}
		},
		431100 : {
			431102 : {
				name : "零陵区",
				zipcode : "425002"
			},
			431103 : {
				name : "冷水滩区",
				zipcode : "425100"
			},
			431121 : {
				name : "祁阳县",
				zipcode : "426100"
			},
			431122 : {
				name : "东安县",
				zipcode : "425900"
			},
			431123 : {
				name : "双牌县",
				zipcode : "425200"
			},
			431124 : {
				name : "道县",
				zipcode : "425300"
			},
			431125 : {
				name : "江永县",
				zipcode : "425400"
			},
			431126 : {
				name : "宁远县",
				zipcode : "425600"
			},
			431127 : {
				name : "蓝山县",
				zipcode : "425800"
			},
			431128 : {
				name : "新田县",
				zipcode : "425700"
			},
			431129 : {
				name : "江华瑶族自治县",
				zipcode : "425500"
			}
		},
		431200 : {
			431202 : {
				name : "鹤城区",
				zipcode : "418000"
			},
			431221 : {
				name : "中方县",
				zipcode : "418005"
			},
			431222 : {
				name : "沅陵县",
				zipcode : "419600"
			},
			431223 : {
				name : "辰溪县",
				zipcode : "419500"
			},
			431224 : {
				name : "溆浦县",
				zipcode : "419300"
			},
			431225 : {
				name : "会同县",
				zipcode : "418300"
			},
			431226 : {
				name : "麻阳苗族自治县",
				zipcode : "419400"
			},
			431227 : {
				name : "新晃侗族自治县",
				zipcode : "419200"
			},
			431228 : {
				name : "芷江侗族自治县",
				zipcode : "419100"
			},
			431229 : {
				name : "靖州苗族侗族自治县",
				zipcode : "418400"
			},
			431230 : {
				name : "通道侗族自治县",
				zipcode : "418500"
			},
			431281 : {
				name : "洪江市",
				zipcode : "418116"
			}
		},
		431300 : {
			431302 : {
				name : "娄星区",
				zipcode : "417000"
			},
			431321 : {
				name : "双峰县",
				zipcode : "417700"
			},
			431322 : {
				name : "新化县",
				zipcode : "417600"
			},
			431381 : {
				name : "冷水江市",
				zipcode : "417500"
			},
			431382 : {
				name : "涟源市",
				zipcode : "417100"
			}
		},
		433100 : {
			433101 : {
				name : "吉首市",
				zipcode : "416000"
			},
			433122 : {
				name : "泸溪县",
				zipcode : "416100"
			},
			433123 : {
				name : "凤凰县",
				zipcode : "416200"
			},
			433124 : {
				name : "花垣县",
				zipcode : "416400"
			},
			433125 : {
				name : "保靖县",
				zipcode : "416500"
			},
			433126 : {
				name : "古丈县",
				zipcode : "416300"
			},
			433127 : {
				name : "永顺县",
				zipcode : "416700"
			},
			433130 : {
				name : "龙山县",
				zipcode : "416800"
			}
		},
		440000 : {
			440100 : '广州市',
			440200 : '韶关市',
			440300 : '深圳市',
			440400 : '珠海市',
			440500 : '汕头市',
			440600 : '佛山市',
			440700 : '江门市',
			440800 : '湛江市',
			440900 : '茂名市',
			441200 : '肇庆市',
			441300 : '惠州市',
			441400 : '梅州市',
			441500 : '汕尾市',
			441600 : '河源市',
			441700 : '阳江市',
			441800 : '清远市',
			441900 : '东莞市',
			442000 : {
				name : "中山市",
				zipcode : "528403"
			},
			445100 : '潮州市',
			445200 : '揭阳市',
			445300 : '云浮市'
		},
		440100 : {
			440103 : {
				name : "荔湾区",
				zipcode : "510145"
			},
			440104 : {
				name : "越秀区",
				zipcode : "510030"
			},
			440105 : {
				name : "海珠区",
				zipcode : "510220"
			},
			440106 : {
				name : "天河区",
				zipcode : "510630"
			},
			440111 : {
				name : "白云区",
				zipcode : "510080"
			},
			440112 : {
				name : "黄埔区",
				zipcode : "510700"
			},
			440113 : {
				name : "番禺区",
				zipcode : "511400"
			},
			440114 : {
				name : "花都区",
				zipcode : "510800"
			},
			440115 : {
				name : "南沙区",
				zipcode : "511400"
			},
			440117 : '从化区',
			440118 : '增城区'
		},
		440200 : {
			440203 : {
				name : "武江区",
				zipcode : "512026"
			},
			440204 : {
				name : "浈江区",
				zipcode : "512023"
			},
			440205 : {
				name : "曲江区",
				zipcode : "512100"
			},
			440222 : {
				name : "始兴县",
				zipcode : "512500"
			},
			440224 : {
				name : "仁化县",
				zipcode : "512300"
			},
			440229 : {
				name : "翁源县",
				zipcode : "512600"
			},
			440232 : {
				name : "乳源瑶族自治县",
				zipcode : "512700"
			},
			440233 : {
				name : "新丰县",
				zipcode : "511100"
			},
			440281 : {
				name : "乐昌市",
				zipcode : "512200"
			},
			440282 : {
				name : "南雄市",
				zipcode : "512400"
			}
		},
		440300 : {
			440303 : {
				name : "罗湖区",
				zipcode : "518001"
			},
			440304 : {
				name : "福田区",
				zipcode : "518033"
			},
			440305 : {
				name : "南山区",
				zipcode : "518052"
			},
			440306 : {
				name : "宝安区",
				zipcode : "518101"
			},
			440307 : {
				name : "龙岗区",
				zipcode : "518116"
			},
			440308 : {
				name : "盐田区",
				zipcode : "518083"
			},
			440309 : {
				name : "其它区",
				zipcode : "000000"
			}
		},
		440400 : {
			440402 : {
				name : "香洲区",
				zipcode : "519000"
			},
			440403 : {
				name : "斗门区",
				zipcode : "519100"
			},
			440404 : {
				name : "金湾区",
				zipcode : "519090"
			}
		},
		440500 : {
			440507 : {
				name : "龙湖区",
				zipcode : "515041"
			},
			440511 : {
				name : "金平区",
				zipcode : "515041"
			},
			440512 : {
				name : "濠江区",
				zipcode : "515071"
			},
			440513 : {
				name : "潮阳区",
				zipcode : "515100"
			},
			440514 : {
				name : "潮南区",
				zipcode : "515144"
			},
			440515 : {
				name : "澄海区",
				zipcode : "515800"
			},
			440523 : {
				name : "南澳县",
				zipcode : "515900"
			}
		},
		440600 : {
			440604 : {
				name : "禅城区",
				zipcode : "528000"
			},
			440605 : {
				name : "南海区",
				zipcode : "528200"
			},
			440606 : {
				name : "顺德区",
				zipcode : "528300"
			},
			440607 : {
				name : "三水区",
				zipcode : "528100"
			},
			440608 : {
				name : "高明区",
				zipcode : "528500"
			}
		},
		440700 : {
			440703 : {
				name : "蓬江区",
				zipcode : "529051"
			},
			440704 : {
				name : "江海区",
				zipcode : "529000"
			},
			440705 : {
				name : "新会区",
				zipcode : "529100"
			},
			440781 : {
				name : "台山市",
				zipcode : "529211"
			},
			440783 : {
				name : "开平市",
				zipcode : "529312"
			},
			440784 : {
				name : "鹤山市",
				zipcode : "529711"
			},
			440785 : {
				name : "恩平市",
				zipcode : "529411"
			}
		},
		440800 : {
			440802 : {
				name : "赤坎区",
				zipcode : "524033"
			},
			440803 : {
				name : "霞山区",
				zipcode : "524002"
			},
			440804 : {
				name : "坡头区",
				zipcode : "524057"
			},
			440811 : {
				name : "麻章区",
				zipcode : "524003"
			},
			440823 : {
				name : "遂溪县",
				zipcode : "524300"
			},
			440825 : {
				name : "徐闻县",
				zipcode : "524100"
			},
			440881 : {
				name : "廉江市",
				zipcode : "524400"
			},
			440882 : {
				name : "雷州市",
				zipcode : "524200"
			},
			440883 : {
				name : "吴川市",
				zipcode : "524500"
			}
		},
		440900 : {
			440902 : {
				name : "茂南区",
				zipcode : "525011"
			},
			440904 : '电白区',
			440981 : {
				name : "高州市",
				zipcode : "525200"
			},
			440982 : {
				name : "化州市",
				zipcode : "525100"
			},
			440983 : {
				name : "信宜市",
				zipcode : "525300"
			}
		},
		441200 : {
			441202 : {
				name : "端州区",
				zipcode : "526040"
			},
			441203 : {
				name : "鼎湖区",
				zipcode : "526070"
			},
			441223 : {
				name : "广宁县",
				zipcode : "526300"
			},
			441224 : {
				name : "怀集县",
				zipcode : "526400"
			},
			441225 : {
				name : "封开县",
				zipcode : "526500"
			},
			441226 : {
				name : "德庆县",
				zipcode : "526600"
			},
			441283 : '高要区',
			441284 : {
				name : "四会市",
				zipcode : "526200"
			}
		},
		441300 : {
			441302 : {
				name : "惠城区",
				zipcode : "516001"
			},
			441303 : {
				name : "惠阳区",
				zipcode : "516200"
			},
			441322 : {
				name : "博罗县",
				zipcode : "516100"
			},
			441323 : {
				name : "惠东县",
				zipcode : "516300"
			},
			441324 : {
				name : "龙门县",
				zipcode : "516800"
			}
		},
		441400 : {
			441402 : {
				name : "梅江区",
				zipcode : "514000"
			},
			441403 : '梅县区',
			441422 : {
				name : "大埔县",
				zipcode : "514200"
			},
			441423 : {
				name : "丰顺县",
				zipcode : "514300"
			},
			441424 : {
				name : "五华县",
				zipcode : "514400"
			},
			441426 : {
				name : "平远县",
				zipcode : "514600"
			},
			441427 : {
				name : "蕉岭县",
				zipcode : "514100"
			},
			441481 : {
				name : "兴宁市",
				zipcode : "514500"
			}
		},
		441500 : {
			441502 : {
				name : "城区",
				zipcode : "516601"
			},
			441521 : {
				name : "海丰县",
				zipcode : "516400"
			},
			441523 : {
				name : "陆河县",
				zipcode : "516700"
			},
			441581 : {
				name : "陆丰市",
				zipcode : "516500"
			}
		},
		441600 : {
			441602 : {
				name : "源城区",
				zipcode : "517000"
			},
			441621 : {
				name : "紫金县",
				zipcode : "517400"
			},
			441622 : {
				name : "龙川县",
				zipcode : "517300"
			},
			441623 : {
				name : "连平县",
				zipcode : "517100"
			},
			441624 : {
				name : "和平县",
				zipcode : "517200"
			},
			441625 : {
				name : "东源县",
				zipcode : "517500"
			}
		},
		441700 : {
			441702 : {
				name : "江城区",
				zipcode : "529525"
			},
			441704 : '阳东区',
			441721 : {
				name : "阳西县",
				zipcode : "529800"
			},
			441781 : {
				name : "阳春市",
				zipcode : "529611"
			}
		},
		441800 : {
			441802 : {
				name : "清城区",
				zipcode : "511500"
			},
			441803 : '清新区',
			441821 : {
				name : "佛冈县",
				zipcode : "511600"
			},
			441823 : {
				name : "阳山县",
				zipcode : "513100"
			},
			441825 : {
				name : "连山壮族瑶族自治县",
				zipcode : "513200"
			},
			441826 : {
				name : "连南瑶族自治县",
				zipcode : "513300"
			},
			441881 : {
				name : "英德市",
				zipcode : "513000"
			},
			441882 : {
				name : "连州市",
				zipcode : "513401"
			}
		},
		441900 : {
			441900 : '三元里'
		},
		442000 : {
			442000 : '湖滨北路'
		},
		445100 : {
			445102 : {
				name : "湘桥区",
				zipcode : "521000"
			},
			445103 : '潮安区',
			445122 : {
				name : "饶平县",
				zipcode : "515700"
			}
		},
		445200 : {
			445202 : {
				name : "榕城区",
				zipcode : "522095"
			},
			445203 : '揭东区',
			445222 : {
				name : "揭西县",
				zipcode : "515400"
			},
			445224 : {
				name : "惠来县",
				zipcode : "515200"
			},
			445281 : {
				name : "普宁市",
				zipcode : "515300"
			}
		},
		445300 : {
			445302 : {
				name : "云城区",
				zipcode : "527300"
			},
			445303 : '云安区',
			445321 : {
				name : "新兴县",
				zipcode : "527400"
			},
			445322 : {
				name : "郁南县",
				zipcode : "527100"
			},
			445381 : {
				name : "罗定市",
				zipcode : "527200"
			}
		},
		450000 : {
			450100 : '南宁市',
			450200 : '柳州市',
			450300 : '桂林市',
			450400 : '梧州市',
			450500 : '北海市',
			450600 : '防城港市',
			450700 : '钦州市',
			450800 : '贵港市',
			450900 : '玉林市',
			451000 : '百色市',
			451100 : '贺州市',
			451200 : '河池市',
			451300 : '来宾市',
			451400 : '崇左市'
		},
		450100 : {
			450102 : {
				name : "兴宁区",
				zipcode : "530012"
			},
			450103 : {
				name : "青秀区",
				zipcode : "530022"
			},
			450105 : {
				name : "江南区",
				zipcode : "530031"
			},
			450107 : {
				name : "西乡塘区",
				zipcode : "530001"
			},
			450108 : {
				name : "良庆区",
				zipcode : "530200"
			},
			450109 : {
				name : "邕宁区",
				zipcode : "530200"
			},
			450110 : '武鸣区',
			450123 : {
				name : "隆安县",
				zipcode : "532700"
			},
			450124 : {
				name : "马山县",
				zipcode : "530600"
			},
			450125 : {
				name : "上林县",
				zipcode : "530500"
			},
			450126 : {
				name : "宾阳县",
				zipcode : "530400"
			},
			450127 : {
				name : "横县",
				zipcode : "530300"
			}
		},
		450200 : {
			450202 : {
				name : "城中区",
				zipcode : "545001"
			},
			450203 : {
				name : "鱼峰区",
				zipcode : "545005"
			},
			450204 : {
				name : "柳南区",
				zipcode : "545005"
			},
			450205 : {
				name : "柳北区",
				zipcode : "545001"
			},
			450221 : {
				name : "柳江县",
				zipcode : "545100"
			},
			450222 : {
				name : "柳城县",
				zipcode : "545200"
			},
			450223 : {
				name : "鹿寨县",
				zipcode : "545600"
			},
			450224 : {
				name : "融安县",
				zipcode : "545400"
			},
			450225 : {
				name : "融水苗族自治县",
				zipcode : "545300"
			},
			450226 : {
				name : "三江侗族自治县",
				zipcode : "545500"
			}
		},
		450300 : {
			450302 : {
				name : "秀峰区",
				zipcode : "541001"
			},
			450303 : {
				name : "叠彩区",
				zipcode : "541001"
			},
			450304 : {
				name : "象山区",
				zipcode : "541002"
			},
			450305 : {
				name : "七星区",
				zipcode : "541004"
			},
			450311 : {
				name : "雁山区",
				zipcode : "541006"
			},
			450312 : '临桂区',
			450321 : {
				name : "阳朔县",
				zipcode : "541900"
			},
			450323 : {
				name : "灵川县",
				zipcode : "541200"
			},
			450324 : {
				name : "全州县",
				zipcode : "541500"
			},
			450325 : {
				name : "兴安县",
				zipcode : "541300"
			},
			450326 : {
				name : "永福县",
				zipcode : "541800"
			},
			450327 : {
				name : "灌阳县",
				zipcode : "541600"
			},
			450328 : {
				name : "龙胜各族自治县",
				zipcode : "541700"
			},
			450329 : {
				name : "资源县",
				zipcode : "541400"
			},
			450330 : {
				name : "平乐县",
				zipcode : "542400"
			},
			450331 : {
				name : "荔浦县",
				zipcode : "546600"
			},
			450332 : {
				name : "恭城瑶族自治县",
				zipcode : "542500"
			}
		},
		450400 : {
			450403 : {
				name : "万秀区",
				zipcode : "543000"
			},
			450405 : {
				name : "长洲区",
				zipcode : "543002"
			},
			450406 : '龙圩区',
			450421 : {
				name : "苍梧县",
				zipcode : "543100"
			},
			450422 : {
				name : "藤县",
				zipcode : "543300"
			},
			450423 : {
				name : "蒙山县",
				zipcode : "546700"
			},
			450481 : {
				name : "岑溪市",
				zipcode : "543200"
			}
		},
		450500 : {
			450502 : {
				name : "海城区",
				zipcode : "536000"
			},
			450503 : {
				name : "银海区",
				zipcode : "536000"
			},
			450512 : {
				name : "铁山港区",
				zipcode : "536017"
			},
			450521 : {
				name : "合浦县",
				zipcode : "536100"
			}
		},
		450600 : {
			450602 : {
				name : "港口区",
				zipcode : "538001"
			},
			450603 : {
				name : "防城区",
				zipcode : "538021"
			},
			450621 : {
				name : "上思县",
				zipcode : "535500"
			},
			450681 : {
				name : "东兴市",
				zipcode : "538100"
			}
		},
		450700 : {
			450702 : {
				name : "钦南区",
				zipcode : "535000"
			},
			450703 : {
				name : "钦北区",
				zipcode : "535000"
			},
			450721 : {
				name : "灵山县",
				zipcode : "535400"
			},
			450722 : {
				name : "浦北县",
				zipcode : "535300"
			}
		},
		450800 : {
			450802 : {
				name : "港北区",
				zipcode : "537100"
			},
			450803 : {
				name : "港南区",
				zipcode : "537132"
			},
			450804 : {
				name : "覃塘区",
				zipcode : "537121"
			},
			450821 : {
				name : "平南县",
				zipcode : "537300"
			},
			450881 : {
				name : "桂平市",
				zipcode : "537200"
			}
		},
		450900 : {
			450902 : {
				name : "玉州区",
				zipcode : "537000"
			},
			450903 : '福绵区',
			450921 : {
				name : "容县",
				zipcode : "537500"
			},
			450922 : {
				name : "陆川县",
				zipcode : "537700"
			},
			450923 : {
				name : "博白县",
				zipcode : "537600"
			},
			450924 : {
				name : "兴业县",
				zipcode : "537800"
			},
			450981 : {
				name : "北流市",
				zipcode : "537400"
			}
		},
		451000 : {
			451002 : {
				name : "右江区",
				zipcode : "533000"
			},
			451021 : {
				name : "田阳县",
				zipcode : "533600"
			},
			451022 : {
				name : "田东县",
				zipcode : "531500"
			},
			451023 : {
				name : "平果县",
				zipcode : "531400"
			},
			451024 : {
				name : "德保县",
				zipcode : "533700"
			},
			451025 : {
				name : "靖西县",
				zipcode : "533800"
			},
			451026 : {
				name : "那坡县",
				zipcode : "533900"
			},
			451027 : {
				name : "凌云县",
				zipcode : "533100"
			},
			451028 : {
				name : "乐业县",
				zipcode : "533200"
			},
			451029 : {
				name : "田林县",
				zipcode : "533300"
			},
			451030 : {
				name : "西林县",
				zipcode : "533500"
			},
			451031 : {
				name : "隆林各族自治县",
				zipcode : "533400"
			}
		},
		451100 : {
			451102 : {
				name : "八步区",
				zipcode : "542800"
			},
			451121 : {
				name : "昭平县",
				zipcode : "546800"
			},
			451122 : {
				name : "钟山县",
				zipcode : "542600"
			},
			451123 : {
				name : "富川瑶族自治县",
				zipcode : "542700"
			}
		},
		451200 : {
			451202 : {
				name : "金城江区",
				zipcode : "547000"
			},
			451221 : {
				name : "南丹县",
				zipcode : "547200"
			},
			451222 : {
				name : "天峨县",
				zipcode : "547300"
			},
			451223 : {
				name : "凤山县",
				zipcode : "547600"
			},
			451224 : {
				name : "东兰县",
				zipcode : "547400"
			},
			451225 : {
				name : "罗城仫佬族自治县",
				zipcode : "546400"
			},
			451226 : {
				name : "环江毛南族自治县",
				zipcode : "547100"
			},
			451227 : {
				name : "巴马瑶族自治县",
				zipcode : "547500"
			},
			451228 : {
				name : "都安瑶族自治县",
				zipcode : "530700"
			},
			451229 : {
				name : "大化瑶族自治县",
				zipcode : "530800"
			},
			451281 : {
				name : "宜州市",
				zipcode : "546300"
			}
		},
		451300 : {
			451302 : {
				name : "兴宾区",
				zipcode : "546100"
			},
			451321 : {
				name : "忻城县",
				zipcode : "546200"
			},
			451322 : {
				name : "象州县",
				zipcode : "545800"
			},
			451323 : {
				name : "武宣县",
				zipcode : "545900"
			},
			451324 : {
				name : "金秀瑶族自治县",
				zipcode : "545700"
			},
			451381 : {
				name : "合山市",
				zipcode : "546500"
			}
		},
		451400 : {
			451402 : {
				name : "江州区",
				zipcode : "000000"
			},
			451421 : {
				name : "扶绥县",
				zipcode : "532100"
			},
			451422 : {
				name : "宁明县",
				zipcode : "532500"
			},
			451423 : {
				name : "龙州县",
				zipcode : "532400"
			},
			451424 : {
				name : "大新县",
				zipcode : "532300"
			},
			451425 : {
				name : "天等县",
				zipcode : "532800"
			},
			451481 : {
				name : "凭祥市",
				zipcode : "532600"
			}
		},
		460000 : {
			460100 : '海口市',
			460200 : {
				name : "三亚市",
				zipcode : "572000"
			},
			460300 : '三沙市',
			460400 : {
				name : "儋州市",
				zipcode : "571700"
			},
			469001 : {
				name : "五指山市",
				zipcode : "572200"
			},
			469002 : {
				name : "琼海市",
				zipcode : "571400"
			},
			469005 : {
				name : "文昌市",
				zipcode : "571300"
			},
			469006 : {
				name : "万宁市",
				zipcode : "571500"
			},
			469007 : {
				name : "东方市",
				zipcode : "572600"
			},
			469021 : {
				name : "定安县",
				zipcode : "571200"
			},
			469022 : {
				name : "屯昌县",
				zipcode : "571600"
			},
			469023 : {
				name : "澄迈县",
				zipcode : "571900"
			},
			469024 : {
				name : "临高县",
				zipcode : "571800"
			},
			469025 : {
				name : "白沙黎族自治县",
				zipcode : "572800"
			},
			469026 : {
				name : "昌江黎族自治县",
				zipcode : "572700"
			},
			469027 : {
				name : "乐东黎族自治县",
				zipcode : "572500"
			},
			469028 : {
				name : "陵水黎族自治县",
				zipcode : "572400"
			},
			469029 : {
				name : "保亭黎族苗族自治县",
				zipcode : "572300"
			},
			469030 : {
				name : "琼中黎族苗族自治县",
				zipcode : "572900"
			}
		},
		460100 : {
			460105 : {
				name : "秀英区",
				zipcode : "570311"
			},
			460106 : {
				name : "龙华区",
				zipcode : "570105"
			},
			460107 : {
				name : "琼山区",
				zipcode : "571100"
			},
			460108 : {
				name : "美兰区",
				zipcode : "570203"
			}
		},
		460200 : {
			460200 : {
				name : "三亚湾",
				zipcode : "000000"
			},
			460202 : {
				name : "海棠区",
				zipcode : "000000"
			},
			460203 : {
				name : "吉阳区",
				zipcode : "000000"
			},
			460204 : {
				name : "天涯区",
				zipcode : "000000"
			},
			460205 : {
				name : "崖州区",
				zipcode : "000000"
			}
		},
		460300 : {
			460321 : {
				name : "西沙群岛",
				zipcode : "000000"
			},
			460322 : {
				name : "南沙群岛",
				zipcode : "000000"
			},
			460323 : {
				name : "中沙群岛的岛礁及其海域",
				zipcode : "000000"
			}
		},
		500000 : {
			500100 : '重庆市',
		},
		500100 : {
			500101 : {
				name : "万州区",
				zipcode : "404100"
			},
			500102 : {
				name : "涪陵区",
				zipcode : "408000"
			},
			500103 : {
				name : "渝中区",
				zipcode : "400010"
			},
			500104 : {
				name : "大渡口区",
				zipcode : "400080"
			},
			500105 : {
				name : "江北区",
				zipcode : "400020"
			},
			500106 : {
				name : "沙坪坝区",
				zipcode : "400030"
			},
			500107 : {
				name : "九龙坡区",
				zipcode : "400050"
			},
			500108 : {
				name : "南岸区",
				zipcode : "400064"
			},
			500109 : {
				name : "北碚区",
				zipcode : "400700"
			},
			500110 : '綦江区',
			500111 : '大足区',
			500112 : {
				name : "渝北区",
				zipcode : "401120"
			},
			500113 : {
				name : "巴南区",
				zipcode : "401320"
			},
			500114 : {
				name : "黔江区",
				zipcode : "409700"
			},
			500115 : {
				name : "长寿区",
				zipcode : "401220"
			},
			500116 : {
				name : "江津区",
				zipcode : "402260"
			},
			500117 : {
				name : "合川区",
				zipcode : "401520"
			},
			500118 : {
				name : "永川区",
				zipcode : "402160"
			},
			500119 : {
				name : "南川区",
				zipcode : "408400"
			},
			500120 : {
				name : "璧山区",
				zipcode : "000000"
			},
			500151 : {
				name : "铜梁区",
				zipcode : "000000"
			},
			500223 : {
				name : "潼南区",
				zipcode : "000000"
			},
			500226 : {
				name : "荣昌区",
				zipcode : "000000"
			},
			500228 : {
				name : "梁平县",
				zipcode : "405200"
			},
			500229 : {
				name : "城口县",
				zipcode : "405900"
			},
			500230 : {
				name : "丰都县",
				zipcode : "408200"
			},
			500231 : {
				name : "垫江县",
				zipcode : "408300"
			},
			500232 : {
				name : "武隆县",
				zipcode : "408500"
			},
			500233 : {
				name : "忠县",
				zipcode : "404300"
			},
			500234 : {
				name : "开县",
				zipcode : "405400"
			},
			500235 : {
				name : "云阳县",
				zipcode : "404500"
			},
			500236 : {
				name : "奉节县",
				zipcode : "404600"
			},
			500237 : {
				name : "巫山县",
				zipcode : "404700"
			},
			500238 : {
				name : "巫溪县",
				zipcode : "405800"
			},
			500240 : {
				name : "石柱土家族自治县",
				zipcode : "409100"
			},
			500241 : {
				name : "秀山土家族苗族自治县",
				zipcode : "409900"
			},
			500242 : {
				name : "酉阳土家族苗族自治县",
				zipcode : "409800"
			},
			500243 : {
				name : "彭水苗族土家族自治县",
				zipcode : "409600"
			}
		},
		510000 : {
			510100 : '成都市',
			510300 : '自贡市',
			510400 : '攀枝花市',
			510500 : '泸州市',
			510600 : '德阳市',
			510700 : '绵阳市',
			510800 : '广元市',
			510900 : '遂宁市',
			511000 : '内江市',
			511100 : '乐山市',
			511300 : '南充市',
			511400 : '眉山市',
			511500 : '宜宾市',
			511600 : '广安市',
			511700 : '达州市',
			511800 : '雅安市',
			511900 : '巴中市',
			512000 : '资阳市',
			513200 : '阿坝藏族羌族自治州',
			513300 : '甘孜藏族自治州',
			513400 : '凉山彝族自治州'
		},
		510100 : {
			510104 : {
				name : "锦江区",
				zipcode : "610021"
			},
			510105 : {
				name : "青羊区",
				zipcode : "610031"
			},
			510106 : {
				name : "金牛区",
				zipcode : "610036"
			},
			510107 : {
				name : "武侯区",
				zipcode : "610041"
			},
			510108 : {
				name : "成华区",
				zipcode : "610066"
			},
			510112 : {
				name : "龙泉驿区",
				zipcode : "610100"
			},
			510113 : {
				name : "青白江区",
				zipcode : "610300"
			},
			510114 : {
				name : "新都区",
				zipcode : "610500"
			},
			510115 : {
				name : "温江区",
				zipcode : "611130"
			},
			510121 : {
				name : "金堂县",
				zipcode : "610400"
			},
			510122 : {
				name : "双流县",
				zipcode : "610200"
			},
			510124 : {
				name : "郫县",
				zipcode : "611700"
			},
			510129 : {
				name : "大邑县",
				zipcode : "611300"
			},
			510131 : {
				name : "蒲江县",
				zipcode : "611630"
			},
			510132 : {
				name : "新津县",
				zipcode : "611430"
			},
			510181 : {
				name : "都江堰市",
				zipcode : "611830"
			},
			510182 : {
				name : "彭州市",
				zipcode : "611930"
			},
			510183 : {
				name : "邛崃市",
				zipcode : "611530"
			},
			510184 : {
				name : "崇州市",
				zipcode : "611230"
			}
		},
		510300 : {
			510302 : {
				name : "自流井区",
				zipcode : "643000"
			},
			510303 : {
				name : "贡井区",
				zipcode : "643020"
			},
			510304 : {
				name : "大安区",
				zipcode : "643010"
			},
			510311 : {
				name : "沿滩区",
				zipcode : "643030"
			},
			510321 : {
				name : "荣县",
				zipcode : "643100"
			},
			510322 : {
				name : "富顺县",
				zipcode : "643200"
			}
		},
		510400 : {
			510402 : {
				name : "东区",
				zipcode : "617067"
			},
			510403 : {
				name : "西区",
				zipcode : "617068"
			},
			510411 : {
				name : "仁和区",
				zipcode : "617061"
			},
			510421 : {
				name : "米易县",
				zipcode : "617200"
			},
			510422 : {
				name : "盐边县",
				zipcode : "617100"
			}
		},
		510500 : {
			510502 : {
				name : "江阳区",
				zipcode : "646000"
			},
			510503 : {
				name : "纳溪区",
				zipcode : "646300"
			},
			510504 : {
				name : "龙马潭区",
				zipcode : "646000"
			},
			510521 : {
				name : "泸县",
				zipcode : "646106"
			},
			510522 : {
				name : "合江县",
				zipcode : "646200"
			},
			510524 : {
				name : "叙永县",
				zipcode : "646400"
			},
			510525 : {
				name : "古蔺县",
				zipcode : "646500"
			}
		},
		510600 : {
			510603 : {
				name : "旌阳区",
				zipcode : "618000"
			},
			510623 : {
				name : "中江县",
				zipcode : "618100"
			},
			510626 : {
				name : "罗江县",
				zipcode : "618500"
			},
			510681 : {
				name : "广汉市",
				zipcode : "618300"
			},
			510682 : {
				name : "什邡市",
				zipcode : "618400"
			},
			510683 : {
				name : "绵竹市",
				zipcode : "618200"
			}
		},
		510700 : {
			510703 : {
				name : "涪城区",
				zipcode : "621000"
			},
			510704 : {
				name : "游仙区",
				zipcode : "621022"
			},
			510722 : {
				name : "三台县",
				zipcode : "621100"
			},
			510723 : {
				name : "盐亭县",
				zipcode : "621600"
			},
			510724 : {
				name : "安县",
				zipcode : "622650"
			},
			510725 : {
				name : "梓潼县",
				zipcode : "622150"
			},
			510726 : {
				name : "北川羌族自治县",
				zipcode : "622750"
			},
			510727 : {
				name : "平武县",
				zipcode : "622550"
			},
			510781 : {
				name : "江油市",
				zipcode : "621700"
			}
		},
		510800 : {
			510802 : {
				name : "利州区",
				zipcode : "628017"
			},
			510811 : '昭化区',
			510812 : {
				name : "朝天区",
				zipcode : "628017"
			},
			510821 : {
				name : "旺苍县",
				zipcode : "628200"
			},
			510822 : {
				name : "青川县",
				zipcode : "628100"
			},
			510823 : {
				name : "剑阁县",
				zipcode : "628300"
			},
			510824 : {
				name : "苍溪县",
				zipcode : "628400"
			}
		},
		510900 : {
			510903 : {
				name : "船山区",
				zipcode : "629000"
			},
			510904 : {
				name : "安居区",
				zipcode : "629000"
			},
			510921 : {
				name : "蓬溪县",
				zipcode : "629100"
			},
			510922 : {
				name : "射洪县",
				zipcode : "629200"
			},
			510923 : {
				name : "大英县",
				zipcode : "629300"
			}
		},
		511000 : {
			511002 : {
				name : "市中区",
				zipcode : "272133"
			},
			511011 : {
				name : "东兴区",
				zipcode : "641100"
			},
			511024 : {
				name : "威远县",
				zipcode : "642450"
			},
			511025 : {
				name : "资中县",
				zipcode : "641200"
			},
			511028 : {
				name : "隆昌县",
				zipcode : "642150"
			}
		},
		511100 : {
			511102 : {
				name : "市中区",
				zipcode : "641000"
			},
			511111 : {
				name : "沙湾区",
				zipcode : "614900"
			},
			511112 : {
				name : "五通桥区",
				zipcode : "614800"
			},
			511113 : {
				name : "金口河区",
				zipcode : "614700"
			},
			511123 : {
				name : "犍为县",
				zipcode : "614400"
			},
			511124 : {
				name : "井研县",
				zipcode : "613100"
			},
			511126 : {
				name : "夹江县",
				zipcode : "614100"
			},
			511129 : {
				name : "沐川县",
				zipcode : "614500"
			},
			511132 : {
				name : "峨边彝族自治县",
				zipcode : "614300"
			},
			511133 : {
				name : "马边彝族自治县",
				zipcode : "614600"
			},
			511181 : {
				name : "峨眉山市",
				zipcode : "614200"
			}
		},
		511300 : {
			511302 : {
				name : "顺庆区",
				zipcode : "637000"
			},
			511303 : {
				name : "高坪区",
				zipcode : "637100"
			},
			511304 : {
				name : "嘉陵区",
				zipcode : "637100"
			},
			511321 : {
				name : "南部县",
				zipcode : "637300"
			},
			511322 : {
				name : "营山县",
				zipcode : "637700"
			},
			511323 : {
				name : "蓬安县",
				zipcode : "637800"
			},
			511324 : {
				name : "仪陇县",
				zipcode : "637600"
			},
			511325 : {
				name : "西充县",
				zipcode : "637200"
			},
			511381 : {
				name : "阆中市",
				zipcode : "637400"
			}
		},
		511400 : {
			511402 : {
				name : "东坡区",
				zipcode : "620010"
			},
			511403 : '彭山区',
			511421 : {
				name : "仁寿县",
				zipcode : "620500"
			},
			511423 : {
				name : "洪雅县",
				zipcode : "620360"
			},
			511424 : {
				name : "丹棱县",
				zipcode : "620200"
			},
			511425 : {
				name : "青神县",
				zipcode : "620460"
			}
		},
		511500 : {
			511502 : {
				name : "翠屏区",
				zipcode : "644000"
			},
			511503 : '南溪区',
			511521 : {
				name : "宜宾县",
				zipcode : "644600"
			},
			511523 : {
				name : "江安县",
				zipcode : "644200"
			},
			511524 : {
				name : "长宁县",
				zipcode : "644300"
			},
			511525 : {
				name : "高县",
				zipcode : "645150"
			},
			511526 : {
				name : "珙县",
				zipcode : "644500"
			},
			511527 : {
				name : "筠连县",
				zipcode : "645250"
			},
			511528 : {
				name : "兴文县",
				zipcode : "644400"
			},
			511529 : {
				name : "屏山县",
				zipcode : "645350"
			}
		},
		511600 : {
			511602 : {
				name : "广安区",
				zipcode : "638000"
			},
			511603 : '前锋区',
			511621 : {
				name : "岳池县",
				zipcode : "638300"
			},
			511622 : {
				name : "武胜县",
				zipcode : "638400"
			},
			511623 : {
				name : "邻水县",
				zipcode : "638500"
			},
			511681 : {
				name : "华蓥市",
				zipcode : "638600"
			}
		},
		511700 : {
			511702 : {
				name : "通川区",
				zipcode : "635000"
			},
			511703 : '达川区',
			511722 : {
				name : "宣汉县",
				zipcode : "636150"
			},
			511723 : {
				name : "开江县",
				zipcode : "636250"
			},
			511724 : {
				name : "大竹县",
				zipcode : "635100"
			},
			511725 : {
				name : "渠县",
				zipcode : "635200"
			},
			511781 : {
				name : "万源市",
				zipcode : "636350"
			}
		},
		511800 : {
			511802 : {
				name : "雨城区",
				zipcode : "625000"
			},
			511803 : '名山区',
			511822 : {
				name : "荥经县",
				zipcode : "625200"
			},
			511823 : {
				name : "汉源县",
				zipcode : "625300"
			},
			511824 : {
				name : "石棉县",
				zipcode : "625400"
			},
			511825 : {
				name : "天全县",
				zipcode : "625500"
			},
			511826 : {
				name : "芦山县",
				zipcode : "625600"
			},
			511827 : {
				name : "宝兴县",
				zipcode : "625700"
			}
		},
		511900 : {
			511902 : {
				name : "巴州区",
				zipcode : "636001"
			},
			511903 : '恩阳区',
			511921 : {
				name : "通江县",
				zipcode : "636700"
			},
			511922 : {
				name : "南江县",
				zipcode : "636600"
			},
			511923 : {
				name : "平昌县",
				zipcode : "636400"
			}
		},
		512000 : {
			512002 : {
				name : "雁江区",
				zipcode : "641300"
			},
			512021 : {
				name : "安岳县",
				zipcode : "642350"
			},
			512022 : {
				name : "乐至县",
				zipcode : "641500"
			},
			512081 : {
				name : "简阳市",
				zipcode : "641400"
			}
		},
		513200 : {
			513221 : {
				name : "汶川县",
				zipcode : "623000"
			},
			513222 : {
				name : "理县",
				zipcode : "623100"
			},
			513223 : {
				name : "茂县",
				zipcode : "623200"
			},
			513224 : {
				name : "松潘县",
				zipcode : "623300"
			},
			513225 : {
				name : "九寨沟县",
				zipcode : "623400"
			},
			513226 : {
				name : "金川县",
				zipcode : "624100"
			},
			513227 : {
				name : "小金县",
				zipcode : "624200"
			},
			513228 : {
				name : "黑水县",
				zipcode : "623500"
			},
			513229 : {
				name : "马尔康县",
				zipcode : "624000"
			},
			513230 : {
				name : "壤塘县",
				zipcode : "624300"
			},
			513231 : {
				name : "阿坝县",
				zipcode : "624600"
			},
			513232 : {
				name : "若尔盖县",
				zipcode : "624500"
			},
			513233 : {
				name : "红原县",
				zipcode : "624400"
			}
		},
		513300 : {
			513301 : '康定市',
			513322 : {
				name : "泸定县",
				zipcode : "626100"
			},
			513323 : {
				name : "丹巴县",
				zipcode : "626300"
			},
			513324 : {
				name : "九龙县",
				zipcode : "626200"
			},
			513325 : {
				name : "雅江县",
				zipcode : "627450"
			},
			513326 : {
				name : "道孚县",
				zipcode : "626400"
			},
			513327 : {
				name : "炉霍县",
				zipcode : "626500"
			},
			513328 : {
				name : "甘孜县",
				zipcode : "626700"
			},
			513329 : {
				name : "新龙县",
				zipcode : "626800"
			},
			513330 : {
				name : "德格县",
				zipcode : "627250"
			},
			513331 : {
				name : "白玉县",
				zipcode : "200000"
			},
			513332 : {
				name : "石渠县",
				zipcode : "200000"
			},
			513333 : {
				name : "色达县",
				zipcode : "201100"
			},
			513334 : {
				name : "理塘县",
				zipcode : "200000"
			},
			513335 : {
				name : "巴塘县",
				zipcode : "200120"
			},
			513336 : {
				name : "乡城县",
				zipcode : "200000"
			},
			513337 : {
				name : "稻城县",
				zipcode : "200000"
			},
			513338 : {
				name : "得荣县",
				zipcode : "200000"
			}
		},
		513400 : {
			513401 : {
				name : "西昌市",
				zipcode : "200000"
			},
			513422 : {
				name : "木里藏族自治县",
				zipcode : "200000"
			},
			513423 : {
				name : "盐源县",
				zipcode : "200000"
			},
			513424 : {
				name : "德昌县",
				zipcode : "201300"
			},
			513425 : {
				name : "会理县",
				zipcode : "201600"
			},
			513426 : {
				name : "会东县",
				zipcode : "201800"
			},
			513427 : {
				name : "宁南县",
				zipcode : "201900"
			},
			513428 : {
				name : "普格县",
				zipcode : "201700"
			},
			513429 : {
				name : "布拖县",
				zipcode : "201500"
			},
			513430 : {
				name : "金阳县",
				zipcode : "201400"
			},
			513431 : {
				name : "昭觉县",
				zipcode : "202150"
			},
			513432 : {
				name : "喜德县",
				zipcode : "616750"
			},
			513433 : {
				name : "冕宁县",
				zipcode : "615600"
			},
			513434 : {
				name : "越西县",
				zipcode : "616650"
			},
			513435 : {
				name : "甘洛县",
				zipcode : "616850"
			},
			513436 : {
				name : "美姑县",
				zipcode : "616450"
			},
			513437 : {
				name : "雷波县",
				zipcode : "616550"
			}
		},
		520000 : {
			520100 : '贵阳市',
			520200 : '六盘水市',
			520300 : '遵义市',
			520400 : '安顺市',
			520500 : '毕节市',
			520600 : '铜仁市',
			522300 : '黔西南布依族苗族自治州',
			522600 : '黔东南苗族侗族自治州',
			522700 : '黔南布依族苗族自治州'
		},
		520100 : {
			520102 : {
				name : "南明区",
				zipcode : "550001"
			},
			520103 : {
				name : "云岩区",
				zipcode : "550001"
			},
			520111 : {
				name : "花溪区",
				zipcode : "550025"
			},
			520112 : {
				name : "乌当区",
				zipcode : "550018"
			},
			520113 : {
				name : "白云区",
				zipcode : "550014"
			},
			520115 : '观山湖区',
			520121 : {
				name : "开阳县",
				zipcode : "550300"
			},
			520122 : {
				name : "息烽县",
				zipcode : "551100"
			},
			520123 : {
				name : "修文县",
				zipcode : "550200"
			},
			520181 : {
				name : "清镇市",
				zipcode : "551400"
			}
		},
		520200 : {
			520201 : {
				name : "钟山区",
				zipcode : "553000"
			},
			520203 : {
				name : "六枝特区",
				zipcode : "553400"
			},
			520221 : {
				name : "水城县",
				zipcode : "553000"
			},
			520222 : {
				name : "盘县",
				zipcode : "561601"
			}
		},
		520300 : {
			520302 : {
				name : "红花岗区",
				zipcode : "563000"
			},
			520303 : {
				name : "汇川区",
				zipcode : "563000"
			},
			520321 : {
				name : "遵义县",
				zipcode : "563100"
			},
			520322 : {
				name : "桐梓县",
				zipcode : "563200"
			},
			520323 : {
				name : "绥阳县",
				zipcode : "563300"
			},
			520324 : {
				name : "正安县",
				zipcode : "563400"
			},
			520325 : {
				name : "道真仡佬族苗族自治县",
				zipcode : "563500"
			},
			520326 : {
				name : "务川仡佬族苗族自治县",
				zipcode : "564300"
			},
			520327 : {
				name : "凤冈县",
				zipcode : "564200"
			},
			520328 : {
				name : "湄潭县",
				zipcode : "564100"
			},
			520329 : {
				name : "余庆县",
				zipcode : "564400"
			},
			520330 : {
				name : "习水县",
				zipcode : "564600"
			},
			520381 : {
				name : "赤水市",
				zipcode : "564700"
			},
			520382 : {
				name : "仁怀市",
				zipcode : "564500"
			}
		},
		520400 : {
			520402 : {
				name : "西秀区",
				zipcode : "561000"
			},
			520403 : '平坝区',
			520422 : {
				name : "普定县",
				zipcode : "562100"
			},
			520423 : {
				name : "镇宁布依族苗族自治县",
				zipcode : "561200"
			},
			520424 : {
				name : "关岭布依族苗族自治县",
				zipcode : "561300"
			},
			520425 : {
				name : "紫云苗族布依族自治县",
				zipcode : "550800"
			}
		},
		520500 : {
			520502 : {
				name : "七星关区",
				zipcode : "000000"
			},
			520521 : {
				name : "大方县",
				zipcode : "551600"
			},
			520522 : {
				name : "黔西县",
				zipcode : "551500"
			},
			520523 : {
				name : "金沙县",
				zipcode : "551800"
			},
			520524 : {
				name : "织金县",
				zipcode : "552100"
			},
			520525 : {
				name : "纳雍县",
				zipcode : "553300"
			},
			520526 : {
				name : "威宁彝族回族苗族自治县",
				zipcode : "553100"
			},
			520527 : {
				name : "赫章县",
				zipcode : "553200"
			}
		},
		520600 : {
			520602 : {
				name : "碧江区",
				zipcode : "000000"
			},
			520603 : {
				name : "万山区",
				zipcode : "000000"
			},
			520621 : {
				name : "江口县",
				zipcode : "554400"
			},
			520622 : {
				name : "玉屏侗族自治县",
				zipcode : "554004"
			},
			520623 : {
				name : "石阡县",
				zipcode : "555100"
			},
			520624 : {
				name : "思南县",
				zipcode : "565100"
			},
			520625 : {
				name : "印江土家族苗族自治县",
				zipcode : "555200"
			},
			520626 : {
				name : "德江县",
				zipcode : "565200"
			},
			520627 : {
				name : "沿河土家族自治县",
				zipcode : "565300"
			},
			520628 : {
				name : "松桃苗族自治县",
				zipcode : "554100"
			}
		},
		522300 : {
			522301 : {
				name : "兴义市",
				zipcode : "562400"
			},
			522322 : {
				name : "兴仁县",
				zipcode : "562300"
			},
			522323 : {
				name : "普安县",
				zipcode : "561500"
			},
			522324 : {
				name : "晴隆县",
				zipcode : "561400"
			},
			522325 : {
				name : "贞丰县",
				zipcode : "562200"
			},
			522326 : {
				name : "望谟县",
				zipcode : "552300"
			},
			522327 : {
				name : "册亨县",
				zipcode : "552200"
			},
			522328 : {
				name : "安龙县",
				zipcode : "552400"
			}
		},
		522600 : {
			522601 : {
				name : "凯里市",
				zipcode : "556000"
			},
			522622 : {
				name : "黄平县",
				zipcode : "556100"
			},
			522623 : {
				name : "施秉县",
				zipcode : "556200"
			},
			522624 : {
				name : "三穗县",
				zipcode : "556500"
			},
			522625 : {
				name : "镇远县",
				zipcode : "557700"
			},
			522626 : {
				name : "岑巩县",
				zipcode : "557800"
			},
			522627 : {
				name : "天柱县",
				zipcode : "556600"
			},
			522628 : {
				name : "锦屏县",
				zipcode : "556700"
			},
			522629 : {
				name : "剑河县",
				zipcode : "556400"
			},
			522630 : {
				name : "台江县",
				zipcode : "556300"
			},
			522631 : {
				name : "黎平县",
				zipcode : "557300"
			},
			522632 : {
				name : "榕江县",
				zipcode : "557200"
			},
			522633 : {
				name : "从江县",
				zipcode : "557400"
			},
			522634 : {
				name : "雷山县",
				zipcode : "557100"
			},
			522635 : {
				name : "麻江县",
				zipcode : "557600"
			},
			522636 : {
				name : "丹寨县",
				zipcode : "557500"
			}
		},
		522700 : {
			522701 : {
				name : "都匀市",
				zipcode : "558000"
			},
			522702 : {
				name : "福泉市",
				zipcode : "550500"
			},
			522722 : {
				name : "荔波县",
				zipcode : "558400"
			},
			522723 : {
				name : "贵定县",
				zipcode : "551300"
			},
			522725 : {
				name : "瓮安县",
				zipcode : "550400"
			},
			522726 : {
				name : "独山县",
				zipcode : "558200"
			},
			522727 : {
				name : "平塘县",
				zipcode : "558300"
			},
			522728 : {
				name : "罗甸县",
				zipcode : "550100"
			},
			522729 : {
				name : "长顺县",
				zipcode : "550700"
			},
			522730 : {
				name : "龙里县",
				zipcode : "551200"
			},
			522731 : {
				name : "惠水县",
				zipcode : "550600"
			},
			522732 : {
				name : "三都水族自治县",
				zipcode : "558100"
			}
		},
		530000 : {
			530100 : '昆明市',
			530300 : '曲靖市',
			530400 : '玉溪市',
			530500 : '保山市',
			530600 : '昭通市',
			530700 : '丽江市',
			530800 : '普洱市',
			530900 : '临沧市',
			532300 : '楚雄彝族自治州',
			532500 : '红河哈尼族彝族自治州',
			532600 : '文山壮族苗族自治州',
			532800 : '西双版纳傣族自治州',
			532900 : '大理白族自治州',
			533100 : '德宏傣族景颇族自治州',
			533300 : '怒江傈僳族自治州',
			533400 : '迪庆藏族自治州'
		},
		530100 : {
			530102 : {
				name : "五华区",
				zipcode : "650032"
			},
			530103 : {
				name : "盘龙区",
				zipcode : "650051"
			},
			530111 : {
				name : "官渡区",
				zipcode : "650220"
			},
			530112 : {
				name : "西山区",
				zipcode : "650100"
			},
			530113 : {
				name : "东川区",
				zipcode : "654100"
			},
			530114 : '呈贡区',
			530122 : {
				name : "晋宁县",
				zipcode : "650600"
			},
			530124 : {
				name : "富民县",
				zipcode : "650400"
			},
			530125 : {
				name : "宜良县",
				zipcode : "652100"
			},
			530126 : {
				name : "石林彝族自治县",
				zipcode : "652200"
			},
			530127 : {
				name : "嵩明县",
				zipcode : "651700"
			},
			530128 : {
				name : "禄劝彝族苗族自治县",
				zipcode : "651500"
			},
			530129 : {
				name : "寻甸回族彝族自治县",
				zipcode : "655200"
			},
			530181 : {
				name : "安宁市",
				zipcode : "650300"
			}
		},
		530300 : {
			530302 : {
				name : "麒麟区",
				zipcode : "655000"
			},
			530321 : {
				name : "马龙县",
				zipcode : "655100"
			},
			530322 : {
				name : "陆良县",
				zipcode : "655600"
			},
			530323 : {
				name : "师宗县",
				zipcode : "655700"
			},
			530324 : {
				name : "罗平县",
				zipcode : "655800"
			},
			530325 : {
				name : "富源县",
				zipcode : "655500"
			},
			530326 : {
				name : "会泽县",
				zipcode : "654200"
			},
			530328 : {
				name : "沾益县",
				zipcode : "655331"
			},
			530381 : {
				name : "宣威市",
				zipcode : "655400"
			}
		},
		530400 : {
			530402 : {
				name : "红塔区",
				zipcode : "653100"
			},
			530421 : {
				name : "江川县",
				zipcode : "652600"
			},
			530422 : {
				name : "澄江县",
				zipcode : "652500"
			},
			530423 : {
				name : "通海县",
				zipcode : "652700"
			},
			530424 : {
				name : "华宁县",
				zipcode : "652800"
			},
			530425 : {
				name : "易门县",
				zipcode : "651100"
			},
			530426 : {
				name : "峨山彝族自治县",
				zipcode : "653200"
			},
			530427 : {
				name : "新平彝族傣族自治县",
				zipcode : "653400"
			},
			530428 : {
				name : "元江哈尼族彝族傣族自治县",
				zipcode : "653300"
			}
		},
		530500 : {
			530502 : {
				name : "隆阳区",
				zipcode : "678000"
			},
			530521 : {
				name : "施甸县",
				zipcode : "678200"
			},
			530522 : {
				name : "腾冲县",
				zipcode : "679100"
			},
			530523 : {
				name : "龙陵县",
				zipcode : "678300"
			},
			530524 : {
				name : "昌宁县",
				zipcode : "678100"
			}
		},
		530600 : {
			530602 : {
				name : "昭阳区",
				zipcode : "657000"
			},
			530621 : {
				name : "鲁甸县",
				zipcode : "657100"
			},
			530622 : {
				name : "巧家县",
				zipcode : "654600"
			},
			530623 : {
				name : "盐津县",
				zipcode : "657500"
			},
			530624 : {
				name : "大关县",
				zipcode : "657400"
			},
			530625 : {
				name : "永善县",
				zipcode : "657300"
			},
			530626 : {
				name : "绥江县",
				zipcode : "657700"
			},
			530627 : {
				name : "镇雄县",
				zipcode : "657200"
			},
			530628 : {
				name : "彝良县",
				zipcode : "657600"
			},
			530629 : {
				name : "威信县",
				zipcode : "657900"
			},
			530630 : {
				name : "水富县",
				zipcode : "657800"
			}
		},
		530700 : {
			530702 : {
				name : "古城区",
				zipcode : "674100"
			},
			530721 : {
				name : "玉龙纳西族自治县",
				zipcode : "674100"
			},
			530722 : {
				name : "永胜县",
				zipcode : "674200"
			},
			530723 : {
				name : "华坪县",
				zipcode : "674800"
			},
			530724 : {
				name : "宁蒗彝族自治县",
				zipcode : "674300"
			}
		},
		530800 : {
			530802 : {
				name : "思茅区",
				zipcode : "665000"
			},
			530821 : {
				name : "宁洱哈尼族彝族自治县",
				zipcode : "665100"
			},
			530822 : {
				name : "墨江哈尼族自治县",
				zipcode : "654800"
			},
			530823 : {
				name : "景东彝族自治县",
				zipcode : "676200"
			},
			530824 : {
				name : "景谷傣族彝族自治县",
				zipcode : "666400"
			},
			530825 : {
				name : "镇沅彝族哈尼族拉祜族自治县",
				zipcode : "666500"
			},
			530826 : {
				name : "江城哈尼族彝族自治县",
				zipcode : "665900"
			},
			530827 : {
				name : "孟连傣族拉祜族佤族自治县",
				zipcode : "665800"
			},
			530828 : {
				name : "澜沧拉祜族自治县",
				zipcode : "665600"
			},
			530829 : {
				name : "西盟佤族自治县",
				zipcode : "665700"
			}
		},
		530900 : {
			530902 : {
				name : "临翔区",
				zipcode : "677000"
			},
			530921 : {
				name : "凤庆县",
				zipcode : "675900"
			},
			530922 : {
				name : "云县",
				zipcode : "675800"
			},
			530923 : {
				name : "永德县",
				zipcode : "677600"
			},
			530924 : {
				name : "镇康县",
				zipcode : "677704"
			},
			530925 : {
				name : "双江拉祜族佤族布朗族傣族自治县",
				zipcode : "677300"
			},
			530926 : {
				name : "耿马傣族佤族自治县",
				zipcode : "677500"
			},
			530927 : {
				name : "沧源佤族自治县",
				zipcode : "677400"
			}
		},
		532300 : {
			532301 : {
				name : "楚雄市",
				zipcode : "675000"
			},
			532322 : {
				name : "双柏县",
				zipcode : "675100"
			},
			532323 : {
				name : "牟定县",
				zipcode : "675500"
			},
			532324 : {
				name : "南华县",
				zipcode : "675200"
			},
			532325 : {
				name : "姚安县",
				zipcode : "675300"
			},
			532326 : {
				name : "大姚县",
				zipcode : "675400"
			},
			532327 : {
				name : "永仁县",
				zipcode : "651400"
			},
			532328 : {
				name : "元谋县",
				zipcode : "651300"
			},
			532329 : {
				name : "武定县",
				zipcode : "651600"
			},
			532331 : {
				name : "禄丰县",
				zipcode : "651200"
			}
		},
		532500 : {
			532501 : {
				name : "个旧市",
				zipcode : "661000"
			},
			532502 : {
				name : "开远市",
				zipcode : "661600"
			},
			532503 : {
				name : "蒙自市",
				zipcode : "000000"
			},
			532504 : {
				name : "弥勒市",
				zipcode : "000000"
			},
			532523 : {
				name : "屏边苗族自治县",
				zipcode : "661200"
			},
			532524 : {
				name : "建水县",
				zipcode : "654300"
			},
			532525 : {
				name : "石屏县",
				zipcode : "662200"
			},
			532527 : {
				name : "泸西县",
				zipcode : "652400"
			},
			532528 : {
				name : "元阳县",
				zipcode : "662400"
			},
			532529 : {
				name : "红河县",
				zipcode : "654400"
			},
			532530 : {
				name : "金平苗族瑶族傣族自治县",
				zipcode : "661500"
			},
			532531 : {
				name : "绿春县",
				zipcode : "662500"
			},
			532532 : {
				name : "河口瑶族自治县",
				zipcode : "661300"
			}
		},
		532600 : {
			532601 : {
				name : "文山市",
				zipcode : "000000"
			},
			532622 : {
				name : "砚山县",
				zipcode : "663100"
			},
			532623 : {
				name : "西畴县",
				zipcode : "663500"
			},
			532624 : {
				name : "麻栗坡县",
				zipcode : "663600"
			},
			532625 : {
				name : "马关县",
				zipcode : "663700"
			},
			532626 : {
				name : "丘北县",
				zipcode : "663200"
			},
			532627 : {
				name : "广南县",
				zipcode : "663300"
			},
			532628 : {
				name : "富宁县",
				zipcode : "663400"
			}
		},
		532800 : {
			532801 : {
				name : "景洪市",
				zipcode : "666100"
			},
			532822 : {
				name : "勐海县",
				zipcode : "666200"
			},
			532823 : {
				name : "勐腊县",
				zipcode : "666300"
			}
		},
		532900 : {
			532901 : {
				name : "大理市",
				zipcode : "671000"
			},
			532922 : {
				name : "漾濞彝族自治县",
				zipcode : "672500"
			},
			532923 : {
				name : "祥云县",
				zipcode : "672100"
			},
			532924 : {
				name : "宾川县",
				zipcode : "671600"
			},
			532925 : {
				name : "弥渡县",
				zipcode : "675600"
			},
			532926 : {
				name : "南涧彝族自治县",
				zipcode : "675700"
			},
			532927 : {
				name : "巍山彝族回族自治县",
				zipcode : "672400"
			},
			532928 : {
				name : "永平县",
				zipcode : "672600"
			},
			532929 : {
				name : "云龙县",
				zipcode : "672700"
			},
			532930 : {
				name : "洱源县",
				zipcode : "671200"
			},
			532931 : {
				name : "剑川县",
				zipcode : "671300"
			},
			532932 : {
				name : "鹤庆县",
				zipcode : "671500"
			}
		},
		533100 : {
			533102 : {
				name : "瑞丽市",
				zipcode : "678600"
			},
			533103 : '芒市',
			533122 : {
				name : "梁河县",
				zipcode : "679200"
			},
			533123 : {
				name : "盈江县",
				zipcode : "679300"
			},
			533124 : {
				name : "陇川县",
				zipcode : "678700"
			}
		},
		533300 : {
			533321 : {
				name : "泸水县",
				zipcode : "673100"
			},
			533323 : {
				name : "福贡县",
				zipcode : "673400"
			},
			533324 : {
				name : "贡山独龙族怒族自治县",
				zipcode : "673500"
			},
			533325 : {
				name : "兰坪白族普米族自治县",
				zipcode : "671400"
			}
		},
		533400 : {
			533401 : {
				name : "香格里拉市",
				zipcode : "000000"
			},
			533422 : {
				name : "德钦县",
				zipcode : "674500"
			},
			533423 : {
				name : "维西傈僳族自治县",
				zipcode : "674600"
			}
		},
		540000 : {
			540100 : '拉萨市',
			540200 : '日喀则市',
			540300 : '昌都市',
			542200 : '山南地区',
			542400 : '那曲地区',
			542500 : '阿里地区',
			542600 : '林芝市'
		},
		540100 : {
			540102 : {
				name : "城关区",
				zipcode : "850000"
			},
			540121 : {
				name : "林周县",
				zipcode : "852000"
			},
			540122 : {
				name : "当雄县",
				zipcode : "851500"
			},
			540123 : {
				name : "尼木县",
				zipcode : "851300"
			},
			540124 : {
				name : "曲水县",
				zipcode : "850600"
			},
			540125 : {
				name : "堆龙德庆县",
				zipcode : "851400"
			},
			540126 : {
				name : "达孜县",
				zipcode : "850100"
			},
			540127 : {
				name : "墨竹工卡县",
				zipcode : "850200"
			}
		},
		540200 : {
			540202 : {
				name : "桑珠孜区",
				zipcode : "857100"
			},
			540221 : {
				name : "南木林县",
				zipcode : "857100"
			},
			540222 : {
				name : "江孜县",
				zipcode : "857400"
			},
			540223 : {
				name : "定日县",
				zipcode : "858200"
			},
			540224 : {
				name : "萨迦县",
				zipcode : "857800"
			},
			540225 : {
				name : "拉孜县",
				zipcode : "858100"
			},
			540226 : {
				name : "昂仁县",
				zipcode : "858500"
			},
			540227 : {
				name : "谢通门县",
				zipcode : "858900"
			},
			540228 : {
				name : "白朗县",
				zipcode : "857300"
			},
			540229 : {
				name : "仁布县",
				zipcode : "857200"
			},
			540230 : {
				name : "康马县",
				zipcode : "857500"
			},
			540231 : {
				name : "定结县",
				zipcode : "857900"
			},
			540232 : {
				name : "仲巴县",
				zipcode : "858800"
			},
			540233 : {
				name : "亚东县",
				zipcode : "857600"
			},
			540234 : {
				name : "吉隆县",
				zipcode : "858700"
			},
			540235 : {
				name : "聂拉木县",
				zipcode : "858300"
			},
			540236 : {
				name : "萨嘎县",
				zipcode : "857800"
			},
			540237 : {
				name : "岗巴县",
				zipcode : "857700"
			}
		},
		540300 : {
			540302 : {
				name : "卡若区",
				zipcode : "000000"
			},
			540321 : {
				name : "江达县",
				zipcode : "854100"
			},
			540322 : {
				name : "贡觉县",
				zipcode : "854200"
			},
			540323 : {
				name : "类乌齐县",
				zipcode : "855600"
			},
			540324 : {
				name : "丁青县",
				zipcode : "855700"
			},
			540325 : {
				name : "察雅县",
				zipcode : "854300"
			},
			540326 : {
				name : "八宿县",
				zipcode : "854600"
			},
			540327 : {
				name : "左贡县",
				zipcode : "854400"
			},
			540328 : {
				name : "芒康县",
				zipcode : "854500"
			},
			540329 : {
				name : "洛隆县",
				zipcode : "855400"
			},
			540330 : {
				name : "边坝县",
				zipcode : "855500"
			}
		},
		542200 : {
			542221 : {
				name : "乃东县",
				zipcode : "856100"
			},
			542222 : {
				name : "扎囊县",
				zipcode : "850800"
			},
			542223 : {
				name : "贡嘎县",
				zipcode : "850700"
			},
			542224 : {
				name : "桑日县",
				zipcode : "856200"
			},
			542225 : {
				name : "琼结县",
				zipcode : "856800"
			},
			542226 : {
				name : "曲松县",
				zipcode : "856300"
			},
			542227 : {
				name : "措美县",
				zipcode : "856900"
			},
			542228 : {
				name : "洛扎县",
				zipcode : "851200"
			},
			542229 : {
				name : "加查县",
				zipcode : "856400"
			},
			542231 : {
				name : "隆子县",
				zipcode : "856600"
			},
			542232 : {
				name : "错那县",
				zipcode : "856700"
			},
			542233 : {
				name : "浪卡子县",
				zipcode : "851000"
			}
		},
		542400 : {
			542421 : {
				name : "那曲县",
				zipcode : "852000"
			},
			542422 : {
				name : "嘉黎县",
				zipcode : "852400"
			},
			542423 : {
				name : "比如县",
				zipcode : "852300"
			},
			542424 : {
				name : "聂荣县",
				zipcode : "853500"
			},
			542425 : {
				name : "安多县",
				zipcode : "852600"
			},
			542426 : {
				name : "申扎县",
				zipcode : "853100"
			},
			542427 : {
				name : "索县",
				zipcode : "852200"
			},
			542428 : {
				name : "班戈县",
				zipcode : "852500"
			},
			542429 : {
				name : "巴青县",
				zipcode : "852100"
			},
			542430 : {
				name : "尼玛县",
				zipcode : "853200"
			},
			542431 : '双湖县'
		},
		542500 : {
			542521 : {
				name : "普兰县",
				zipcode : "859500"
			},
			542522 : {
				name : "札达县",
				zipcode : "859600"
			},
			542523 : {
				name : "噶尔县",
				zipcode : "859400"
			},
			542524 : {
				name : "日土县",
				zipcode : "859700"
			},
			542525 : {
				name : "革吉县",
				zipcode : "859100"
			},
			542526 : {
				name : "改则县",
				zipcode : "859200"
			},
			542527 : {
				name : "措勤县",
				zipcode : "859300"
			}
		},
		542600 : {
			542621 : {
				name : "巴宜区",
				zipcode : "000000"
			},
			542622 : {
				name : "工布江达县",
				zipcode : "850300"
			},
			542623 : {
				name : "米林县",
				zipcode : "860500"
			},
			542624 : {
				name : "墨脱县",
				zipcode : "855300"
			},
			542625 : {
				name : "波密县",
				zipcode : "855200"
			},
			542626 : {
				name : "察隅县",
				zipcode : "855100"
			},
			542627 : {
				name : "朗县",
				zipcode : "856500"
			}
		},
		610000 : {
			610100 : '西安市',
			610200 : '铜川市',
			610300 : '宝鸡市',
			610400 : '咸阳市',
			610500 : '渭南市',
			610600 : '延安市',
			610700 : '汉中市',
			610800 : '榆林市',
			610900 : '安康市',
			611000 : '商洛市'
		},
		610100 : {
			610102 : {
				name : "新城区",
				zipcode : "025350"
			},
			610103 : {
				name : "碑林区",
				zipcode : "710001"
			},
			610104 : {
				name : "莲湖区",
				zipcode : "710003"
			},
			610111 : {
				name : "灞桥区",
				zipcode : "710038"
			},
			610112 : {
				name : "未央区",
				zipcode : "710014"
			},
			610113 : {
				name : "雁塔区",
				zipcode : "710061"
			},
			610114 : {
				name : "阎良区",
				zipcode : "710087"
			},
			610115 : {
				name : "临潼区",
				zipcode : "710600"
			},
			610116 : {
				name : "长安区",
				zipcode : "710100"
			},
			610117 : {
				name : "高陵区",
				zipcode : "000000"
			},
			610122 : {
				name : "蓝田县",
				zipcode : "710500"
			},
			610124 : {
				name : "周至县",
				zipcode : "710400"
			},
			610125 : {
				name : "户县",
				zipcode : "710300"
			}
		},
		610200 : {
			610202 : {
				name : "王益区",
				zipcode : "727000"
			},
			610203 : {
				name : "印台区",
				zipcode : "727007"
			},
			610204 : {
				name : "耀州区",
				zipcode : "727100"
			},
			610222 : {
				name : "宜君县",
				zipcode : "727200"
			}
		},
		610300 : {
			610302 : {
				name : "渭滨区",
				zipcode : "721000"
			},
			610303 : {
				name : "金台区",
				zipcode : "721000"
			},
			610304 : {
				name : "陈仓区",
				zipcode : "721300"
			},
			610322 : {
				name : "凤翔县",
				zipcode : "721400"
			},
			610323 : {
				name : "岐山县",
				zipcode : "722400"
			},
			610324 : {
				name : "扶风县",
				zipcode : "722200"
			},
			610326 : {
				name : "眉县",
				zipcode : "722300"
			},
			610327 : {
				name : "陇县",
				zipcode : "721200"
			},
			610328 : {
				name : "千阳县",
				zipcode : "721100"
			},
			610329 : {
				name : "麟游县",
				zipcode : "721500"
			},
			610330 : {
				name : "凤县",
				zipcode : "721700"
			},
			610331 : {
				name : "太白县",
				zipcode : "721600"
			}
		},
		610400 : {
			610402 : {
				name : "秦都区",
				zipcode : "712000"
			},
			610403 : {
				name : "杨陵区",
				zipcode : "712100"
			},
			610404 : {
				name : "渭城区",
				zipcode : "712000"
			},
			610422 : {
				name : "三原县",
				zipcode : "713800"
			},
			610423 : {
				name : "泾阳县",
				zipcode : "713700"
			},
			610424 : {
				name : "乾县",
				zipcode : "713300"
			},
			610425 : {
				name : "礼泉县",
				zipcode : "713200"
			},
			610426 : {
				name : "永寿县",
				zipcode : "713400"
			},
			610427 : {
				name : "彬县",
				zipcode : "713500"
			},
			610428 : {
				name : "长武县",
				zipcode : "713600"
			},
			610429 : {
				name : "旬邑县",
				zipcode : "711300"
			},
			610430 : {
				name : "淳化县",
				zipcode : "711200"
			},
			610431 : {
				name : "武功县",
				zipcode : "712200"
			},
			610481 : {
				name : "兴平市",
				zipcode : "713100"
			}
		},
		610500 : {
			610502 : {
				name : "临渭区",
				zipcode : "714000"
			},
			610521 : {
				name : "华县",
				zipcode : "714100"
			},
			610522 : {
				name : "潼关县",
				zipcode : "714300"
			},
			610523 : {
				name : "大荔县",
				zipcode : "715100"
			},
			610524 : {
				name : "合阳县",
				zipcode : "715300"
			},
			610525 : {
				name : "澄城县",
				zipcode : "715200"
			},
			610526 : {
				name : "蒲城县",
				zipcode : "715500"
			},
			610527 : {
				name : "白水县",
				zipcode : "715600"
			},
			610528 : {
				name : "富平县",
				zipcode : "711700"
			},
			610581 : {
				name : "韩城市",
				zipcode : "715400"
			},
			610582 : {
				name : "华阴市",
				zipcode : "714200"
			}
		},
		610600 : {
			610602 : {
				name : "宝塔区",
				zipcode : "716000"
			},
			610621 : {
				name : "延长县",
				zipcode : "717100"
			},
			610622 : {
				name : "延川县",
				zipcode : "717200"
			},
			610623 : {
				name : "子长县",
				zipcode : "717300"
			},
			610624 : {
				name : "安塞县",
				zipcode : "717400"
			},
			610625 : {
				name : "志丹县",
				zipcode : "717500"
			},
			610626 : '吴起县',
			610627 : {
				name : "甘泉县",
				zipcode : "716100"
			},
			610628 : {
				name : "富县",
				zipcode : "727500"
			},
			610629 : {
				name : "洛川县",
				zipcode : "727400"
			},
			610630 : {
				name : "宜川县",
				zipcode : "716200"
			},
			610631 : {
				name : "黄龙县",
				zipcode : "715700"
			},
			610632 : {
				name : "黄陵县",
				zipcode : "727300"
			}
		},
		610700 : {
			610702 : {
				name : "汉台区",
				zipcode : "723000"
			},
			610721 : {
				name : "南郑县",
				zipcode : "723100"
			},
			610722 : {
				name : "城固县",
				zipcode : "723200"
			},
			610723 : {
				name : "洋县",
				zipcode : "723300"
			},
			610724 : {
				name : "西乡县",
				zipcode : "723500"
			},
			610725 : {
				name : "勉县",
				zipcode : "724200"
			},
			610726 : {
				name : "宁强县",
				zipcode : "724400"
			},
			610727 : {
				name : "略阳县",
				zipcode : "724300"
			},
			610728 : {
				name : "镇巴县",
				zipcode : "723600"
			},
			610729 : {
				name : "留坝县",
				zipcode : "724100"
			},
			610730 : {
				name : "佛坪县",
				zipcode : "723400"
			}
		},
		610800 : {
			610802 : {
				name : "榆阳区",
				zipcode : "719000"
			},
			610821 : {
				name : "神木县",
				zipcode : "719300"
			},
			610822 : {
				name : "府谷县",
				zipcode : "719400"
			},
			610823 : {
				name : "横山县",
				zipcode : "719100"
			},
			610824 : {
				name : "靖边县",
				zipcode : "718500"
			},
			610825 : {
				name : "定边县",
				zipcode : "718600"
			},
			610826 : {
				name : "绥德县",
				zipcode : "718000"
			},
			610827 : {
				name : "米脂县",
				zipcode : "718100"
			},
			610828 : {
				name : "佳县",
				zipcode : "719200"
			},
			610829 : {
				name : "吴堡县",
				zipcode : "718200"
			},
			610830 : {
				name : "清涧县",
				zipcode : "718300"
			},
			610831 : {
				name : "子洲县",
				zipcode : "718400"
			}
		},
		610900 : {
			610902 : {
				name : "汉滨区",
				zipcode : "725000"
			},
			610921 : {
				name : "汉阴县",
				zipcode : "725100"
			},
			610922 : {
				name : "石泉县",
				zipcode : "725200"
			},
			610923 : {
				name : "宁陕县",
				zipcode : "711600"
			},
			610924 : {
				name : "紫阳县",
				zipcode : "725300"
			},
			610925 : {
				name : "岚皋县",
				zipcode : "725400"
			},
			610926 : {
				name : "平利县",
				zipcode : "725500"
			},
			610927 : {
				name : "镇坪县",
				zipcode : "725600"
			},
			610928 : {
				name : "旬阳县",
				zipcode : "725700"
			},
			610929 : {
				name : "白河县",
				zipcode : "725800"
			}
		},
		611000 : {
			611002 : {
				name : "商州区",
				zipcode : "726000"
			},
			611021 : {
				name : "洛南县",
				zipcode : "726100"
			},
			611022 : {
				name : "丹凤县",
				zipcode : "726200"
			},
			611023 : {
				name : "商南县",
				zipcode : "726300"
			},
			611024 : {
				name : "山阳县",
				zipcode : "726400"
			},
			611025 : {
				name : "镇安县",
				zipcode : "711500"
			},
			611026 : {
				name : "柞水县",
				zipcode : "674100"
			}
		},
		620000 : {
			620100 : '兰州市',
			620200 : '嘉峪关市',
			620300 : '金昌市',
			620400 : '白银市',
			620500 : '天水市',
			620600 : '武威市',
			620700 : '张掖市',
			620800 : '平凉市',
			620900 : '酒泉市',
			621000 : '庆阳市',
			621100 : '定西市',
			621200 : '陇南市',
			622900 : '临夏回族自治州',
			623000 : '甘南藏族自治州'
		},
		620100 : {
			620102 : {
				name : "城关区",
				zipcode : "674100"
			},
			620103 : {
				name : "七里河区",
				zipcode : "674100"
			},
			620104 : {
				name : "西固区",
				zipcode : "674100"
			},
			620105 : {
				name : "安宁区",
				zipcode : "674100"
			},
			620111 : {
				name : "红古区",
				zipcode : "678000"
			},
			620121 : {
				name : "永登县",
				zipcode : "678000"
			},
			620122 : {
				name : "皋兰县",
				zipcode : "678000"
			},
			620123 : {
				name : "榆中县",
				zipcode : "678000"
			}
		},
		620300 : {
			620302 : {
				name : "金川区",
				zipcode : "737103"
			},
			620321 : {
				name : "永昌县",
				zipcode : "737200"
			}
		},
		620400 : {
			620402 : {
				name : "白银区",
				zipcode : "730900"
			},
			620403 : {
				name : "平川区",
				zipcode : "730913"
			},
			620421 : {
				name : "靖远县",
				zipcode : "730600"
			},
			620422 : {
				name : "会宁县",
				zipcode : "730700"
			},
			620423 : {
				name : "景泰县",
				zipcode : "730400"
			}
		},
		620500 : {
			620502 : {
				name : "秦州区",
				zipcode : "741000"
			},
			620503 : {
				name : "麦积区",
				zipcode : "741020"
			},
			620521 : {
				name : "清水县",
				zipcode : "741400"
			},
			620522 : {
				name : "秦安县",
				zipcode : "671000"
			},
			620523 : {
				name : "甘谷县",
				zipcode : "671000"
			},
			620524 : {
				name : "武山县",
				zipcode : "671000"
			},
			620525 : {
				name : "张家川回族自治县",
				zipcode : "671000"
			}
		},
		620600 : {
			620602 : {
				name : "凉州区",
				zipcode : "671000"
			},
			620621 : {
				name : "民勤县",
				zipcode : "671000"
			},
			620622 : {
				name : "古浪县",
				zipcode : "671000"
			},
			620623 : {
				name : "天祝藏族自治县",
				zipcode : "671000"
			}
		},
		620700 : {
			620702 : {
				name : "甘州区",
				zipcode : "671000"
			},
			620721 : {
				name : "肃南裕固族自治县",
				zipcode : "671000"
			},
			620722 : {
				name : "民乐县",
				zipcode : "671000"
			},
			620723 : {
				name : "临泽县",
				zipcode : "671000"
			},
			620724 : {
				name : "高台县",
				zipcode : "734300"
			},
			620725 : {
				name : "山丹县",
				zipcode : "734100"
			}
		},
		620800 : {
			620802 : {
				name : "崆峒区",
				zipcode : "678400"
			},
			620821 : {
				name : "泾川县",
				zipcode : "744300"
			},
			620822 : {
				name : "灵台县",
				zipcode : "744400"
			},
			620823 : {
				name : "崇信县",
				zipcode : "744200"
			},
			620824 : {
				name : "华亭县",
				zipcode : "744100"
			},
			620825 : {
				name : "庄浪县",
				zipcode : "744600"
			},
			620826 : {
				name : "静宁县",
				zipcode : "743400"
			}
		},
		620900 : {
			620902 : {
				name : "肃州区",
				zipcode : "735000"
			},
			620921 : {
				name : "金塔县",
				zipcode : "735300"
			},
			620922 : '瓜州县',
			620923 : {
				name : "肃北蒙古族自治县",
				zipcode : "736300"
			},
			620924 : {
				name : "阿克塞哈萨克族自治县",
				zipcode : "736400"
			},
			620981 : {
				name : "玉门市",
				zipcode : "735200"
			},
			620982 : {
				name : "敦煌市",
				zipcode : "736200"
			}
		},
		621000 : {
			621002 : {
				name : "西峰区",
				zipcode : "745000"
			},
			621021 : {
				name : "庆城县",
				zipcode : "745100"
			},
			621022 : {
				name : "环县",
				zipcode : "745700"
			},
			621023 : {
				name : "华池县",
				zipcode : "745600"
			},
			621024 : {
				name : "合水县",
				zipcode : "745400"
			},
			621025 : {
				name : "正宁县",
				zipcode : "677000"
			},
			621026 : {
				name : "宁县",
				zipcode : "677000"
			},
			621027 : {
				name : "镇原县",
				zipcode : "677000"
			}
		},
		621100 : {
			621102 : {
				name : "安定区",
				zipcode : "677000"
			},
			621121 : {
				name : "通渭县",
				zipcode : "677000"
			},
			621122 : {
				name : "陇西县",
				zipcode : "677000"
			},
			621123 : {
				name : "渭源县",
				zipcode : "677000"
			},
			621124 : {
				name : "临洮县",
				zipcode : "677000"
			},
			621125 : {
				name : "漳县",
				zipcode : "748300"
			},
			621126 : {
				name : "岷县",
				zipcode : "748400"
			}
		},
		621200 : {
			621202 : {
				name : "武都区",
				zipcode : "746000"
			},
			621221 : {
				name : "成县",
				zipcode : "742500"
			},
			621222 : {
				name : "文县",
				zipcode : "746400"
			},
			621223 : {
				name : "宕昌县",
				zipcode : "748500"
			},
			621224 : {
				name : "康县",
				zipcode : "746500"
			},
			621225 : {
				name : "西和县",
				zipcode : "742100"
			},
			621226 : {
				name : "礼县",
				zipcode : "742200"
			},
			621227 : {
				name : "徽县",
				zipcode : "742300"
			},
			621228 : {
				name : "两当县",
				zipcode : "742400"
			}
		},
		622900 : {
			622901 : {
				name : "临夏市",
				zipcode : "731100"
			},
			622921 : {
				name : "临夏县",
				zipcode : "731800"
			},
			622922 : {
				name : "康乐县",
				zipcode : "731500"
			},
			622923 : {
				name : "永靖县",
				zipcode : "731600"
			},
			622924 : {
				name : "广河县",
				zipcode : "731300"
			},
			622925 : {
				name : "和政县",
				zipcode : "731200"
			},
			622926 : {
				name : "东乡族自治县",
				zipcode : "731400"
			},
			622927 : {
				name : "积石山保安族东乡族撒拉族自治县",
				zipcode : "731700"
			}
		},
		623000 : {
			623001 : {
				name : "合作市",
				zipcode : "747000"
			},
			623021 : {
				name : "临潭县",
				zipcode : "747500"
			},
			623022 : {
				name : "卓尼县",
				zipcode : "747600"
			},
			623023 : {
				name : "舟曲县",
				zipcode : "746300"
			},
			623024 : {
				name : "迭部县",
				zipcode : "747400"
			},
			623025 : {
				name : "玛曲县",
				zipcode : "747300"
			},
			623026 : {
				name : "碌曲县",
				zipcode : "747200"
			},
			623027 : {
				name : "夏河县",
				zipcode : "747100"
			}
		},
		630000 : {
			630100 : '西宁市',
			630200 : '海东市',
			632200 : '海北藏族自治州',
			632300 : '黄南藏族自治州',
			632500 : '海南藏族自治州',
			632600 : '果洛藏族自治州',
			632700 : '玉树藏族自治州',
			632800 : '海西蒙古族藏族自治州'
		},
		630100 : {
			630102 : {
				name : "城东区",
				zipcode : "810000"
			},
			630103 : {
				name : "城中区",
				zipcode : "810000"
			},
			630104 : {
				name : "城西区",
				zipcode : "810000"
			},
			630105 : {
				name : "城北区",
				zipcode : "810000"
			},
			630121 : {
				name : "大通回族土族自治县",
				zipcode : "810100"
			},
			630122 : {
				name : "湟中县",
				zipcode : "811600"
			},
			630123 : {
				name : "湟源县",
				zipcode : "812100"
			}
		},
		630200 : {
			630202 : {
				name : "乐都区",
				zipcode : "000000"
			},
			630203 : {
				name : "平安区",
				zipcode : "000000"
			},
			630222 : {
				name : "民和回族土族自治县",
				zipcode : "810800"
			},
			630223 : {
				name : "互助土族自治县",
				zipcode : "810500"
			},
			630224 : {
				name : "化隆回族自治县",
				zipcode : "810900"
			},
			630225 : {
				name : "循化撒拉族自治县",
				zipcode : "811100"
			}
		},
		632200 : {
			632221 : {
				name : "门源回族自治县",
				zipcode : "810300"
			},
			632222 : {
				name : "祁连县",
				zipcode : "810400"
			},
			632223 : {
				name : "海晏县",
				zipcode : "812200"
			},
			632224 : {
				name : "刚察县",
				zipcode : "812300"
			}
		},
		632300 : {
			632321 : {
				name : "同仁县",
				zipcode : "811300"
			},
			632322 : {
				name : "尖扎县",
				zipcode : "811200"
			},
			632323 : {
				name : "泽库县",
				zipcode : "811400"
			},
			632324 : {
				name : "河南蒙古族自治县",
				zipcode : "811500"
			}
		},
		632500 : {
			632521 : {
				name : "共和县",
				zipcode : "813000"
			},
			632522 : {
				name : "同德县",
				zipcode : "813200"
			},
			632523 : {
				name : "贵德县",
				zipcode : "811700"
			},
			632524 : {
				name : "兴海县",
				zipcode : "813300"
			},
			632525 : {
				name : "贵南县",
				zipcode : "813100"
			}
		},
		632600 : {
			632621 : {
				name : "玛沁县",
				zipcode : "814000"
			},
			632622 : {
				name : "班玛县",
				zipcode : "814300"
			},
			632623 : {
				name : "甘德县",
				zipcode : "814100"
			},
			632624 : {
				name : "达日县",
				zipcode : "814200"
			},
			632625 : {
				name : "久治县",
				zipcode : "624700"
			},
			632626 : {
				name : "玛多县",
				zipcode : "813500"
			}
		},
		632700 : {
			632701 : {
				name : "玉树市",
				zipcode : "000000"
			},
			632722 : {
				name : "杂多县",
				zipcode : "815300"
			},
			632723 : {
				name : "称多县",
				zipcode : "815100"
			},
			632724 : {
				name : "治多县",
				zipcode : "815400"
			},
			632725 : {
				name : "囊谦县",
				zipcode : "815200"
			},
			632726 : {
				name : "曲麻莱县",
				zipcode : "815500"
			}
		},
		632800 : {
			632801 : {
				name : "格尔木市",
				zipcode : "816000"
			},
			632802 : {
				name : "德令哈市",
				zipcode : "817000"
			},
			632821 : {
				name : "乌兰县",
				zipcode : "817100"
			},
			632822 : {
				name : "都兰县",
				zipcode : "816100"
			},
			632823 : {
				name : "天峻县",
				zipcode : "817200"
			},
			632825 : '海西蒙古族藏族自治州直辖'
		},
		640000 : {
			640100 : '银川市',
			640200 : '石嘴山市',
			640300 : '吴忠市',
			640400 : '固原市',
			640500 : '中卫市'
		},
		640100 : {
			640104 : {
				name : "兴庆区",
				zipcode : "750001"
			},
			640105 : {
				name : "西夏区",
				zipcode : "750021"
			},
			640106 : {
				name : "金凤区",
				zipcode : "750011"
			},
			640121 : {
				name : "永宁县",
				zipcode : "750100"
			},
			640122 : {
				name : "贺兰县",
				zipcode : "750200"
			},
			640181 : {
				name : "灵武市",
				zipcode : "750004"
			}
		},
		640200 : {
			640202 : {
				name : "大武口区",
				zipcode : "753000"
			},
			640205 : {
				name : "惠农区",
				zipcode : "753600"
			},
			640221 : {
				name : "平罗县",
				zipcode : "753400"
			}
		},
		640300 : {
			640302 : {
				name : "利通区",
				zipcode : "751100"
			},
			640303 : {
				name : "红寺堡区",
				zipcode : "751900"
			},
			640323 : {
				name : "盐池县",
				zipcode : "751500"
			},
			640324 : {
				name : "同心县",
				zipcode : "751300"
			},
			640381 : {
				name : "青铜峡市",
				zipcode : "751600"
			}
		},
		640400 : {
			640402 : {
				name : "原州区",
				zipcode : "756000"
			},
			640422 : {
				name : "西吉县",
				zipcode : "756200"
			},
			640423 : {
				name : "隆德县",
				zipcode : "756300"
			},
			640424 : {
				name : "泾源县",
				zipcode : "756400"
			},
			640425 : {
				name : "彭阳县",
				zipcode : "756500"
			}
		},
		640500 : {
			640502 : {
				name : "沙坡头区",
				zipcode : "755000"
			},
			640521 : {
				name : "中宁县",
				zipcode : "755100"
			},
			640522 : {
				name : "海原县",
				zipcode : "755200"
			}
		},
		650000 : {
			650100 : '乌鲁木齐市',
			650200 : '克拉玛依市',
			652100 : '吐鲁番市',
			652200 : '哈密地区',
			652300 : '昌吉回族自治州',
			652700 : '博尔塔拉蒙古自治州',
			652800 : '巴音郭楞蒙古自治州',
			652900 : '阿克苏地区',
			653000 : '克孜勒苏柯尔克孜自治州',
			653100 : '喀什地区',
			653200 : '和田地区',
			654000 : '伊犁哈萨克自治州',
			654200 : '塔城地区',
			654300 : '阿勒泰地区',
			659001 : {
				name : "石河子市",
				zipcode : "832000"
			},
			659002 : {
				name : "阿拉尔市",
				zipcode : "843300"
			},
			659003 : {
				name : "图木舒克市",
				zipcode : "843806"
			},
			659004 : {
				name : "五家渠市",
				zipcode : "831300"
			},
			659005 : {
				name : "北屯市",
				zipcode : "000000"
			},
			659006 : {
				name : "铁门关市",
				zipcode : "000000"
			},
			659007 : {
				name : "双河市",
				zipcode : "000000"
			},
			659008 : {
				name : "可克达拉市",
				zipcode : "000000"
			},
		},
		650100 : {
			650102 : {
				name : "天山区",
				zipcode : "830000"
			},
			650103 : {
				name : "沙依巴克区",
				zipcode : "830002"
			},
			650104 : {
				name : "新市区",
				zipcode : "071052"
			},
			650105 : {
				name : "水磨沟区",
				zipcode : "830017"
			},
			650106 : {
				name : "头屯河区",
				zipcode : "830022"
			},
			650107 : {
				name : "达坂城区",
				zipcode : "830039"
			},
			650109 : {
				name : "米东区",
				zipcode : "830019"
			},
			650121 : {
				name : "乌鲁木齐县",
				zipcode : "830063"
			}
		},
		650200 : {
			650202 : {
				name : "独山子区",
				zipcode : "834021"
			},
			650203 : {
				name : "克拉玛依区",
				zipcode : "834000"
			},
			650204 : {
				name : "白碱滩区",
				zipcode : "834008"
			},
			650205 : {
				name : "乌尔禾区",
				zipcode : "834012"
			}
		},
		652100 : {
			652101 : {
				name : "高昌区",
				zipcode : "000000"
			},
			652122 : {
				name : "鄯善县",
				zipcode : "838200"
			},
			652123 : {
				name : "托克逊县",
				zipcode : "838100"
			}
		},
		652200 : {
			652201 : {
				name : "哈密市",
				zipcode : "839000"
			},
			652222 : {
				name : "巴里坤哈萨克自治县",
				zipcode : "839200"
			},
			652223 : {
				name : "伊吾县",
				zipcode : "839300"
			}
		},
		652300 : {
			652301 : {
				name : "昌吉市",
				zipcode : "831100"
			},
			652302 : {
				name : "阜康市",
				zipcode : "831500"
			},
			652323 : {
				name : "呼图壁县",
				zipcode : "831200"
			},
			652324 : {
				name : "玛纳斯县",
				zipcode : "832200"
			},
			652325 : {
				name : "奇台县",
				zipcode : "831800"
			},
			652327 : {
				name : "吉木萨尔县",
				zipcode : "831700"
			},
			652328 : {
				name : "木垒哈萨克自治县",
				zipcode : "831900"
			}
		},
		652700 : {
			652701 : {
				name : "博乐市",
				zipcode : "833400"
			},
			652702 : '阿拉山口市',
			652722 : {
				name : "精河县",
				zipcode : "833300"
			},
			652723 : {
				name : "温泉县",
				zipcode : "833500"
			}
		},
		652800 : {
			652801 : {
				name : "库尔勒市",
				zipcode : "841000"
			},
			652822 : {
				name : "轮台县",
				zipcode : "841600"
			},
			652823 : {
				name : "尉犁县",
				zipcode : "841500"
			},
			652824 : {
				name : "若羌县",
				zipcode : "841800"
			},
			652825 : {
				name : "且末县",
				zipcode : "841900"
			},
			652826 : {
				name : "焉耆回族自治县",
				zipcode : "841100"
			},
			652827 : {
				name : "和静县",
				zipcode : "841300"
			},
			652828 : {
				name : "和硕县",
				zipcode : "841200"
			},
			652829 : {
				name : "博湖县",
				zipcode : "841400"
			}
		},
		652900 : {
			652901 : {
				name : "阿克苏市",
				zipcode : "843000"
			},
			652922 : {
				name : "温宿县",
				zipcode : "843100"
			},
			652923 : {
				name : "库车县",
				zipcode : "842000"
			},
			652924 : {
				name : "沙雅县",
				zipcode : "842200"
			},
			652925 : {
				name : "新和县",
				zipcode : "842100"
			},
			652926 : {
				name : "拜城县",
				zipcode : "842300"
			},
			652927 : {
				name : "乌什县",
				zipcode : "843400"
			},
			652928 : {
				name : "阿瓦提县",
				zipcode : "843200"
			},
			652929 : {
				name : "柯坪县",
				zipcode : "843600"
			}
		},
		653000 : {
			653001 : {
				name : "阿图什市",
				zipcode : "845350"
			},
			653022 : {
				name : "阿克陶县",
				zipcode : "845550"
			},
			653023 : {
				name : "阿合奇县",
				zipcode : "843500"
			},
			653024 : {
				name : "乌恰县",
				zipcode : "845450"
			}
		},
		653100 : {
			653101 : {
				name : "喀什市",
				zipcode : "844000"
			},
			653121 : {
				name : "疏附县",
				zipcode : "844100"
			},
			653122 : {
				name : "疏勒县",
				zipcode : "844200"
			},
			653123 : {
				name : "英吉沙县",
				zipcode : "844500"
			},
			653124 : {
				name : "泽普县",
				zipcode : "844800"
			},
			653125 : {
				name : "莎车县",
				zipcode : "844700"
			},
			653126 : {
				name : "叶城县",
				zipcode : "844900"
			},
			653127 : {
				name : "麦盖提县",
				zipcode : "844600"
			},
			653128 : {
				name : "岳普湖县",
				zipcode : "844400"
			},
			653129 : {
				name : "伽师县",
				zipcode : "844300"
			},
			653130 : {
				name : "巴楚县",
				zipcode : "843800"
			},
			653131 : {
				name : "塔什库尔干塔吉克自治县",
				zipcode : "845250"
			}
		},
		653200 : {
			653201 : {
				name : "和田市",
				zipcode : "848000"
			},
			653221 : {
				name : "和田县",
				zipcode : "848000"
			},
			653222 : {
				name : "墨玉县",
				zipcode : "848100"
			},
			653223 : {
				name : "皮山县",
				zipcode : "845150"
			},
			653224 : {
				name : "洛浦县",
				zipcode : "848200"
			},
			653225 : {
				name : "策勒县",
				zipcode : "848300"
			},
			653226 : {
				name : "于田县",
				zipcode : "848400"
			},
			653227 : {
				name : "民丰县",
				zipcode : "848500"
			}
		},
		654000 : {
			654002 : {
				name : "伊宁市",
				zipcode : "835000"
			},
			654003 : {
				name : "奎屯市",
				zipcode : "833200"
			},
			654004 : '霍尔果斯市',
			654021 : {
				name : "伊宁县",
				zipcode : "835100"
			},
			654022 : {
				name : "察布查尔锡伯自治县",
				zipcode : "835300"
			},
			654023 : {
				name : "霍城县",
				zipcode : "835200"
			},
			654024 : {
				name : "巩留县",
				zipcode : "835400"
			},
			654025 : {
				name : "新源县",
				zipcode : "835800"
			},
			654026 : {
				name : "昭苏县",
				zipcode : "835600"
			},
			654027 : {
				name : "特克斯县",
				zipcode : "835500"
			},
			654028 : {
				name : "尼勒克县",
				zipcode : "835700"
			}
		},
		654200 : {
			654201 : {
				name : "塔城市",
				zipcode : "834700"
			},
			654202 : {
				name : "乌苏市",
				zipcode : "833300"
			},
			654221 : {
				name : "额敏县",
				zipcode : "834600"
			},
			654223 : {
				name : "沙湾县",
				zipcode : "832100"
			},
			654224 : {
				name : "托里县",
				zipcode : "834500"
			},
			654225 : {
				name : "裕民县",
				zipcode : "834800"
			},
			654226 : {
				name : "和布克赛尔蒙古自治县",
				zipcode : "834400"
			}
		},
		654300 : {
			654301 : {
				name : "阿勒泰市",
				zipcode : "836500"
			},
			654321 : {
				name : "布尔津县",
				zipcode : "836600"
			},
			654322 : {
				name : "富蕴县",
				zipcode : "836100"
			},
			654323 : {
				name : "福海县",
				zipcode : "836400"
			},
			654324 : {
				name : "哈巴河县",
				zipcode : "836700"
			},
			654325 : {
				name : "青河县",
				zipcode : "836200"
			},
			654326 : {
				name : "吉木乃县",
				zipcode : "836800"
			}
		},
		810000 : {
			810001 : {
				name : "中西區",
				zipcode : "000000"
			},
			810002 : {
				name : "灣仔區",
				zipcode : "000000"
			},
			810003 : {
				name : "東區",
				zipcode : "000000"
			},
			810004 : {
				name : "南區",
				zipcode : "000000"
			},
			810005 : {
				name : "油尖旺區",
				zipcode : "000000"
			},
			810006 : {
				name : "深水埗區",
				zipcode : "000000"
			},
			810007 : {
				name : "九龍城區",
				zipcode : "000000"
			},
			810008 : {
				name : "黃大仙區",
				zipcode : "000000"
			},
			810009 : {
				name : "觀塘區",
				zipcode : "000000"
			},
			810010 : {
				name : "荃灣區",
				zipcode : "000000"
			},
			810011 : {
				name : "屯門區",
				zipcode : "000000"
			},
			810012 : {
				name : "元朗區",
				zipcode : "000000"
			},
			810013 : {
				name : "北區",
				zipcode : "000000"
			},
			810014 : {
				name : "大埔區",
				zipcode : "000000"
			},
			810015 : {
				name : "西貢區",
				zipcode : "000000"
			},
			810016 : {
				name : "沙田區",
				zipcode : "000000"
			},
			810017 : {
				name : "葵青區",
				zipcode : "000000"
			},
			810018 : {
				name : "離島區",
				zipcode : "000000"
			}
		},
		820000 : {
			820001 : {
				name : "花地瑪堂區",
				zipcode : "000000"
			},
			820002 : {
				name : "花王堂區",
				zipcode : "000000"
			},
			820003 : {
				name : "望德堂區",
				zipcode : "000000"
			},
			820004 : {
				name : "大堂區",
				zipcode : "000000"
			},
			820005 : {
				name : "風順堂區",
				zipcode : "000000"
			},
			820006 : {
				name : "嘉模堂區",
				zipcode : "000000"
			},
			820007 : {
				name : "路氹填海區",
				zipcode : "000000"
			},
			820008 : {
				name : "聖方濟各堂區",
				zipcode : "000000"
			}
		}
	};

	if (typeof window !== 'undefined') {
		window.ChineseDistricts = ChineseDistricts;
	}

	return ChineseDistricts;

});
